fakeSkyy/COD_UniCFramework/tests/impl/bsp/stm32h7/mocks/mock_stm32h7xx_hal.h
/* AUTOGENERATED FILE. DO NOT EDIT. */
#ifndef _MOCK_STM32H7XX_HAL_H
#define _MOCK_STM32H7XX_HAL_H

#include "unity.h"
#include "stm32h7xx_hal.h"

/* Ignore the following warnings, since we are copying code */
#if defined(__GNUC__) && !defined(__ICC) && !defined(__TMS470__)
#if __GNUC__ > 4 || (__GNUC__ == 4 && (__GNUC_MINOR__ > 6 || (__GNUC_MINOR__ == 6 && __GNUC_PATCHLEVEL__ > 0)))
#pragma GCC diagnostic push
#endif
#if !defined(__clang__)
#pragma GCC diagnostic ignored "-Wpragmas"
#endif
#pragma GCC diagnostic ignored "-Wunknown-pragmas"
#pragma GCC diagnostic ignored "-Wduplicate-decl-specifier"
#endif

#ifdef __cplusplus
extern "C" {
#endif

void mock_stm32h7xx_hal_Init(void);
void mock_stm32h7xx_hal_Destroy(void);
void mock_stm32h7xx_hal_Verify(void);




#define HAL_GPIO_WritePin_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_GPIO_WritePin requires _Ignore (not AndReturn)");
#define HAL_GPIO_WritePin_Ignore() HAL_GPIO_WritePin_CMockIgnore()
void HAL_GPIO_WritePin_CMockIgnore(void);
#define HAL_GPIO_WritePin_StopIgnore() HAL_GPIO_WritePin_CMockStopIgnore()
void HAL_GPIO_WritePin_CMockStopIgnore(void);
#define HAL_GPIO_WritePin_ExpectAnyArgsAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_GPIO_WritePin requires _ExpectAnyArgs (not AndReturn)");
#define HAL_GPIO_WritePin_ExpectAnyArgs() HAL_GPIO_WritePin_CMockExpectAnyArgs(__LINE__)
void HAL_GPIO_WritePin_CMockExpectAnyArgs(UNITY_LINE_TYPE cmock_line);
#define HAL_GPIO_WritePin_ExpectAndReturn(port, pin, state, cmock_retval) TEST_FAIL_MESSAGE("HAL_GPIO_WritePin requires _Expect (not AndReturn)");
#define HAL_GPIO_WritePin_Expect(port, pin, state) HAL_GPIO_WritePin_CMockExpect(__LINE__, port, pin, state)
void HAL_GPIO_WritePin_CMockExpect(UNITY_LINE_TYPE cmock_line, GPIO_TypeDef* port, uint16_t pin, GPIO_PinState state);
typedef void (* CMOCK_HAL_GPIO_WritePin_CALLBACK)(GPIO_TypeDef* port, uint16_t pin, GPIO_PinState state, int cmock_num_calls);
void HAL_GPIO_WritePin_AddCallback(CMOCK_HAL_GPIO_WritePin_CALLBACK Callback);
void HAL_GPIO_WritePin_Stub(CMOCK_HAL_GPIO_WritePin_CALLBACK Callback);
#define HAL_GPIO_WritePin_StubWithCallback HAL_GPIO_WritePin_Stub
int HAL_GPIO_WritePin_CallCount(void);
#define HAL_GPIO_WritePin_ReturnThruPtr_port(port) HAL_GPIO_WritePin_CMockReturnMemThruPtr_port(__LINE__, port, sizeof(GPIO_TypeDef))
#define HAL_GPIO_WritePin_ReturnArrayThruPtr_port(port, cmock_len) HAL_GPIO_WritePin_CMockReturnMemThruPtr_port(__LINE__, port, (cmock_len * sizeof(*port)))
#define HAL_GPIO_WritePin_ReturnMemThruPtr_port(port, cmock_size) HAL_GPIO_WritePin_CMockReturnMemThruPtr_port(__LINE__, port, (cmock_size))
void HAL_GPIO_WritePin_CMockReturnMemThruPtr_port(UNITY_LINE_TYPE cmock_line, GPIO_TypeDef const* port, size_t cmock_size);
#define HAL_GPIO_WritePin_IgnoreArg_port() HAL_GPIO_WritePin_CMockIgnoreArg_port(__LINE__)
void HAL_GPIO_WritePin_CMockIgnoreArg_port(UNITY_LINE_TYPE cmock_line);
#define HAL_GPIO_WritePin_IgnoreArg_pin() HAL_GPIO_WritePin_CMockIgnoreArg_pin(__LINE__)
void HAL_GPIO_WritePin_CMockIgnoreArg_pin(UNITY_LINE_TYPE cmock_line);
#define HAL_GPIO_WritePin_IgnoreArg_state() HAL_GPIO_WritePin_CMockIgnoreArg_state(__LINE__)
void HAL_GPIO_WritePin_CMockIgnoreArg_state(UNITY_LINE_TYPE cmock_line);
#define HAL_GPIO_TogglePin_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_GPIO_TogglePin requires _Ignore (not AndReturn)");
#define HAL_GPIO_TogglePin_Ignore() HAL_GPIO_TogglePin_CMockIgnore()
void HAL_GPIO_TogglePin_CMockIgnore(void);
#define HAL_GPIO_TogglePin_StopIgnore() HAL_GPIO_TogglePin_CMockStopIgnore()
void HAL_GPIO_TogglePin_CMockStopIgnore(void);
#define HAL_GPIO_TogglePin_ExpectAnyArgsAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_GPIO_TogglePin requires _ExpectAnyArgs (not AndReturn)");
#define HAL_GPIO_TogglePin_ExpectAnyArgs() HAL_GPIO_TogglePin_CMockExpectAnyArgs(__LINE__)
void HAL_GPIO_TogglePin_CMockExpectAnyArgs(UNITY_LINE_TYPE cmock_line);
#define HAL_GPIO_TogglePin_ExpectAndReturn(port, pin, cmock_retval) TEST_FAIL_MESSAGE("HAL_GPIO_TogglePin requires _Expect (not AndReturn)");
#define HAL_GPIO_TogglePin_Expect(port, pin) HAL_GPIO_TogglePin_CMockExpect(__LINE__, port, pin)
void HAL_GPIO_TogglePin_CMockExpect(UNITY_LINE_TYPE cmock_line, GPIO_TypeDef* port, uint16_t pin);
typedef void (* CMOCK_HAL_GPIO_TogglePin_CALLBACK)(GPIO_TypeDef* port, uint16_t pin, int cmock_num_calls);
void HAL_GPIO_TogglePin_AddCallback(CMOCK_HAL_GPIO_TogglePin_CALLBACK Callback);
void HAL_GPIO_TogglePin_Stub(CMOCK_HAL_GPIO_TogglePin_CALLBACK Callback);
#define HAL_GPIO_TogglePin_StubWithCallback HAL_GPIO_TogglePin_Stub
int HAL_GPIO_TogglePin_CallCount(void);
#define HAL_GPIO_TogglePin_ReturnThruPtr_port(port) HAL_GPIO_TogglePin_CMockReturnMemThruPtr_port(__LINE__, port, sizeof(GPIO_TypeDef))
#define HAL_GPIO_TogglePin_ReturnArrayThruPtr_port(port, cmock_len) HAL_GPIO_TogglePin_CMockReturnMemThruPtr_port(__LINE__, port, (cmock_len * sizeof(*port)))
#define HAL_GPIO_TogglePin_ReturnMemThruPtr_port(port, cmock_size) HAL_GPIO_TogglePin_CMockReturnMemThruPtr_port(__LINE__, port, (cmock_size))
void HAL_GPIO_TogglePin_CMockReturnMemThruPtr_port(UNITY_LINE_TYPE cmock_line, GPIO_TypeDef const* port, size_t cmock_size);
#define HAL_GPIO_TogglePin_IgnoreArg_port() HAL_GPIO_TogglePin_CMockIgnoreArg_port(__LINE__)
void HAL_GPIO_TogglePin_CMockIgnoreArg_port(UNITY_LINE_TYPE cmock_line);
#define HAL_GPIO_TogglePin_IgnoreArg_pin() HAL_GPIO_TogglePin_CMockIgnoreArg_pin(__LINE__)
void HAL_GPIO_TogglePin_CMockIgnoreArg_pin(UNITY_LINE_TYPE cmock_line);
#define HAL_GPIO_ReadPin_Ignore() TEST_FAIL_MESSAGE("HAL_GPIO_ReadPin requires _IgnoreAndReturn");
#define HAL_GPIO_ReadPin_IgnoreAndReturn(cmock_retval) HAL_GPIO_ReadPin_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_GPIO_ReadPin_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, GPIO_PinState cmock_to_return);
#define HAL_GPIO_ReadPin_StopIgnore() HAL_GPIO_ReadPin_CMockStopIgnore()
void HAL_GPIO_ReadPin_CMockStopIgnore(void);
#define HAL_GPIO_ReadPin_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_GPIO_ReadPin requires _ExpectAnyArgsAndReturn");
#define HAL_GPIO_ReadPin_ExpectAnyArgsAndReturn(cmock_retval) HAL_GPIO_ReadPin_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_GPIO_ReadPin_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, GPIO_PinState cmock_to_return);
#define HAL_GPIO_ReadPin_Expect(port, pin) TEST_FAIL_MESSAGE("HAL_GPIO_ReadPin requires _ExpectAndReturn");
#define HAL_GPIO_ReadPin_ExpectAndReturn(port, pin, cmock_retval) HAL_GPIO_ReadPin_CMockExpectAndReturn(__LINE__, port, pin, cmock_retval)
void HAL_GPIO_ReadPin_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, GPIO_TypeDef* port, uint16_t pin, GPIO_PinState cmock_to_return);
typedef GPIO_PinState (* CMOCK_HAL_GPIO_ReadPin_CALLBACK)(GPIO_TypeDef* port, uint16_t pin, int cmock_num_calls);
void HAL_GPIO_ReadPin_AddCallback(CMOCK_HAL_GPIO_ReadPin_CALLBACK Callback);
void HAL_GPIO_ReadPin_Stub(CMOCK_HAL_GPIO_ReadPin_CALLBACK Callback);
#define HAL_GPIO_ReadPin_StubWithCallback HAL_GPIO_ReadPin_Stub
int HAL_GPIO_ReadPin_CallCount(void);
#define HAL_GPIO_ReadPin_ReturnThruPtr_port(port) HAL_GPIO_ReadPin_CMockReturnMemThruPtr_port(__LINE__, port, sizeof(GPIO_TypeDef))
#define HAL_GPIO_ReadPin_ReturnArrayThruPtr_port(port, cmock_len) HAL_GPIO_ReadPin_CMockReturnMemThruPtr_port(__LINE__, port, (cmock_len * sizeof(*port)))
#define HAL_GPIO_ReadPin_ReturnMemThruPtr_port(port, cmock_size) HAL_GPIO_ReadPin_CMockReturnMemThruPtr_port(__LINE__, port, (cmock_size))
void HAL_GPIO_ReadPin_CMockReturnMemThruPtr_port(UNITY_LINE_TYPE cmock_line, GPIO_TypeDef const* port, size_t cmock_size);
#define HAL_GPIO_ReadPin_IgnoreArg_port() HAL_GPIO_ReadPin_CMockIgnoreArg_port(__LINE__)
void HAL_GPIO_ReadPin_CMockIgnoreArg_port(UNITY_LINE_TYPE cmock_line);
#define HAL_GPIO_ReadPin_IgnoreArg_pin() HAL_GPIO_ReadPin_CMockIgnoreArg_pin(__LINE__)
void HAL_GPIO_ReadPin_CMockIgnoreArg_pin(UNITY_LINE_TYPE cmock_line);
#define HAL_RCC_GetClockConfig_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_RCC_GetClockConfig requires _Ignore (not AndReturn)");
#define HAL_RCC_GetClockConfig_Ignore() HAL_RCC_GetClockConfig_CMockIgnore()
void HAL_RCC_GetClockConfig_CMockIgnore(void);
#define HAL_RCC_GetClockConfig_StopIgnore() HAL_RCC_GetClockConfig_CMockStopIgnore()
void HAL_RCC_GetClockConfig_CMockStopIgnore(void);
#define HAL_RCC_GetClockConfig_ExpectAnyArgsAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_RCC_GetClockConfig requires _ExpectAnyArgs (not AndReturn)");
#define HAL_RCC_GetClockConfig_ExpectAnyArgs() HAL_RCC_GetClockConfig_CMockExpectAnyArgs(__LINE__)
void HAL_RCC_GetClockConfig_CMockExpectAnyArgs(UNITY_LINE_TYPE cmock_line);
#define HAL_RCC_GetClockConfig_ExpectAndReturn(config, latency, cmock_retval) TEST_FAIL_MESSAGE("HAL_RCC_GetClockConfig requires _Expect (not AndReturn)");
#define HAL_RCC_GetClockConfig_Expect(config, latency) HAL_RCC_GetClockConfig_CMockExpect(__LINE__, config, latency)
void HAL_RCC_GetClockConfig_CMockExpect(UNITY_LINE_TYPE cmock_line, RCC_ClkInitTypeDef* config, uint32_t* latency);
typedef void (* CMOCK_HAL_RCC_GetClockConfig_CALLBACK)(RCC_ClkInitTypeDef* config, uint32_t* latency, int cmock_num_calls);
void HAL_RCC_GetClockConfig_AddCallback(CMOCK_HAL_RCC_GetClockConfig_CALLBACK Callback);
void HAL_RCC_GetClockConfig_Stub(CMOCK_HAL_RCC_GetClockConfig_CALLBACK Callback);
#define HAL_RCC_GetClockConfig_StubWithCallback HAL_RCC_GetClockConfig_Stub
int HAL_RCC_GetClockConfig_CallCount(void);
#define HAL_RCC_GetClockConfig_ReturnThruPtr_config(config) HAL_RCC_GetClockConfig_CMockReturnMemThruPtr_config(__LINE__, config, sizeof(RCC_ClkInitTypeDef))
#define HAL_RCC_GetClockConfig_ReturnArrayThruPtr_config(config, cmock_len) HAL_RCC_GetClockConfig_CMockReturnMemThruPtr_config(__LINE__, config, (cmock_len * sizeof(*config)))
#define HAL_RCC_GetClockConfig_ReturnMemThruPtr_config(config, cmock_size) HAL_RCC_GetClockConfig_CMockReturnMemThruPtr_config(__LINE__, config, (cmock_size))
void HAL_RCC_GetClockConfig_CMockReturnMemThruPtr_config(UNITY_LINE_TYPE cmock_line, RCC_ClkInitTypeDef const* config, size_t cmock_size);
#define HAL_RCC_GetClockConfig_ReturnThruPtr_latency(latency) HAL_RCC_GetClockConfig_CMockReturnMemThruPtr_latency(__LINE__, latency, sizeof(uint32_t))
#define HAL_RCC_GetClockConfig_ReturnArrayThruPtr_latency(latency, cmock_len) HAL_RCC_GetClockConfig_CMockReturnMemThruPtr_latency(__LINE__, latency, (cmock_len * sizeof(*latency)))
#define HAL_RCC_GetClockConfig_ReturnMemThruPtr_latency(latency, cmock_size) HAL_RCC_GetClockConfig_CMockReturnMemThruPtr_latency(__LINE__, latency, (cmock_size))
void HAL_RCC_GetClockConfig_CMockReturnMemThruPtr_latency(UNITY_LINE_TYPE cmock_line, uint32_t const* latency, size_t cmock_size);
#define HAL_RCC_GetClockConfig_IgnoreArg_config() HAL_RCC_GetClockConfig_CMockIgnoreArg_config(__LINE__)
void HAL_RCC_GetClockConfig_CMockIgnoreArg_config(UNITY_LINE_TYPE cmock_line);
#define HAL_RCC_GetClockConfig_IgnoreArg_latency() HAL_RCC_GetClockConfig_CMockIgnoreArg_latency(__LINE__)
void HAL_RCC_GetClockConfig_CMockIgnoreArg_latency(UNITY_LINE_TYPE cmock_line);
#define HAL_RCC_GetPCLK1Freq_Ignore() TEST_FAIL_MESSAGE("HAL_RCC_GetPCLK1Freq requires _IgnoreAndReturn");
#define HAL_RCC_GetPCLK1Freq_IgnoreAndReturn(cmock_retval) HAL_RCC_GetPCLK1Freq_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_RCC_GetPCLK1Freq_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, uint32_t cmock_to_return);
#define HAL_RCC_GetPCLK1Freq_StopIgnore() HAL_RCC_GetPCLK1Freq_CMockStopIgnore()
void HAL_RCC_GetPCLK1Freq_CMockStopIgnore(void);
#define HAL_RCC_GetPCLK1Freq_Expect() TEST_FAIL_MESSAGE("HAL_RCC_GetPCLK1Freq requires _ExpectAndReturn");
#define HAL_RCC_GetPCLK1Freq_ExpectAndReturn(cmock_retval) HAL_RCC_GetPCLK1Freq_CMockExpectAndReturn(__LINE__, cmock_retval)
void HAL_RCC_GetPCLK1Freq_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, uint32_t cmock_to_return);
typedef uint32_t (* CMOCK_HAL_RCC_GetPCLK1Freq_CALLBACK)(int cmock_num_calls);
void HAL_RCC_GetPCLK1Freq_AddCallback(CMOCK_HAL_RCC_GetPCLK1Freq_CALLBACK Callback);
void HAL_RCC_GetPCLK1Freq_Stub(CMOCK_HAL_RCC_GetPCLK1Freq_CALLBACK Callback);
#define HAL_RCC_GetPCLK1Freq_StubWithCallback HAL_RCC_GetPCLK1Freq_Stub
int HAL_RCC_GetPCLK1Freq_CallCount(void);
#define HAL_RCC_GetPCLK2Freq_Ignore() TEST_FAIL_MESSAGE("HAL_RCC_GetPCLK2Freq requires _IgnoreAndReturn");
#define HAL_RCC_GetPCLK2Freq_IgnoreAndReturn(cmock_retval) HAL_RCC_GetPCLK2Freq_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_RCC_GetPCLK2Freq_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, uint32_t cmock_to_return);
#define HAL_RCC_GetPCLK2Freq_StopIgnore() HAL_RCC_GetPCLK2Freq_CMockStopIgnore()
void HAL_RCC_GetPCLK2Freq_CMockStopIgnore(void);
#define HAL_RCC_GetPCLK2Freq_Expect() TEST_FAIL_MESSAGE("HAL_RCC_GetPCLK2Freq requires _ExpectAndReturn");
#define HAL_RCC_GetPCLK2Freq_ExpectAndReturn(cmock_retval) HAL_RCC_GetPCLK2Freq_CMockExpectAndReturn(__LINE__, cmock_retval)
void HAL_RCC_GetPCLK2Freq_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, uint32_t cmock_to_return);
typedef uint32_t (* CMOCK_HAL_RCC_GetPCLK2Freq_CALLBACK)(int cmock_num_calls);
void HAL_RCC_GetPCLK2Freq_AddCallback(CMOCK_HAL_RCC_GetPCLK2Freq_CALLBACK Callback);
void HAL_RCC_GetPCLK2Freq_Stub(CMOCK_HAL_RCC_GetPCLK2Freq_CALLBACK Callback);
#define HAL_RCC_GetPCLK2Freq_StubWithCallback HAL_RCC_GetPCLK2Freq_Stub
int HAL_RCC_GetPCLK2Freq_CallCount(void);
#define HAL_TIM_Base_Start_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_Base_Start requires _IgnoreAndReturn");
#define HAL_TIM_Base_Start_IgnoreAndReturn(cmock_retval) HAL_TIM_Base_Start_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_Base_Start_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_Base_Start_StopIgnore() HAL_TIM_Base_Start_CMockStopIgnore()
void HAL_TIM_Base_Start_CMockStopIgnore(void);
#define HAL_TIM_Base_Start_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_TIM_Base_Start requires _ExpectAnyArgsAndReturn");
#define HAL_TIM_Base_Start_ExpectAnyArgsAndReturn(cmock_retval) HAL_TIM_Base_Start_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_TIM_Base_Start_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_Base_Start_Expect(htim) TEST_FAIL_MESSAGE("HAL_TIM_Base_Start requires _ExpectAndReturn");
#define HAL_TIM_Base_Start_ExpectAndReturn(htim, cmock_retval) HAL_TIM_Base_Start_CMockExpectAndReturn(__LINE__, htim, cmock_retval)
void HAL_TIM_Base_Start_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_Base_Start_CALLBACK)(TIM_HandleTypeDef* htim, int cmock_num_calls);
void HAL_TIM_Base_Start_AddCallback(CMOCK_HAL_TIM_Base_Start_CALLBACK Callback);
void HAL_TIM_Base_Start_Stub(CMOCK_HAL_TIM_Base_Start_CALLBACK Callback);
#define HAL_TIM_Base_Start_StubWithCallback HAL_TIM_Base_Start_Stub
int HAL_TIM_Base_Start_CallCount(void);
#define HAL_TIM_Base_Start_ReturnThruPtr_htim(htim) HAL_TIM_Base_Start_CMockReturnMemThruPtr_htim(__LINE__, htim, sizeof(TIM_HandleTypeDef))
#define HAL_TIM_Base_Start_ReturnArrayThruPtr_htim(htim, cmock_len) HAL_TIM_Base_Start_CMockReturnMemThruPtr_htim(__LINE__, htim, (cmock_len * sizeof(*htim)))
#define HAL_TIM_Base_Start_ReturnMemThruPtr_htim(htim, cmock_size) HAL_TIM_Base_Start_CMockReturnMemThruPtr_htim(__LINE__, htim, (cmock_size))
void HAL_TIM_Base_Start_CMockReturnMemThruPtr_htim(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef const* htim, size_t cmock_size);
#define HAL_TIM_Base_Start_IgnoreArg_htim() HAL_TIM_Base_Start_CMockIgnoreArg_htim(__LINE__)
void HAL_TIM_Base_Start_CMockIgnoreArg_htim(UNITY_LINE_TYPE cmock_line);
#define HAL_TIM_Base_Stop_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_Base_Stop requires _IgnoreAndReturn");
#define HAL_TIM_Base_Stop_IgnoreAndReturn(cmock_retval) HAL_TIM_Base_Stop_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_Base_Stop_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_Base_Stop_StopIgnore() HAL_TIM_Base_Stop_CMockStopIgnore()
void HAL_TIM_Base_Stop_CMockStopIgnore(void);
#define HAL_TIM_Base_Stop_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_TIM_Base_Stop requires _ExpectAnyArgsAndReturn");
#define HAL_TIM_Base_Stop_ExpectAnyArgsAndReturn(cmock_retval) HAL_TIM_Base_Stop_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_TIM_Base_Stop_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_Base_Stop_Expect(htim) TEST_FAIL_MESSAGE("HAL_TIM_Base_Stop requires _ExpectAndReturn");
#define HAL_TIM_Base_Stop_ExpectAndReturn(htim, cmock_retval) HAL_TIM_Base_Stop_CMockExpectAndReturn(__LINE__, htim, cmock_retval)
void HAL_TIM_Base_Stop_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_Base_Stop_CALLBACK)(TIM_HandleTypeDef* htim, int cmock_num_calls);
void HAL_TIM_Base_Stop_AddCallback(CMOCK_HAL_TIM_Base_Stop_CALLBACK Callback);
void HAL_TIM_Base_Stop_Stub(CMOCK_HAL_TIM_Base_Stop_CALLBACK Callback);
#define HAL_TIM_Base_Stop_StubWithCallback HAL_TIM_Base_Stop_Stub
int HAL_TIM_Base_Stop_CallCount(void);
#define HAL_TIM_Base_Stop_ReturnThruPtr_htim(htim) HAL_TIM_Base_Stop_CMockReturnMemThruPtr_htim(__LINE__, htim, sizeof(TIM_HandleTypeDef))
#define HAL_TIM_Base_Stop_ReturnArrayThruPtr_htim(htim, cmock_len) HAL_TIM_Base_Stop_CMockReturnMemThruPtr_htim(__LINE__, htim, (cmock_len * sizeof(*htim)))
#define HAL_TIM_Base_Stop_ReturnMemThruPtr_htim(htim, cmock_size) HAL_TIM_Base_Stop_CMockReturnMemThruPtr_htim(__LINE__, htim, (cmock_size))
void HAL_TIM_Base_Stop_CMockReturnMemThruPtr_htim(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef const* htim, size_t cmock_size);
#define HAL_TIM_Base_Stop_IgnoreArg_htim() HAL_TIM_Base_Stop_CMockIgnoreArg_htim(__LINE__)
void HAL_TIM_Base_Stop_CMockIgnoreArg_htim(UNITY_LINE_TYPE cmock_line);
#define HAL_TIM_PWM_Start_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_PWM_Start requires _IgnoreAndReturn");
#define HAL_TIM_PWM_Start_IgnoreAndReturn(cmock_retval) HAL_TIM_PWM_Start_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_PWM_Start_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_PWM_Start_StopIgnore() HAL_TIM_PWM_Start_CMockStopIgnore()
void HAL_TIM_PWM_Start_CMockStopIgnore(void);
#define HAL_TIM_PWM_Start_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_TIM_PWM_Start requires _ExpectAnyArgsAndReturn");
#define HAL_TIM_PWM_Start_ExpectAnyArgsAndReturn(cmock_retval) HAL_TIM_PWM_Start_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_TIM_PWM_Start_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_PWM_Start_Expect(htim, channel) TEST_FAIL_MESSAGE("HAL_TIM_PWM_Start requires _ExpectAndReturn");
#define HAL_TIM_PWM_Start_ExpectAndReturn(htim, channel, cmock_retval) HAL_TIM_PWM_Start_CMockExpectAndReturn(__LINE__, htim, channel, cmock_retval)
void HAL_TIM_PWM_Start_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, uint32_t channel, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_PWM_Start_CALLBACK)(TIM_HandleTypeDef* htim, uint32_t channel, int cmock_num_calls);
void HAL_TIM_PWM_Start_AddCallback(CMOCK_HAL_TIM_PWM_Start_CALLBACK Callback);
void HAL_TIM_PWM_Start_Stub(CMOCK_HAL_TIM_PWM_Start_CALLBACK Callback);
#define HAL_TIM_PWM_Start_StubWithCallback HAL_TIM_PWM_Start_Stub
int HAL_TIM_PWM_Start_CallCount(void);
#define HAL_TIM_PWM_Start_ReturnThruPtr_htim(htim) HAL_TIM_PWM_Start_CMockReturnMemThruPtr_htim(__LINE__, htim, sizeof(TIM_HandleTypeDef))
#define HAL_TIM_PWM_Start_ReturnArrayThruPtr_htim(htim, cmock_len) HAL_TIM_PWM_Start_CMockReturnMemThruPtr_htim(__LINE__, htim, (cmock_len * sizeof(*htim)))
#define HAL_TIM_PWM_Start_ReturnMemThruPtr_htim(htim, cmock_size) HAL_TIM_PWM_Start_CMockReturnMemThruPtr_htim(__LINE__, htim, (cmock_size))
void HAL_TIM_PWM_Start_CMockReturnMemThruPtr_htim(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef const* htim, size_t cmock_size);
#define HAL_TIM_PWM_Start_IgnoreArg_htim() HAL_TIM_PWM_Start_CMockIgnoreArg_htim(__LINE__)
void HAL_TIM_PWM_Start_CMockIgnoreArg_htim(UNITY_LINE_TYPE cmock_line);
#define HAL_TIM_PWM_Start_IgnoreArg_channel() HAL_TIM_PWM_Start_CMockIgnoreArg_channel(__LINE__)
void HAL_TIM_PWM_Start_CMockIgnoreArg_channel(UNITY_LINE_TYPE cmock_line);
#define HAL_TIM_PWM_Stop_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_PWM_Stop requires _IgnoreAndReturn");
#define HAL_TIM_PWM_Stop_IgnoreAndReturn(cmock_retval) HAL_TIM_PWM_Stop_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_PWM_Stop_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_PWM_Stop_StopIgnore() HAL_TIM_PWM_Stop_CMockStopIgnore()
void HAL_TIM_PWM_Stop_CMockStopIgnore(void);
#define HAL_TIM_PWM_Stop_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_TIM_PWM_Stop requires _ExpectAnyArgsAndReturn");
#define HAL_TIM_PWM_Stop_ExpectAnyArgsAndReturn(cmock_retval) HAL_TIM_PWM_Stop_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_TIM_PWM_Stop_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_PWM_Stop_Expect(htim, channel) TEST_FAIL_MESSAGE("HAL_TIM_PWM_Stop requires _ExpectAndReturn");
#define HAL_TIM_PWM_Stop_ExpectAndReturn(htim, channel, cmock_retval) HAL_TIM_PWM_Stop_CMockExpectAndReturn(__LINE__, htim, channel, cmock_retval)
void HAL_TIM_PWM_Stop_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, uint32_t channel, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_PWM_Stop_CALLBACK)(TIM_HandleTypeDef* htim, uint32_t channel, int cmock_num_calls);
void HAL_TIM_PWM_Stop_AddCallback(CMOCK_HAL_TIM_PWM_Stop_CALLBACK Callback);
void HAL_TIM_PWM_Stop_Stub(CMOCK_HAL_TIM_PWM_Stop_CALLBACK Callback);
#define HAL_TIM_PWM_Stop_StubWithCallback HAL_TIM_PWM_Stop_Stub
int HAL_TIM_PWM_Stop_CallCount(void);
#define HAL_TIM_PWM_Stop_ReturnThruPtr_htim(htim) HAL_TIM_PWM_Stop_CMockReturnMemThruPtr_htim(__LINE__, htim, sizeof(TIM_HandleTypeDef))
#define HAL_TIM_PWM_Stop_ReturnArrayThruPtr_htim(htim, cmock_len) HAL_TIM_PWM_Stop_CMockReturnMemThruPtr_htim(__LINE__, htim, (cmock_len * sizeof(*htim)))
#define HAL_TIM_PWM_Stop_ReturnMemThruPtr_htim(htim, cmock_size) HAL_TIM_PWM_Stop_CMockReturnMemThruPtr_htim(__LINE__, htim, (cmock_size))
void HAL_TIM_PWM_Stop_CMockReturnMemThruPtr_htim(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef const* htim, size_t cmock_size);
#define HAL_TIM_PWM_Stop_IgnoreArg_htim() HAL_TIM_PWM_Stop_CMockIgnoreArg_htim(__LINE__)
void HAL_TIM_PWM_Stop_CMockIgnoreArg_htim(UNITY_LINE_TYPE cmock_line);
#define HAL_TIM_PWM_Stop_IgnoreArg_channel() HAL_TIM_PWM_Stop_CMockIgnoreArg_channel(__LINE__)
void HAL_TIM_PWM_Stop_CMockIgnoreArg_channel(UNITY_LINE_TYPE cmock_line);
#define HAL_ADCEx_Calibration_Start_Ignore() TEST_FAIL_MESSAGE("HAL_ADCEx_Calibration_Start requires _IgnoreAndReturn");
#define HAL_ADCEx_Calibration_Start_IgnoreAndReturn(cmock_retval) HAL_ADCEx_Calibration_Start_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_ADCEx_Calibration_Start_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_ADCEx_Calibration_Start_StopIgnore() HAL_ADCEx_Calibration_Start_CMockStopIgnore()
void HAL_ADCEx_Calibration_Start_CMockStopIgnore(void);
#define HAL_ADCEx_Calibration_Start_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_ADCEx_Calibration_Start requires _ExpectAnyArgsAndReturn");
#define HAL_ADCEx_Calibration_Start_ExpectAnyArgsAndReturn(cmock_retval) HAL_ADCEx_Calibration_Start_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_ADCEx_Calibration_Start_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
