fakeSkyy/COD_UniCFramework/tests/impl/bsp/stm32h7/mocks/mock_stm32h7xx_hal.h
#define HAL_ADCEx_Calibration_Start_Expect(hadc, mode, single_diff) TEST_FAIL_MESSAGE("HAL_ADCEx_Calibration_Start requires _ExpectAndReturn");
#define HAL_ADCEx_Calibration_Start_ExpectAndReturn(hadc, mode, single_diff, cmock_retval) HAL_ADCEx_Calibration_Start_CMockExpectAndReturn(__LINE__, hadc, mode, single_diff, cmock_retval)
void HAL_ADCEx_Calibration_Start_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, ADC_HandleTypeDef* hadc, uint32_t mode, uint32_t single_diff, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_ADCEx_Calibration_Start_CALLBACK)(ADC_HandleTypeDef* hadc, uint32_t mode, uint32_t single_diff, int cmock_num_calls);
void HAL_ADCEx_Calibration_Start_AddCallback(CMOCK_HAL_ADCEx_Calibration_Start_CALLBACK Callback);
void HAL_ADCEx_Calibration_Start_Stub(CMOCK_HAL_ADCEx_Calibration_Start_CALLBACK Callback);
#define HAL_ADCEx_Calibration_Start_StubWithCallback HAL_ADCEx_Calibration_Start_Stub
int HAL_ADCEx_Calibration_Start_CallCount(void);
#define HAL_ADCEx_Calibration_Start_ReturnThruPtr_hadc(hadc) HAL_ADCEx_Calibration_Start_CMockReturnMemThruPtr_hadc(__LINE__, hadc, sizeof(ADC_HandleTypeDef))
#define HAL_ADCEx_Calibration_Start_ReturnArrayThruPtr_hadc(hadc, cmock_len) HAL_ADCEx_Calibration_Start_CMockReturnMemThruPtr_hadc(__LINE__, hadc, (cmock_len * sizeof(*hadc)))
#define HAL_ADCEx_Calibration_Start_ReturnMemThruPtr_hadc(hadc, cmock_size) HAL_ADCEx_Calibration_Start_CMockReturnMemThruPtr_hadc(__LINE__, hadc, (cmock_size))
void HAL_ADCEx_Calibration_Start_CMockReturnMemThruPtr_hadc(UNITY_LINE_TYPE cmock_line, ADC_HandleTypeDef const* hadc, size_t cmock_size);
#define HAL_ADCEx_Calibration_Start_IgnoreArg_hadc() HAL_ADCEx_Calibration_Start_CMockIgnoreArg_hadc(__LINE__)
void HAL_ADCEx_Calibration_Start_CMockIgnoreArg_hadc(UNITY_LINE_TYPE cmock_line);
#define HAL_ADCEx_Calibration_Start_IgnoreArg_mode() HAL_ADCEx_Calibration_Start_CMockIgnoreArg_mode(__LINE__)
void HAL_ADCEx_Calibration_Start_CMockIgnoreArg_mode(UNITY_LINE_TYPE cmock_line);
#define HAL_ADCEx_Calibration_Start_IgnoreArg_single_diff() HAL_ADCEx_Calibration_Start_CMockIgnoreArg_single_diff(__LINE__)
void HAL_ADCEx_Calibration_Start_CMockIgnoreArg_single_diff(UNITY_LINE_TYPE cmock_line);
#define HAL_ADC_ConfigChannel_Ignore() TEST_FAIL_MESSAGE("HAL_ADC_ConfigChannel requires _IgnoreAndReturn");
#define HAL_ADC_ConfigChannel_IgnoreAndReturn(cmock_retval) HAL_ADC_ConfigChannel_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_ADC_ConfigChannel_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_ADC_ConfigChannel_StopIgnore() HAL_ADC_ConfigChannel_CMockStopIgnore()
void HAL_ADC_ConfigChannel_CMockStopIgnore(void);
#define HAL_ADC_ConfigChannel_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_ADC_ConfigChannel requires _ExpectAnyArgsAndReturn");
#define HAL_ADC_ConfigChannel_ExpectAnyArgsAndReturn(cmock_retval) HAL_ADC_ConfigChannel_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_ADC_ConfigChannel_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_ADC_ConfigChannel_Expect(hadc, config) TEST_FAIL_MESSAGE("HAL_ADC_ConfigChannel requires _ExpectAndReturn");
#define HAL_ADC_ConfigChannel_ExpectAndReturn(hadc, config, cmock_retval) HAL_ADC_ConfigChannel_CMockExpectAndReturn(__LINE__, hadc, config, cmock_retval)
void HAL_ADC_ConfigChannel_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, ADC_HandleTypeDef* hadc, ADC_ChannelConfTypeDef* config, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_ADC_ConfigChannel_CALLBACK)(ADC_HandleTypeDef* hadc, ADC_ChannelConfTypeDef* config, int cmock_num_calls);
void HAL_ADC_ConfigChannel_AddCallback(CMOCK_HAL_ADC_ConfigChannel_CALLBACK Callback);
void HAL_ADC_ConfigChannel_Stub(CMOCK_HAL_ADC_ConfigChannel_CALLBACK Callback);
#define HAL_ADC_ConfigChannel_StubWithCallback HAL_ADC_ConfigChannel_Stub
int HAL_ADC_ConfigChannel_CallCount(void);
#define HAL_ADC_ConfigChannel_ReturnThruPtr_hadc(hadc) HAL_ADC_ConfigChannel_CMockReturnMemThruPtr_hadc(__LINE__, hadc, sizeof(ADC_HandleTypeDef))
#define HAL_ADC_ConfigChannel_ReturnArrayThruPtr_hadc(hadc, cmock_len) HAL_ADC_ConfigChannel_CMockReturnMemThruPtr_hadc(__LINE__, hadc, (cmock_len * sizeof(*hadc)))
#define HAL_ADC_ConfigChannel_ReturnMemThruPtr_hadc(hadc, cmock_size) HAL_ADC_ConfigChannel_CMockReturnMemThruPtr_hadc(__LINE__, hadc, (cmock_size))
void HAL_ADC_ConfigChannel_CMockReturnMemThruPtr_hadc(UNITY_LINE_TYPE cmock_line, ADC_HandleTypeDef const* hadc, size_t cmock_size);
#define HAL_ADC_ConfigChannel_ReturnThruPtr_config(config) HAL_ADC_ConfigChannel_CMockReturnMemThruPtr_config(__LINE__, config, sizeof(ADC_ChannelConfTypeDef))
#define HAL_ADC_ConfigChannel_ReturnArrayThruPtr_config(config, cmock_len) HAL_ADC_ConfigChannel_CMockReturnMemThruPtr_config(__LINE__, config, (cmock_len * sizeof(*config)))
#define HAL_ADC_ConfigChannel_ReturnMemThruPtr_config(config, cmock_size) HAL_ADC_ConfigChannel_CMockReturnMemThruPtr_config(__LINE__, config, (cmock_size))
void HAL_ADC_ConfigChannel_CMockReturnMemThruPtr_config(UNITY_LINE_TYPE cmock_line, ADC_ChannelConfTypeDef const* config, size_t cmock_size);
#define HAL_ADC_ConfigChannel_IgnoreArg_hadc() HAL_ADC_ConfigChannel_CMockIgnoreArg_hadc(__LINE__)
void HAL_ADC_ConfigChannel_CMockIgnoreArg_hadc(UNITY_LINE_TYPE cmock_line);
#define HAL_ADC_ConfigChannel_IgnoreArg_config() HAL_ADC_ConfigChannel_CMockIgnoreArg_config(__LINE__)
void HAL_ADC_ConfigChannel_CMockIgnoreArg_config(UNITY_LINE_TYPE cmock_line);
#define HAL_ADC_Start_Ignore() TEST_FAIL_MESSAGE("HAL_ADC_Start requires _IgnoreAndReturn");
#define HAL_ADC_Start_IgnoreAndReturn(cmock_retval) HAL_ADC_Start_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_ADC_Start_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_ADC_Start_StopIgnore() HAL_ADC_Start_CMockStopIgnore()
void HAL_ADC_Start_CMockStopIgnore(void);
#define HAL_ADC_Start_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_ADC_Start requires _ExpectAnyArgsAndReturn");
#define HAL_ADC_Start_ExpectAnyArgsAndReturn(cmock_retval) HAL_ADC_Start_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_ADC_Start_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_ADC_Start_Expect(hadc) TEST_FAIL_MESSAGE("HAL_ADC_Start requires _ExpectAndReturn");
#define HAL_ADC_Start_ExpectAndReturn(hadc, cmock_retval) HAL_ADC_Start_CMockExpectAndReturn(__LINE__, hadc, cmock_retval)
void HAL_ADC_Start_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, ADC_HandleTypeDef* hadc, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_ADC_Start_CALLBACK)(ADC_HandleTypeDef* hadc, int cmock_num_calls);
void HAL_ADC_Start_AddCallback(CMOCK_HAL_ADC_Start_CALLBACK Callback);
void HAL_ADC_Start_Stub(CMOCK_HAL_ADC_Start_CALLBACK Callback);
#define HAL_ADC_Start_StubWithCallback HAL_ADC_Start_Stub
int HAL_ADC_Start_CallCount(void);
#define HAL_ADC_Start_ReturnThruPtr_hadc(hadc) HAL_ADC_Start_CMockReturnMemThruPtr_hadc(__LINE__, hadc, sizeof(ADC_HandleTypeDef))
#define HAL_ADC_Start_ReturnArrayThruPtr_hadc(hadc, cmock_len) HAL_ADC_Start_CMockReturnMemThruPtr_hadc(__LINE__, hadc, (cmock_len * sizeof(*hadc)))
#define HAL_ADC_Start_ReturnMemThruPtr_hadc(hadc, cmock_size) HAL_ADC_Start_CMockReturnMemThruPtr_hadc(__LINE__, hadc, (cmock_size))
void HAL_ADC_Start_CMockReturnMemThruPtr_hadc(UNITY_LINE_TYPE cmock_line, ADC_HandleTypeDef const* hadc, size_t cmock_size);
#define HAL_ADC_Start_IgnoreArg_hadc() HAL_ADC_Start_CMockIgnoreArg_hadc(__LINE__)
void HAL_ADC_Start_CMockIgnoreArg_hadc(UNITY_LINE_TYPE cmock_line);
#define HAL_ADC_PollForConversion_Ignore() TEST_FAIL_MESSAGE("HAL_ADC_PollForConversion requires _IgnoreAndReturn");
#define HAL_ADC_PollForConversion_IgnoreAndReturn(cmock_retval) HAL_ADC_PollForConversion_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_ADC_PollForConversion_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_ADC_PollForConversion_StopIgnore() HAL_ADC_PollForConversion_CMockStopIgnore()
void HAL_ADC_PollForConversion_CMockStopIgnore(void);
#define HAL_ADC_PollForConversion_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_ADC_PollForConversion requires _ExpectAnyArgsAndReturn");
#define HAL_ADC_PollForConversion_ExpectAnyArgsAndReturn(cmock_retval) HAL_ADC_PollForConversion_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_ADC_PollForConversion_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_ADC_PollForConversion_Expect(hadc, timeout) TEST_FAIL_MESSAGE("HAL_ADC_PollForConversion requires _ExpectAndReturn");
#define HAL_ADC_PollForConversion_ExpectAndReturn(hadc, timeout, cmock_retval) HAL_ADC_PollForConversion_CMockExpectAndReturn(__LINE__, hadc, timeout, cmock_retval)
void HAL_ADC_PollForConversion_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, ADC_HandleTypeDef* hadc, uint32_t timeout, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_ADC_PollForConversion_CALLBACK)(ADC_HandleTypeDef* hadc, uint32_t timeout, int cmock_num_calls);
void HAL_ADC_PollForConversion_AddCallback(CMOCK_HAL_ADC_PollForConversion_CALLBACK Callback);
void HAL_ADC_PollForConversion_Stub(CMOCK_HAL_ADC_PollForConversion_CALLBACK Callback);
#define HAL_ADC_PollForConversion_StubWithCallback HAL_ADC_PollForConversion_Stub
int HAL_ADC_PollForConversion_CallCount(void);
#define HAL_ADC_PollForConversion_ReturnThruPtr_hadc(hadc) HAL_ADC_PollForConversion_CMockReturnMemThruPtr_hadc(__LINE__, hadc, sizeof(ADC_HandleTypeDef))
#define HAL_ADC_PollForConversion_ReturnArrayThruPtr_hadc(hadc, cmock_len) HAL_ADC_PollForConversion_CMockReturnMemThruPtr_hadc(__LINE__, hadc, (cmock_len * sizeof(*hadc)))
#define HAL_ADC_PollForConversion_ReturnMemThruPtr_hadc(hadc, cmock_size) HAL_ADC_PollForConversion_CMockReturnMemThruPtr_hadc(__LINE__, hadc, (cmock_size))
void HAL_ADC_PollForConversion_CMockReturnMemThruPtr_hadc(UNITY_LINE_TYPE cmock_line, ADC_HandleTypeDef const* hadc, size_t cmock_size);
#define HAL_ADC_PollForConversion_IgnoreArg_hadc() HAL_ADC_PollForConversion_CMockIgnoreArg_hadc(__LINE__)
void HAL_ADC_PollForConversion_CMockIgnoreArg_hadc(UNITY_LINE_TYPE cmock_line);
#define HAL_ADC_PollForConversion_IgnoreArg_timeout() HAL_ADC_PollForConversion_CMockIgnoreArg_timeout(__LINE__)
void HAL_ADC_PollForConversion_CMockIgnoreArg_timeout(UNITY_LINE_TYPE cmock_line);
#define HAL_ADC_GetValue_Ignore() TEST_FAIL_MESSAGE("HAL_ADC_GetValue requires _IgnoreAndReturn");
#define HAL_ADC_GetValue_IgnoreAndReturn(cmock_retval) HAL_ADC_GetValue_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_ADC_GetValue_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, uint32_t cmock_to_return);
#define HAL_ADC_GetValue_StopIgnore() HAL_ADC_GetValue_CMockStopIgnore()
void HAL_ADC_GetValue_CMockStopIgnore(void);
#define HAL_ADC_GetValue_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_ADC_GetValue requires _ExpectAnyArgsAndReturn");
#define HAL_ADC_GetValue_ExpectAnyArgsAndReturn(cmock_retval) HAL_ADC_GetValue_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_ADC_GetValue_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, uint32_t cmock_to_return);
#define HAL_ADC_GetValue_Expect(hadc) TEST_FAIL_MESSAGE("HAL_ADC_GetValue requires _ExpectAndReturn");
#define HAL_ADC_GetValue_ExpectAndReturn(hadc, cmock_retval) HAL_ADC_GetValue_CMockExpectAndReturn(__LINE__, hadc, cmock_retval)
void HAL_ADC_GetValue_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, ADC_HandleTypeDef* hadc, uint32_t cmock_to_return);
typedef uint32_t (* CMOCK_HAL_ADC_GetValue_CALLBACK)(ADC_HandleTypeDef* hadc, int cmock_num_calls);
void HAL_ADC_GetValue_AddCallback(CMOCK_HAL_ADC_GetValue_CALLBACK Callback);
void HAL_ADC_GetValue_Stub(CMOCK_HAL_ADC_GetValue_CALLBACK Callback);
#define HAL_ADC_GetValue_StubWithCallback HAL_ADC_GetValue_Stub
int HAL_ADC_GetValue_CallCount(void);
#define HAL_ADC_GetValue_ReturnThruPtr_hadc(hadc) HAL_ADC_GetValue_CMockReturnMemThruPtr_hadc(__LINE__, hadc, sizeof(ADC_HandleTypeDef))
#define HAL_ADC_GetValue_ReturnArrayThruPtr_hadc(hadc, cmock_len) HAL_ADC_GetValue_CMockReturnMemThruPtr_hadc(__LINE__, hadc, (cmock_len * sizeof(*hadc)))
#define HAL_ADC_GetValue_ReturnMemThruPtr_hadc(hadc, cmock_size) HAL_ADC_GetValue_CMockReturnMemThruPtr_hadc(__LINE__, hadc, (cmock_size))
void HAL_ADC_GetValue_CMockReturnMemThruPtr_hadc(UNITY_LINE_TYPE cmock_line, ADC_HandleTypeDef const* hadc, size_t cmock_size);
#define HAL_ADC_GetValue_IgnoreArg_hadc() HAL_ADC_GetValue_CMockIgnoreArg_hadc(__LINE__)
void HAL_ADC_GetValue_CMockIgnoreArg_hadc(UNITY_LINE_TYPE cmock_line);
#define HAL_ADC_Stop_Ignore() TEST_FAIL_MESSAGE("HAL_ADC_Stop requires _IgnoreAndReturn");
#define HAL_ADC_Stop_IgnoreAndReturn(cmock_retval) HAL_ADC_Stop_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_ADC_Stop_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_ADC_Stop_StopIgnore() HAL_ADC_Stop_CMockStopIgnore()
void HAL_ADC_Stop_CMockStopIgnore(void);
#define HAL_ADC_Stop_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_ADC_Stop requires _ExpectAnyArgsAndReturn");
#define HAL_ADC_Stop_ExpectAnyArgsAndReturn(cmock_retval) HAL_ADC_Stop_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_ADC_Stop_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_ADC_Stop_Expect(hadc) TEST_FAIL_MESSAGE("HAL_ADC_Stop requires _ExpectAndReturn");
#define HAL_ADC_Stop_ExpectAndReturn(hadc, cmock_retval) HAL_ADC_Stop_CMockExpectAndReturn(__LINE__, hadc, cmock_retval)
void HAL_ADC_Stop_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, ADC_HandleTypeDef* hadc, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_ADC_Stop_CALLBACK)(ADC_HandleTypeDef* hadc, int cmock_num_calls);
void HAL_ADC_Stop_AddCallback(CMOCK_HAL_ADC_Stop_CALLBACK Callback);
void HAL_ADC_Stop_Stub(CMOCK_HAL_ADC_Stop_CALLBACK Callback);
#define HAL_ADC_Stop_StubWithCallback HAL_ADC_Stop_Stub
int HAL_ADC_Stop_CallCount(void);
#define HAL_ADC_Stop_ReturnThruPtr_hadc(hadc) HAL_ADC_Stop_CMockReturnMemThruPtr_hadc(__LINE__, hadc, sizeof(ADC_HandleTypeDef))
#define HAL_ADC_Stop_ReturnArrayThruPtr_hadc(hadc, cmock_len) HAL_ADC_Stop_CMockReturnMemThruPtr_hadc(__LINE__, hadc, (cmock_len * sizeof(*hadc)))
#define HAL_ADC_Stop_ReturnMemThruPtr_hadc(hadc, cmock_size) HAL_ADC_Stop_CMockReturnMemThruPtr_hadc(__LINE__, hadc, (cmock_size))
void HAL_ADC_Stop_CMockReturnMemThruPtr_hadc(UNITY_LINE_TYPE cmock_line, ADC_HandleTypeDef const* hadc, size_t cmock_size);
#define HAL_ADC_Stop_IgnoreArg_hadc() HAL_ADC_Stop_CMockIgnoreArg_hadc(__LINE__)
void HAL_ADC_Stop_CMockIgnoreArg_hadc(UNITY_LINE_TYPE cmock_line);
#define HAL_ADC_Start_IT_Ignore() TEST_FAIL_MESSAGE("HAL_ADC_Start_IT requires _IgnoreAndReturn");
#define HAL_ADC_Start_IT_IgnoreAndReturn(cmock_retval) HAL_ADC_Start_IT_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_ADC_Start_IT_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_ADC_Start_IT_StopIgnore() HAL_ADC_Start_IT_CMockStopIgnore()
void HAL_ADC_Start_IT_CMockStopIgnore(void);
#define HAL_ADC_Start_IT_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_ADC_Start_IT requires _ExpectAnyArgsAndReturn");
#define HAL_ADC_Start_IT_ExpectAnyArgsAndReturn(cmock_retval) HAL_ADC_Start_IT_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_ADC_Start_IT_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_ADC_Start_IT_Expect(hadc) TEST_FAIL_MESSAGE("HAL_ADC_Start_IT requires _ExpectAndReturn");
#define HAL_ADC_Start_IT_ExpectAndReturn(hadc, cmock_retval) HAL_ADC_Start_IT_CMockExpectAndReturn(__LINE__, hadc, cmock_retval)
void HAL_ADC_Start_IT_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, ADC_HandleTypeDef* hadc, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_ADC_Start_IT_CALLBACK)(ADC_HandleTypeDef* hadc, int cmock_num_calls);
void HAL_ADC_Start_IT_AddCallback(CMOCK_HAL_ADC_Start_IT_CALLBACK Callback);
void HAL_ADC_Start_IT_Stub(CMOCK_HAL_ADC_Start_IT_CALLBACK Callback);
#define HAL_ADC_Start_IT_StubWithCallback HAL_ADC_Start_IT_Stub
int HAL_ADC_Start_IT_CallCount(void);
#define HAL_ADC_Start_IT_ReturnThruPtr_hadc(hadc) HAL_ADC_Start_IT_CMockReturnMemThruPtr_hadc(__LINE__, hadc, sizeof(ADC_HandleTypeDef))
#define HAL_ADC_Start_IT_ReturnArrayThruPtr_hadc(hadc, cmock_len) HAL_ADC_Start_IT_CMockReturnMemThruPtr_hadc(__LINE__, hadc, (cmock_len * sizeof(*hadc)))
#define HAL_ADC_Start_IT_ReturnMemThruPtr_hadc(hadc, cmock_size) HAL_ADC_Start_IT_CMockReturnMemThruPtr_hadc(__LINE__, hadc, (cmock_size))
void HAL_ADC_Start_IT_CMockReturnMemThruPtr_hadc(UNITY_LINE_TYPE cmock_line, ADC_HandleTypeDef const* hadc, size_t cmock_size);
#define HAL_ADC_Start_IT_IgnoreArg_hadc() HAL_ADC_Start_IT_CMockIgnoreArg_hadc(__LINE__)
void HAL_ADC_Start_IT_CMockIgnoreArg_hadc(UNITY_LINE_TYPE cmock_line);
#define HAL_ADC_Stop_IT_Ignore() TEST_FAIL_MESSAGE("HAL_ADC_Stop_IT requires _IgnoreAndReturn");
#define HAL_ADC_Stop_IT_IgnoreAndReturn(cmock_retval) HAL_ADC_Stop_IT_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_ADC_Stop_IT_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_ADC_Stop_IT_StopIgnore() HAL_ADC_Stop_IT_CMockStopIgnore()
void HAL_ADC_Stop_IT_CMockStopIgnore(void);
#define HAL_ADC_Stop_IT_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_ADC_Stop_IT requires _ExpectAnyArgsAndReturn");
#define HAL_ADC_Stop_IT_ExpectAnyArgsAndReturn(cmock_retval) HAL_ADC_Stop_IT_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_ADC_Stop_IT_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_ADC_Stop_IT_Expect(hadc) TEST_FAIL_MESSAGE("HAL_ADC_Stop_IT requires _ExpectAndReturn");
#define HAL_ADC_Stop_IT_ExpectAndReturn(hadc, cmock_retval) HAL_ADC_Stop_IT_CMockExpectAndReturn(__LINE__, hadc, cmock_retval)
void HAL_ADC_Stop_IT_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, ADC_HandleTypeDef* hadc, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_ADC_Stop_IT_CALLBACK)(ADC_HandleTypeDef* hadc, int cmock_num_calls);
void HAL_ADC_Stop_IT_AddCallback(CMOCK_HAL_ADC_Stop_IT_CALLBACK Callback);
void HAL_ADC_Stop_IT_Stub(CMOCK_HAL_ADC_Stop_IT_CALLBACK Callback);
#define HAL_ADC_Stop_IT_StubWithCallback HAL_ADC_Stop_IT_Stub
int HAL_ADC_Stop_IT_CallCount(void);
#define HAL_ADC_Stop_IT_ReturnThruPtr_hadc(hadc) HAL_ADC_Stop_IT_CMockReturnMemThruPtr_hadc(__LINE__, hadc, sizeof(ADC_HandleTypeDef))
#define HAL_ADC_Stop_IT_ReturnArrayThruPtr_hadc(hadc, cmock_len) HAL_ADC_Stop_IT_CMockReturnMemThruPtr_hadc(__LINE__, hadc, (cmock_len * sizeof(*hadc)))
#define HAL_ADC_Stop_IT_ReturnMemThruPtr_hadc(hadc, cmock_size) HAL_ADC_Stop_IT_CMockReturnMemThruPtr_hadc(__LINE__, hadc, (cmock_size))
void HAL_ADC_Stop_IT_CMockReturnMemThruPtr_hadc(UNITY_LINE_TYPE cmock_line, ADC_HandleTypeDef const* hadc, size_t cmock_size);
#define HAL_ADC_Stop_IT_IgnoreArg_hadc() HAL_ADC_Stop_IT_CMockIgnoreArg_hadc(__LINE__)
void HAL_ADC_Stop_IT_CMockIgnoreArg_hadc(UNITY_LINE_TYPE cmock_line);
#define HAL_ADC_Start_DMA_Ignore() TEST_FAIL_MESSAGE("HAL_ADC_Start_DMA requires _IgnoreAndReturn");
#define HAL_ADC_Start_DMA_IgnoreAndReturn(cmock_retval) HAL_ADC_Start_DMA_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_ADC_Start_DMA_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_ADC_Start_DMA_StopIgnore() HAL_ADC_Start_DMA_CMockStopIgnore()
void HAL_ADC_Start_DMA_CMockStopIgnore(void);
#define HAL_ADC_Start_DMA_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_ADC_Start_DMA requires _ExpectAnyArgsAndReturn");
#define HAL_ADC_Start_DMA_ExpectAnyArgsAndReturn(cmock_retval) HAL_ADC_Start_DMA_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_ADC_Start_DMA_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_ADC_Start_DMA_Expect(hadc, buf, len) TEST_FAIL_MESSAGE("HAL_ADC_Start_DMA requires _ExpectAndReturn");
#define HAL_ADC_Start_DMA_ExpectAndReturn(hadc, buf, len, cmock_retval) HAL_ADC_Start_DMA_CMockExpectAndReturn(__LINE__, hadc, buf, len, cmock_retval)
void HAL_ADC_Start_DMA_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, ADC_HandleTypeDef* hadc, uint32_t* buf, uint32_t len, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_ADC_Start_DMA_CALLBACK)(ADC_HandleTypeDef* hadc, uint32_t* buf, uint32_t len, int cmock_num_calls);
void HAL_ADC_Start_DMA_AddCallback(CMOCK_HAL_ADC_Start_DMA_CALLBACK Callback);
void HAL_ADC_Start_DMA_Stub(CMOCK_HAL_ADC_Start_DMA_CALLBACK Callback);
#define HAL_ADC_Start_DMA_StubWithCallback HAL_ADC_Start_DMA_Stub
int HAL_ADC_Start_DMA_CallCount(void);
#define HAL_ADC_Start_DMA_ReturnThruPtr_hadc(hadc) HAL_ADC_Start_DMA_CMockReturnMemThruPtr_hadc(__LINE__, hadc, sizeof(ADC_HandleTypeDef))
#define HAL_ADC_Start_DMA_ReturnArrayThruPtr_hadc(hadc, cmock_len) HAL_ADC_Start_DMA_CMockReturnMemThruPtr_hadc(__LINE__, hadc, (cmock_len * sizeof(*hadc)))
#define HAL_ADC_Start_DMA_ReturnMemThruPtr_hadc(hadc, cmock_size) HAL_ADC_Start_DMA_CMockReturnMemThruPtr_hadc(__LINE__, hadc, (cmock_size))
void HAL_ADC_Start_DMA_CMockReturnMemThruPtr_hadc(UNITY_LINE_TYPE cmock_line, ADC_HandleTypeDef const* hadc, size_t cmock_size);
#define HAL_ADC_Start_DMA_ReturnThruPtr_buf(buf) HAL_ADC_Start_DMA_CMockReturnMemThruPtr_buf(__LINE__, buf, sizeof(uint32_t))
#define HAL_ADC_Start_DMA_ReturnArrayThruPtr_buf(buf, cmock_len) HAL_ADC_Start_DMA_CMockReturnMemThruPtr_buf(__LINE__, buf, (cmock_len * sizeof(*buf)))
#define HAL_ADC_Start_DMA_ReturnMemThruPtr_buf(buf, cmock_size) HAL_ADC_Start_DMA_CMockReturnMemThruPtr_buf(__LINE__, buf, (cmock_size))
void HAL_ADC_Start_DMA_CMockReturnMemThruPtr_buf(UNITY_LINE_TYPE cmock_line, uint32_t const* buf, size_t cmock_size);
#define HAL_ADC_Start_DMA_IgnoreArg_hadc() HAL_ADC_Start_DMA_CMockIgnoreArg_hadc(__LINE__)
void HAL_ADC_Start_DMA_CMockIgnoreArg_hadc(UNITY_LINE_TYPE cmock_line);
#define HAL_ADC_Start_DMA_IgnoreArg_buf() HAL_ADC_Start_DMA_CMockIgnoreArg_buf(__LINE__)
void HAL_ADC_Start_DMA_CMockIgnoreArg_buf(UNITY_LINE_TYPE cmock_line);
#define HAL_ADC_Start_DMA_IgnoreArg_len() HAL_ADC_Start_DMA_CMockIgnoreArg_len(__LINE__)
void HAL_ADC_Start_DMA_CMockIgnoreArg_len(UNITY_LINE_TYPE cmock_line);
#define HAL_ADC_Stop_DMA_Ignore() TEST_FAIL_MESSAGE("HAL_ADC_Stop_DMA requires _IgnoreAndReturn");
#define HAL_ADC_Stop_DMA_IgnoreAndReturn(cmock_retval) HAL_ADC_Stop_DMA_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_ADC_Stop_DMA_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_ADC_Stop_DMA_StopIgnore() HAL_ADC_Stop_DMA_CMockStopIgnore()
void HAL_ADC_Stop_DMA_CMockStopIgnore(void);
#define HAL_ADC_Stop_DMA_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_ADC_Stop_DMA requires _ExpectAnyArgsAndReturn");
#define HAL_ADC_Stop_DMA_ExpectAnyArgsAndReturn(cmock_retval) HAL_ADC_Stop_DMA_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_ADC_Stop_DMA_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_ADC_Stop_DMA_Expect(hadc) TEST_FAIL_MESSAGE("HAL_ADC_Stop_DMA requires _ExpectAndReturn");
#define HAL_ADC_Stop_DMA_ExpectAndReturn(hadc, cmock_retval) HAL_ADC_Stop_DMA_CMockExpectAndReturn(__LINE__, hadc, cmock_retval)
void HAL_ADC_Stop_DMA_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, ADC_HandleTypeDef* hadc, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_ADC_Stop_DMA_CALLBACK)(ADC_HandleTypeDef* hadc, int cmock_num_calls);
void HAL_ADC_Stop_DMA_AddCallback(CMOCK_HAL_ADC_Stop_DMA_CALLBACK Callback);
void HAL_ADC_Stop_DMA_Stub(CMOCK_HAL_ADC_Stop_DMA_CALLBACK Callback);
#define HAL_ADC_Stop_DMA_StubWithCallback HAL_ADC_Stop_DMA_Stub
int HAL_ADC_Stop_DMA_CallCount(void);
