fakeSkyy/COD_UniCFramework/tests/impl/bsp/stm32h7/mocks/mock_stm32h7xx_hal.h
#define HAL_ADC_Stop_DMA_ReturnThruPtr_hadc(hadc) HAL_ADC_Stop_DMA_CMockReturnMemThruPtr_hadc(__LINE__, hadc, sizeof(ADC_HandleTypeDef))
#define HAL_ADC_Stop_DMA_ReturnArrayThruPtr_hadc(hadc, cmock_len) HAL_ADC_Stop_DMA_CMockReturnMemThruPtr_hadc(__LINE__, hadc, (cmock_len * sizeof(*hadc)))
#define HAL_ADC_Stop_DMA_ReturnMemThruPtr_hadc(hadc, cmock_size) HAL_ADC_Stop_DMA_CMockReturnMemThruPtr_hadc(__LINE__, hadc, (cmock_size))
void HAL_ADC_Stop_DMA_CMockReturnMemThruPtr_hadc(UNITY_LINE_TYPE cmock_line, ADC_HandleTypeDef const* hadc, size_t cmock_size);
#define HAL_ADC_Stop_DMA_IgnoreArg_hadc() HAL_ADC_Stop_DMA_CMockIgnoreArg_hadc(__LINE__)
void HAL_ADC_Stop_DMA_CMockIgnoreArg_hadc(UNITY_LINE_TYPE cmock_line);
#define HAL_UART_Transmit_Ignore() TEST_FAIL_MESSAGE("HAL_UART_Transmit requires _IgnoreAndReturn");
#define HAL_UART_Transmit_IgnoreAndReturn(cmock_retval) HAL_UART_Transmit_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_UART_Transmit_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_UART_Transmit_StopIgnore() HAL_UART_Transmit_CMockStopIgnore()
void HAL_UART_Transmit_CMockStopIgnore(void);
#define HAL_UART_Transmit_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_UART_Transmit requires _ExpectAnyArgsAndReturn");
#define HAL_UART_Transmit_ExpectAnyArgsAndReturn(cmock_retval) HAL_UART_Transmit_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_UART_Transmit_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_UART_Transmit_Expect(huart, data, len, timeout) TEST_FAIL_MESSAGE("HAL_UART_Transmit requires _ExpectAndReturn");
#define HAL_UART_Transmit_ExpectAndReturn(huart, data, len, timeout, cmock_retval) HAL_UART_Transmit_CMockExpectAndReturn(__LINE__, huart, data, len, timeout, cmock_retval)
void HAL_UART_Transmit_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef* huart, const uint8_t* data, uint16_t len, uint32_t timeout, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_UART_Transmit_CALLBACK)(UART_HandleTypeDef* huart, const uint8_t* data, uint16_t len, uint32_t timeout, int cmock_num_calls);
void HAL_UART_Transmit_AddCallback(CMOCK_HAL_UART_Transmit_CALLBACK Callback);
void HAL_UART_Transmit_Stub(CMOCK_HAL_UART_Transmit_CALLBACK Callback);
#define HAL_UART_Transmit_StubWithCallback HAL_UART_Transmit_Stub
int HAL_UART_Transmit_CallCount(void);
#define HAL_UART_Transmit_ReturnThruPtr_huart(huart) HAL_UART_Transmit_CMockReturnMemThruPtr_huart(__LINE__, huart, sizeof(UART_HandleTypeDef))
#define HAL_UART_Transmit_ReturnArrayThruPtr_huart(huart, cmock_len) HAL_UART_Transmit_CMockReturnMemThruPtr_huart(__LINE__, huart, (cmock_len * sizeof(*huart)))
#define HAL_UART_Transmit_ReturnMemThruPtr_huart(huart, cmock_size) HAL_UART_Transmit_CMockReturnMemThruPtr_huart(__LINE__, huart, (cmock_size))
void HAL_UART_Transmit_CMockReturnMemThruPtr_huart(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef const* huart, size_t cmock_size);
#define HAL_UART_Transmit_IgnoreArg_huart() HAL_UART_Transmit_CMockIgnoreArg_huart(__LINE__)
void HAL_UART_Transmit_CMockIgnoreArg_huart(UNITY_LINE_TYPE cmock_line);
#define HAL_UART_Transmit_IgnoreArg_data() HAL_UART_Transmit_CMockIgnoreArg_data(__LINE__)
void HAL_UART_Transmit_CMockIgnoreArg_data(UNITY_LINE_TYPE cmock_line);
#define HAL_UART_Transmit_IgnoreArg_len() HAL_UART_Transmit_CMockIgnoreArg_len(__LINE__)
void HAL_UART_Transmit_CMockIgnoreArg_len(UNITY_LINE_TYPE cmock_line);
#define HAL_UART_Transmit_IgnoreArg_timeout() HAL_UART_Transmit_CMockIgnoreArg_timeout(__LINE__)
void HAL_UART_Transmit_CMockIgnoreArg_timeout(UNITY_LINE_TYPE cmock_line);
#define HAL_UART_Receive_Ignore() TEST_FAIL_MESSAGE("HAL_UART_Receive requires _IgnoreAndReturn");
#define HAL_UART_Receive_IgnoreAndReturn(cmock_retval) HAL_UART_Receive_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_UART_Receive_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_UART_Receive_StopIgnore() HAL_UART_Receive_CMockStopIgnore()
void HAL_UART_Receive_CMockStopIgnore(void);
#define HAL_UART_Receive_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_UART_Receive requires _ExpectAnyArgsAndReturn");
#define HAL_UART_Receive_ExpectAnyArgsAndReturn(cmock_retval) HAL_UART_Receive_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_UART_Receive_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_UART_Receive_Expect(huart, data, len, timeout) TEST_FAIL_MESSAGE("HAL_UART_Receive requires _ExpectAndReturn");
#define HAL_UART_Receive_ExpectAndReturn(huart, data, len, timeout, cmock_retval) HAL_UART_Receive_CMockExpectAndReturn(__LINE__, huart, data, len, timeout, cmock_retval)
void HAL_UART_Receive_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef* huart, uint8_t* data, uint16_t len, uint32_t timeout, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_UART_Receive_CALLBACK)(UART_HandleTypeDef* huart, uint8_t* data, uint16_t len, uint32_t timeout, int cmock_num_calls);
void HAL_UART_Receive_AddCallback(CMOCK_HAL_UART_Receive_CALLBACK Callback);
void HAL_UART_Receive_Stub(CMOCK_HAL_UART_Receive_CALLBACK Callback);
#define HAL_UART_Receive_StubWithCallback HAL_UART_Receive_Stub
int HAL_UART_Receive_CallCount(void);
#define HAL_UART_Receive_ReturnThruPtr_huart(huart) HAL_UART_Receive_CMockReturnMemThruPtr_huart(__LINE__, huart, sizeof(UART_HandleTypeDef))
#define HAL_UART_Receive_ReturnArrayThruPtr_huart(huart, cmock_len) HAL_UART_Receive_CMockReturnMemThruPtr_huart(__LINE__, huart, (cmock_len * sizeof(*huart)))
#define HAL_UART_Receive_ReturnMemThruPtr_huart(huart, cmock_size) HAL_UART_Receive_CMockReturnMemThruPtr_huart(__LINE__, huart, (cmock_size))
void HAL_UART_Receive_CMockReturnMemThruPtr_huart(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef const* huart, size_t cmock_size);
#define HAL_UART_Receive_ReturnThruPtr_data(data) HAL_UART_Receive_CMockReturnMemThruPtr_data(__LINE__, data, sizeof(uint8_t))
#define HAL_UART_Receive_ReturnArrayThruPtr_data(data, cmock_len) HAL_UART_Receive_CMockReturnMemThruPtr_data(__LINE__, data, (cmock_len * sizeof(*data)))
#define HAL_UART_Receive_ReturnMemThruPtr_data(data, cmock_size) HAL_UART_Receive_CMockReturnMemThruPtr_data(__LINE__, data, (cmock_size))
void HAL_UART_Receive_CMockReturnMemThruPtr_data(UNITY_LINE_TYPE cmock_line, uint8_t const* data, size_t cmock_size);
#define HAL_UART_Receive_IgnoreArg_huart() HAL_UART_Receive_CMockIgnoreArg_huart(__LINE__)
void HAL_UART_Receive_CMockIgnoreArg_huart(UNITY_LINE_TYPE cmock_line);
#define HAL_UART_Receive_IgnoreArg_data() HAL_UART_Receive_CMockIgnoreArg_data(__LINE__)
void HAL_UART_Receive_CMockIgnoreArg_data(UNITY_LINE_TYPE cmock_line);
#define HAL_UART_Receive_IgnoreArg_len() HAL_UART_Receive_CMockIgnoreArg_len(__LINE__)
void HAL_UART_Receive_CMockIgnoreArg_len(UNITY_LINE_TYPE cmock_line);
#define HAL_UART_Receive_IgnoreArg_timeout() HAL_UART_Receive_CMockIgnoreArg_timeout(__LINE__)
void HAL_UART_Receive_CMockIgnoreArg_timeout(UNITY_LINE_TYPE cmock_line);
#define HAL_UART_Transmit_IT_Ignore() TEST_FAIL_MESSAGE("HAL_UART_Transmit_IT requires _IgnoreAndReturn");
#define HAL_UART_Transmit_IT_IgnoreAndReturn(cmock_retval) HAL_UART_Transmit_IT_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_UART_Transmit_IT_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_UART_Transmit_IT_StopIgnore() HAL_UART_Transmit_IT_CMockStopIgnore()
void HAL_UART_Transmit_IT_CMockStopIgnore(void);
#define HAL_UART_Transmit_IT_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_UART_Transmit_IT requires _ExpectAnyArgsAndReturn");
#define HAL_UART_Transmit_IT_ExpectAnyArgsAndReturn(cmock_retval) HAL_UART_Transmit_IT_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_UART_Transmit_IT_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_UART_Transmit_IT_Expect(huart, data, len) TEST_FAIL_MESSAGE("HAL_UART_Transmit_IT requires _ExpectAndReturn");
#define HAL_UART_Transmit_IT_ExpectAndReturn(huart, data, len, cmock_retval) HAL_UART_Transmit_IT_CMockExpectAndReturn(__LINE__, huart, data, len, cmock_retval)
void HAL_UART_Transmit_IT_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef* huart, const uint8_t* data, uint16_t len, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_UART_Transmit_IT_CALLBACK)(UART_HandleTypeDef* huart, const uint8_t* data, uint16_t len, int cmock_num_calls);
void HAL_UART_Transmit_IT_AddCallback(CMOCK_HAL_UART_Transmit_IT_CALLBACK Callback);
void HAL_UART_Transmit_IT_Stub(CMOCK_HAL_UART_Transmit_IT_CALLBACK Callback);
#define HAL_UART_Transmit_IT_StubWithCallback HAL_UART_Transmit_IT_Stub
int HAL_UART_Transmit_IT_CallCount(void);
#define HAL_UART_Transmit_IT_ReturnThruPtr_huart(huart) HAL_UART_Transmit_IT_CMockReturnMemThruPtr_huart(__LINE__, huart, sizeof(UART_HandleTypeDef))
#define HAL_UART_Transmit_IT_ReturnArrayThruPtr_huart(huart, cmock_len) HAL_UART_Transmit_IT_CMockReturnMemThruPtr_huart(__LINE__, huart, (cmock_len * sizeof(*huart)))
#define HAL_UART_Transmit_IT_ReturnMemThruPtr_huart(huart, cmock_size) HAL_UART_Transmit_IT_CMockReturnMemThruPtr_huart(__LINE__, huart, (cmock_size))
void HAL_UART_Transmit_IT_CMockReturnMemThruPtr_huart(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef const* huart, size_t cmock_size);
#define HAL_UART_Transmit_IT_IgnoreArg_huart() HAL_UART_Transmit_IT_CMockIgnoreArg_huart(__LINE__)
void HAL_UART_Transmit_IT_CMockIgnoreArg_huart(UNITY_LINE_TYPE cmock_line);
#define HAL_UART_Transmit_IT_IgnoreArg_data() HAL_UART_Transmit_IT_CMockIgnoreArg_data(__LINE__)
void HAL_UART_Transmit_IT_CMockIgnoreArg_data(UNITY_LINE_TYPE cmock_line);
#define HAL_UART_Transmit_IT_IgnoreArg_len() HAL_UART_Transmit_IT_CMockIgnoreArg_len(__LINE__)
void HAL_UART_Transmit_IT_CMockIgnoreArg_len(UNITY_LINE_TYPE cmock_line);
#define HAL_UART_Transmit_DMA_Ignore() TEST_FAIL_MESSAGE("HAL_UART_Transmit_DMA requires _IgnoreAndReturn");
#define HAL_UART_Transmit_DMA_IgnoreAndReturn(cmock_retval) HAL_UART_Transmit_DMA_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_UART_Transmit_DMA_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_UART_Transmit_DMA_StopIgnore() HAL_UART_Transmit_DMA_CMockStopIgnore()
void HAL_UART_Transmit_DMA_CMockStopIgnore(void);
#define HAL_UART_Transmit_DMA_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_UART_Transmit_DMA requires _ExpectAnyArgsAndReturn");
#define HAL_UART_Transmit_DMA_ExpectAnyArgsAndReturn(cmock_retval) HAL_UART_Transmit_DMA_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_UART_Transmit_DMA_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_UART_Transmit_DMA_Expect(huart, data, len) TEST_FAIL_MESSAGE("HAL_UART_Transmit_DMA requires _ExpectAndReturn");
#define HAL_UART_Transmit_DMA_ExpectAndReturn(huart, data, len, cmock_retval) HAL_UART_Transmit_DMA_CMockExpectAndReturn(__LINE__, huart, data, len, cmock_retval)
void HAL_UART_Transmit_DMA_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef* huart, const uint8_t* data, uint16_t len, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_UART_Transmit_DMA_CALLBACK)(UART_HandleTypeDef* huart, const uint8_t* data, uint16_t len, int cmock_num_calls);
void HAL_UART_Transmit_DMA_AddCallback(CMOCK_HAL_UART_Transmit_DMA_CALLBACK Callback);
void HAL_UART_Transmit_DMA_Stub(CMOCK_HAL_UART_Transmit_DMA_CALLBACK Callback);
#define HAL_UART_Transmit_DMA_StubWithCallback HAL_UART_Transmit_DMA_Stub
int HAL_UART_Transmit_DMA_CallCount(void);
#define HAL_UART_Transmit_DMA_ReturnThruPtr_huart(huart) HAL_UART_Transmit_DMA_CMockReturnMemThruPtr_huart(__LINE__, huart, sizeof(UART_HandleTypeDef))
#define HAL_UART_Transmit_DMA_ReturnArrayThruPtr_huart(huart, cmock_len) HAL_UART_Transmit_DMA_CMockReturnMemThruPtr_huart(__LINE__, huart, (cmock_len * sizeof(*huart)))
#define HAL_UART_Transmit_DMA_ReturnMemThruPtr_huart(huart, cmock_size) HAL_UART_Transmit_DMA_CMockReturnMemThruPtr_huart(__LINE__, huart, (cmock_size))
void HAL_UART_Transmit_DMA_CMockReturnMemThruPtr_huart(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef const* huart, size_t cmock_size);
#define HAL_UART_Transmit_DMA_IgnoreArg_huart() HAL_UART_Transmit_DMA_CMockIgnoreArg_huart(__LINE__)
void HAL_UART_Transmit_DMA_CMockIgnoreArg_huart(UNITY_LINE_TYPE cmock_line);
#define HAL_UART_Transmit_DMA_IgnoreArg_data() HAL_UART_Transmit_DMA_CMockIgnoreArg_data(__LINE__)
void HAL_UART_Transmit_DMA_CMockIgnoreArg_data(UNITY_LINE_TYPE cmock_line);
#define HAL_UART_Transmit_DMA_IgnoreArg_len() HAL_UART_Transmit_DMA_CMockIgnoreArg_len(__LINE__)
void HAL_UART_Transmit_DMA_CMockIgnoreArg_len(UNITY_LINE_TYPE cmock_line);
#define HAL_UARTEx_ReceiveToIdle_IT_Ignore() TEST_FAIL_MESSAGE("HAL_UARTEx_ReceiveToIdle_IT requires _IgnoreAndReturn");
#define HAL_UARTEx_ReceiveToIdle_IT_IgnoreAndReturn(cmock_retval) HAL_UARTEx_ReceiveToIdle_IT_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_UARTEx_ReceiveToIdle_IT_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_UARTEx_ReceiveToIdle_IT_StopIgnore() HAL_UARTEx_ReceiveToIdle_IT_CMockStopIgnore()
void HAL_UARTEx_ReceiveToIdle_IT_CMockStopIgnore(void);
#define HAL_UARTEx_ReceiveToIdle_IT_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_UARTEx_ReceiveToIdle_IT requires _ExpectAnyArgsAndReturn");
#define HAL_UARTEx_ReceiveToIdle_IT_ExpectAnyArgsAndReturn(cmock_retval) HAL_UARTEx_ReceiveToIdle_IT_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_UARTEx_ReceiveToIdle_IT_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_UARTEx_ReceiveToIdle_IT_Expect(huart, data, len) TEST_FAIL_MESSAGE("HAL_UARTEx_ReceiveToIdle_IT requires _ExpectAndReturn");
#define HAL_UARTEx_ReceiveToIdle_IT_ExpectAndReturn(huart, data, len, cmock_retval) HAL_UARTEx_ReceiveToIdle_IT_CMockExpectAndReturn(__LINE__, huart, data, len, cmock_retval)
void HAL_UARTEx_ReceiveToIdle_IT_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef* huart, uint8_t* data, uint16_t len, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_UARTEx_ReceiveToIdle_IT_CALLBACK)(UART_HandleTypeDef* huart, uint8_t* data, uint16_t len, int cmock_num_calls);
void HAL_UARTEx_ReceiveToIdle_IT_AddCallback(CMOCK_HAL_UARTEx_ReceiveToIdle_IT_CALLBACK Callback);
void HAL_UARTEx_ReceiveToIdle_IT_Stub(CMOCK_HAL_UARTEx_ReceiveToIdle_IT_CALLBACK Callback);
#define HAL_UARTEx_ReceiveToIdle_IT_StubWithCallback HAL_UARTEx_ReceiveToIdle_IT_Stub
int HAL_UARTEx_ReceiveToIdle_IT_CallCount(void);
#define HAL_UARTEx_ReceiveToIdle_IT_ReturnThruPtr_huart(huart) HAL_UARTEx_ReceiveToIdle_IT_CMockReturnMemThruPtr_huart(__LINE__, huart, sizeof(UART_HandleTypeDef))
#define HAL_UARTEx_ReceiveToIdle_IT_ReturnArrayThruPtr_huart(huart, cmock_len) HAL_UARTEx_ReceiveToIdle_IT_CMockReturnMemThruPtr_huart(__LINE__, huart, (cmock_len * sizeof(*huart)))
#define HAL_UARTEx_ReceiveToIdle_IT_ReturnMemThruPtr_huart(huart, cmock_size) HAL_UARTEx_ReceiveToIdle_IT_CMockReturnMemThruPtr_huart(__LINE__, huart, (cmock_size))
void HAL_UARTEx_ReceiveToIdle_IT_CMockReturnMemThruPtr_huart(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef const* huart, size_t cmock_size);
#define HAL_UARTEx_ReceiveToIdle_IT_ReturnThruPtr_data(data) HAL_UARTEx_ReceiveToIdle_IT_CMockReturnMemThruPtr_data(__LINE__, data, sizeof(uint8_t))
#define HAL_UARTEx_ReceiveToIdle_IT_ReturnArrayThruPtr_data(data, cmock_len) HAL_UARTEx_ReceiveToIdle_IT_CMockReturnMemThruPtr_data(__LINE__, data, (cmock_len * sizeof(*data)))
#define HAL_UARTEx_ReceiveToIdle_IT_ReturnMemThruPtr_data(data, cmock_size) HAL_UARTEx_ReceiveToIdle_IT_CMockReturnMemThruPtr_data(__LINE__, data, (cmock_size))
void HAL_UARTEx_ReceiveToIdle_IT_CMockReturnMemThruPtr_data(UNITY_LINE_TYPE cmock_line, uint8_t const* data, size_t cmock_size);
#define HAL_UARTEx_ReceiveToIdle_IT_IgnoreArg_huart() HAL_UARTEx_ReceiveToIdle_IT_CMockIgnoreArg_huart(__LINE__)
void HAL_UARTEx_ReceiveToIdle_IT_CMockIgnoreArg_huart(UNITY_LINE_TYPE cmock_line);
#define HAL_UARTEx_ReceiveToIdle_IT_IgnoreArg_data() HAL_UARTEx_ReceiveToIdle_IT_CMockIgnoreArg_data(__LINE__)
void HAL_UARTEx_ReceiveToIdle_IT_CMockIgnoreArg_data(UNITY_LINE_TYPE cmock_line);
#define HAL_UARTEx_ReceiveToIdle_IT_IgnoreArg_len() HAL_UARTEx_ReceiveToIdle_IT_CMockIgnoreArg_len(__LINE__)
void HAL_UARTEx_ReceiveToIdle_IT_CMockIgnoreArg_len(UNITY_LINE_TYPE cmock_line);
#define HAL_UARTEx_ReceiveToIdle_DMA_Ignore() TEST_FAIL_MESSAGE("HAL_UARTEx_ReceiveToIdle_DMA requires _IgnoreAndReturn");
#define HAL_UARTEx_ReceiveToIdle_DMA_IgnoreAndReturn(cmock_retval) HAL_UARTEx_ReceiveToIdle_DMA_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_UARTEx_ReceiveToIdle_DMA_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_UARTEx_ReceiveToIdle_DMA_StopIgnore() HAL_UARTEx_ReceiveToIdle_DMA_CMockStopIgnore()
void HAL_UARTEx_ReceiveToIdle_DMA_CMockStopIgnore(void);
#define HAL_UARTEx_ReceiveToIdle_DMA_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_UARTEx_ReceiveToIdle_DMA requires _ExpectAnyArgsAndReturn");
#define HAL_UARTEx_ReceiveToIdle_DMA_ExpectAnyArgsAndReturn(cmock_retval) HAL_UARTEx_ReceiveToIdle_DMA_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_UARTEx_ReceiveToIdle_DMA_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_UARTEx_ReceiveToIdle_DMA_Expect(huart, data, len) TEST_FAIL_MESSAGE("HAL_UARTEx_ReceiveToIdle_DMA requires _ExpectAndReturn");
#define HAL_UARTEx_ReceiveToIdle_DMA_ExpectAndReturn(huart, data, len, cmock_retval) HAL_UARTEx_ReceiveToIdle_DMA_CMockExpectAndReturn(__LINE__, huart, data, len, cmock_retval)
void HAL_UARTEx_ReceiveToIdle_DMA_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef* huart, uint8_t* data, uint16_t len, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_UARTEx_ReceiveToIdle_DMA_CALLBACK)(UART_HandleTypeDef* huart, uint8_t* data, uint16_t len, int cmock_num_calls);
void HAL_UARTEx_ReceiveToIdle_DMA_AddCallback(CMOCK_HAL_UARTEx_ReceiveToIdle_DMA_CALLBACK Callback);
void HAL_UARTEx_ReceiveToIdle_DMA_Stub(CMOCK_HAL_UARTEx_ReceiveToIdle_DMA_CALLBACK Callback);
#define HAL_UARTEx_ReceiveToIdle_DMA_StubWithCallback HAL_UARTEx_ReceiveToIdle_DMA_Stub
int HAL_UARTEx_ReceiveToIdle_DMA_CallCount(void);
#define HAL_UARTEx_ReceiveToIdle_DMA_ReturnThruPtr_huart(huart) HAL_UARTEx_ReceiveToIdle_DMA_CMockReturnMemThruPtr_huart(__LINE__, huart, sizeof(UART_HandleTypeDef))
#define HAL_UARTEx_ReceiveToIdle_DMA_ReturnArrayThruPtr_huart(huart, cmock_len) HAL_UARTEx_ReceiveToIdle_DMA_CMockReturnMemThruPtr_huart(__LINE__, huart, (cmock_len * sizeof(*huart)))
#define HAL_UARTEx_ReceiveToIdle_DMA_ReturnMemThruPtr_huart(huart, cmock_size) HAL_UARTEx_ReceiveToIdle_DMA_CMockReturnMemThruPtr_huart(__LINE__, huart, (cmock_size))
void HAL_UARTEx_ReceiveToIdle_DMA_CMockReturnMemThruPtr_huart(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef const* huart, size_t cmock_size);
#define HAL_UARTEx_ReceiveToIdle_DMA_ReturnThruPtr_data(data) HAL_UARTEx_ReceiveToIdle_DMA_CMockReturnMemThruPtr_data(__LINE__, data, sizeof(uint8_t))
#define HAL_UARTEx_ReceiveToIdle_DMA_ReturnArrayThruPtr_data(data, cmock_len) HAL_UARTEx_ReceiveToIdle_DMA_CMockReturnMemThruPtr_data(__LINE__, data, (cmock_len * sizeof(*data)))
#define HAL_UARTEx_ReceiveToIdle_DMA_ReturnMemThruPtr_data(data, cmock_size) HAL_UARTEx_ReceiveToIdle_DMA_CMockReturnMemThruPtr_data(__LINE__, data, (cmock_size))
void HAL_UARTEx_ReceiveToIdle_DMA_CMockReturnMemThruPtr_data(UNITY_LINE_TYPE cmock_line, uint8_t const* data, size_t cmock_size);
#define HAL_UARTEx_ReceiveToIdle_DMA_IgnoreArg_huart() HAL_UARTEx_ReceiveToIdle_DMA_CMockIgnoreArg_huart(__LINE__)
void HAL_UARTEx_ReceiveToIdle_DMA_CMockIgnoreArg_huart(UNITY_LINE_TYPE cmock_line);
#define HAL_UARTEx_ReceiveToIdle_DMA_IgnoreArg_data() HAL_UARTEx_ReceiveToIdle_DMA_CMockIgnoreArg_data(__LINE__)
void HAL_UARTEx_ReceiveToIdle_DMA_CMockIgnoreArg_data(UNITY_LINE_TYPE cmock_line);
#define HAL_UARTEx_ReceiveToIdle_DMA_IgnoreArg_len() HAL_UARTEx_ReceiveToIdle_DMA_CMockIgnoreArg_len(__LINE__)
void HAL_UARTEx_ReceiveToIdle_DMA_CMockIgnoreArg_len(UNITY_LINE_TYPE cmock_line);
#define HAL_UART_AbortReceive_Ignore() TEST_FAIL_MESSAGE("HAL_UART_AbortReceive requires _IgnoreAndReturn");
#define HAL_UART_AbortReceive_IgnoreAndReturn(cmock_retval) HAL_UART_AbortReceive_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_UART_AbortReceive_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_UART_AbortReceive_StopIgnore() HAL_UART_AbortReceive_CMockStopIgnore()
void HAL_UART_AbortReceive_CMockStopIgnore(void);
#define HAL_UART_AbortReceive_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_UART_AbortReceive requires _ExpectAnyArgsAndReturn");
#define HAL_UART_AbortReceive_ExpectAnyArgsAndReturn(cmock_retval) HAL_UART_AbortReceive_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_UART_AbortReceive_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_UART_AbortReceive_Expect(huart) TEST_FAIL_MESSAGE("HAL_UART_AbortReceive requires _ExpectAndReturn");
#define HAL_UART_AbortReceive_ExpectAndReturn(huart, cmock_retval) HAL_UART_AbortReceive_CMockExpectAndReturn(__LINE__, huart, cmock_retval)
void HAL_UART_AbortReceive_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef* huart, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_UART_AbortReceive_CALLBACK)(UART_HandleTypeDef* huart, int cmock_num_calls);
void HAL_UART_AbortReceive_AddCallback(CMOCK_HAL_UART_AbortReceive_CALLBACK Callback);
void HAL_UART_AbortReceive_Stub(CMOCK_HAL_UART_AbortReceive_CALLBACK Callback);
#define HAL_UART_AbortReceive_StubWithCallback HAL_UART_AbortReceive_Stub
int HAL_UART_AbortReceive_CallCount(void);
#define HAL_UART_AbortReceive_ReturnThruPtr_huart(huart) HAL_UART_AbortReceive_CMockReturnMemThruPtr_huart(__LINE__, huart, sizeof(UART_HandleTypeDef))
#define HAL_UART_AbortReceive_ReturnArrayThruPtr_huart(huart, cmock_len) HAL_UART_AbortReceive_CMockReturnMemThruPtr_huart(__LINE__, huart, (cmock_len * sizeof(*huart)))
#define HAL_UART_AbortReceive_ReturnMemThruPtr_huart(huart, cmock_size) HAL_UART_AbortReceive_CMockReturnMemThruPtr_huart(__LINE__, huart, (cmock_size))
void HAL_UART_AbortReceive_CMockReturnMemThruPtr_huart(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef const* huart, size_t cmock_size);
#define HAL_UART_AbortReceive_IgnoreArg_huart() HAL_UART_AbortReceive_CMockIgnoreArg_huart(__LINE__)
void HAL_UART_AbortReceive_CMockIgnoreArg_huart(UNITY_LINE_TYPE cmock_line);
#define HAL_UART_RegisterRxEventCallback_Ignore() TEST_FAIL_MESSAGE("HAL_UART_RegisterRxEventCallback requires _IgnoreAndReturn");
#define HAL_UART_RegisterRxEventCallback_IgnoreAndReturn(cmock_retval) HAL_UART_RegisterRxEventCallback_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_UART_RegisterRxEventCallback_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_UART_RegisterRxEventCallback_StopIgnore() HAL_UART_RegisterRxEventCallback_CMockStopIgnore()
void HAL_UART_RegisterRxEventCallback_CMockStopIgnore(void);
#define HAL_UART_RegisterRxEventCallback_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_UART_RegisterRxEventCallback requires _ExpectAnyArgsAndReturn");
#define HAL_UART_RegisterRxEventCallback_ExpectAnyArgsAndReturn(cmock_retval) HAL_UART_RegisterRxEventCallback_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_UART_RegisterRxEventCallback_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
