fakeSkyy/COD_UniCFramework/tests/impl/bsp/stm32h7/mocks/mock_stm32h7xx_hal.h
#define HAL_UART_RegisterRxEventCallback_Expect(huart, callback) TEST_FAIL_MESSAGE("HAL_UART_RegisterRxEventCallback requires _ExpectAndReturn");
#define HAL_UART_RegisterRxEventCallback_ExpectAndReturn(huart, callback, cmock_retval) HAL_UART_RegisterRxEventCallback_CMockExpectAndReturn(__LINE__, huart, callback, cmock_retval)
void HAL_UART_RegisterRxEventCallback_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef* huart, pUART_RxEventCallbackTypeDef callback, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_UART_RegisterRxEventCallback_CALLBACK)(UART_HandleTypeDef* huart, pUART_RxEventCallbackTypeDef callback, int cmock_num_calls);
void HAL_UART_RegisterRxEventCallback_AddCallback(CMOCK_HAL_UART_RegisterRxEventCallback_CALLBACK Callback);
void HAL_UART_RegisterRxEventCallback_Stub(CMOCK_HAL_UART_RegisterRxEventCallback_CALLBACK Callback);
#define HAL_UART_RegisterRxEventCallback_StubWithCallback HAL_UART_RegisterRxEventCallback_Stub
int HAL_UART_RegisterRxEventCallback_CallCount(void);
#define HAL_UART_RegisterRxEventCallback_ReturnThruPtr_huart(huart) HAL_UART_RegisterRxEventCallback_CMockReturnMemThruPtr_huart(__LINE__, huart, sizeof(UART_HandleTypeDef))
#define HAL_UART_RegisterRxEventCallback_ReturnArrayThruPtr_huart(huart, cmock_len) HAL_UART_RegisterRxEventCallback_CMockReturnMemThruPtr_huart(__LINE__, huart, (cmock_len * sizeof(*huart)))
#define HAL_UART_RegisterRxEventCallback_ReturnMemThruPtr_huart(huart, cmock_size) HAL_UART_RegisterRxEventCallback_CMockReturnMemThruPtr_huart(__LINE__, huart, (cmock_size))
void HAL_UART_RegisterRxEventCallback_CMockReturnMemThruPtr_huart(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef const* huart, size_t cmock_size);
#define HAL_UART_RegisterRxEventCallback_IgnoreArg_huart() HAL_UART_RegisterRxEventCallback_CMockIgnoreArg_huart(__LINE__)
void HAL_UART_RegisterRxEventCallback_CMockIgnoreArg_huart(UNITY_LINE_TYPE cmock_line);
#define HAL_UART_RegisterRxEventCallback_IgnoreArg_callback() HAL_UART_RegisterRxEventCallback_CMockIgnoreArg_callback(__LINE__)
void HAL_UART_RegisterRxEventCallback_CMockIgnoreArg_callback(UNITY_LINE_TYPE cmock_line);
#define HAL_UART_RegisterCallback_Ignore() TEST_FAIL_MESSAGE("HAL_UART_RegisterCallback requires _IgnoreAndReturn");
#define HAL_UART_RegisterCallback_IgnoreAndReturn(cmock_retval) HAL_UART_RegisterCallback_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_UART_RegisterCallback_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_UART_RegisterCallback_StopIgnore() HAL_UART_RegisterCallback_CMockStopIgnore()
void HAL_UART_RegisterCallback_CMockStopIgnore(void);
#define HAL_UART_RegisterCallback_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_UART_RegisterCallback requires _ExpectAnyArgsAndReturn");
#define HAL_UART_RegisterCallback_ExpectAnyArgsAndReturn(cmock_retval) HAL_UART_RegisterCallback_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_UART_RegisterCallback_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_UART_RegisterCallback_Expect(huart, id, callback) TEST_FAIL_MESSAGE("HAL_UART_RegisterCallback requires _ExpectAndReturn");
#define HAL_UART_RegisterCallback_ExpectAndReturn(huart, id, callback, cmock_retval) HAL_UART_RegisterCallback_CMockExpectAndReturn(__LINE__, huart, id, callback, cmock_retval)
void HAL_UART_RegisterCallback_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef* huart, uint32_t id, pUART_CallbackTypeDef callback, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_UART_RegisterCallback_CALLBACK)(UART_HandleTypeDef* huart, uint32_t id, pUART_CallbackTypeDef callback, int cmock_num_calls);
void HAL_UART_RegisterCallback_AddCallback(CMOCK_HAL_UART_RegisterCallback_CALLBACK Callback);
void HAL_UART_RegisterCallback_Stub(CMOCK_HAL_UART_RegisterCallback_CALLBACK Callback);
#define HAL_UART_RegisterCallback_StubWithCallback HAL_UART_RegisterCallback_Stub
int HAL_UART_RegisterCallback_CallCount(void);
#define HAL_UART_RegisterCallback_ReturnThruPtr_huart(huart) HAL_UART_RegisterCallback_CMockReturnMemThruPtr_huart(__LINE__, huart, sizeof(UART_HandleTypeDef))
#define HAL_UART_RegisterCallback_ReturnArrayThruPtr_huart(huart, cmock_len) HAL_UART_RegisterCallback_CMockReturnMemThruPtr_huart(__LINE__, huart, (cmock_len * sizeof(*huart)))
#define HAL_UART_RegisterCallback_ReturnMemThruPtr_huart(huart, cmock_size) HAL_UART_RegisterCallback_CMockReturnMemThruPtr_huart(__LINE__, huart, (cmock_size))
void HAL_UART_RegisterCallback_CMockReturnMemThruPtr_huart(UNITY_LINE_TYPE cmock_line, UART_HandleTypeDef const* huart, size_t cmock_size);
#define HAL_UART_RegisterCallback_IgnoreArg_huart() HAL_UART_RegisterCallback_CMockIgnoreArg_huart(__LINE__)
void HAL_UART_RegisterCallback_CMockIgnoreArg_huart(UNITY_LINE_TYPE cmock_line);
#define HAL_UART_RegisterCallback_IgnoreArg_id() HAL_UART_RegisterCallback_CMockIgnoreArg_id(__LINE__)
void HAL_UART_RegisterCallback_CMockIgnoreArg_id(UNITY_LINE_TYPE cmock_line);
#define HAL_UART_RegisterCallback_IgnoreArg_callback() HAL_UART_RegisterCallback_CMockIgnoreArg_callback(__LINE__)
void HAL_UART_RegisterCallback_CMockIgnoreArg_callback(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Mem_Write_Ignore() TEST_FAIL_MESSAGE("HAL_I2C_Mem_Write requires _IgnoreAndReturn");
#define HAL_I2C_Mem_Write_IgnoreAndReturn(cmock_retval) HAL_I2C_Mem_Write_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_I2C_Mem_Write_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_I2C_Mem_Write_StopIgnore() HAL_I2C_Mem_Write_CMockStopIgnore()
void HAL_I2C_Mem_Write_CMockStopIgnore(void);
#define HAL_I2C_Mem_Write_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_I2C_Mem_Write requires _ExpectAnyArgsAndReturn");
#define HAL_I2C_Mem_Write_ExpectAnyArgsAndReturn(cmock_retval) HAL_I2C_Mem_Write_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_I2C_Mem_Write_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_I2C_Mem_Write_Expect(hi2c, addr, mem_addr, mem_addr_size, data, len, timeout) TEST_FAIL_MESSAGE("HAL_I2C_Mem_Write requires _ExpectAndReturn");
#define HAL_I2C_Mem_Write_ExpectAndReturn(hi2c, addr, mem_addr, mem_addr_size, data, len, timeout, cmock_retval) HAL_I2C_Mem_Write_CMockExpectAndReturn(__LINE__, hi2c, addr, mem_addr, mem_addr_size, data, len, timeout, cmock_retval)
void HAL_I2C_Mem_Write_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, I2C_HandleTypeDef* hi2c, uint16_t addr, uint16_t mem_addr, uint16_t mem_addr_size, uint8_t* data, uint16_t len, uint32_t timeout, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_I2C_Mem_Write_CALLBACK)(I2C_HandleTypeDef* hi2c, uint16_t addr, uint16_t mem_addr, uint16_t mem_addr_size, uint8_t* data, uint16_t len, uint32_t timeout, int cmock_num_calls);
void HAL_I2C_Mem_Write_AddCallback(CMOCK_HAL_I2C_Mem_Write_CALLBACK Callback);
void HAL_I2C_Mem_Write_Stub(CMOCK_HAL_I2C_Mem_Write_CALLBACK Callback);
#define HAL_I2C_Mem_Write_StubWithCallback HAL_I2C_Mem_Write_Stub
int HAL_I2C_Mem_Write_CallCount(void);
#define HAL_I2C_Mem_Write_ReturnThruPtr_hi2c(hi2c) HAL_I2C_Mem_Write_CMockReturnMemThruPtr_hi2c(__LINE__, hi2c, sizeof(I2C_HandleTypeDef))
#define HAL_I2C_Mem_Write_ReturnArrayThruPtr_hi2c(hi2c, cmock_len) HAL_I2C_Mem_Write_CMockReturnMemThruPtr_hi2c(__LINE__, hi2c, (cmock_len * sizeof(*hi2c)))
#define HAL_I2C_Mem_Write_ReturnMemThruPtr_hi2c(hi2c, cmock_size) HAL_I2C_Mem_Write_CMockReturnMemThruPtr_hi2c(__LINE__, hi2c, (cmock_size))
void HAL_I2C_Mem_Write_CMockReturnMemThruPtr_hi2c(UNITY_LINE_TYPE cmock_line, I2C_HandleTypeDef const* hi2c, size_t cmock_size);
#define HAL_I2C_Mem_Write_ReturnThruPtr_data(data) HAL_I2C_Mem_Write_CMockReturnMemThruPtr_data(__LINE__, data, sizeof(uint8_t))
#define HAL_I2C_Mem_Write_ReturnArrayThruPtr_data(data, cmock_len) HAL_I2C_Mem_Write_CMockReturnMemThruPtr_data(__LINE__, data, (cmock_len * sizeof(*data)))
#define HAL_I2C_Mem_Write_ReturnMemThruPtr_data(data, cmock_size) HAL_I2C_Mem_Write_CMockReturnMemThruPtr_data(__LINE__, data, (cmock_size))
void HAL_I2C_Mem_Write_CMockReturnMemThruPtr_data(UNITY_LINE_TYPE cmock_line, uint8_t const* data, size_t cmock_size);
#define HAL_I2C_Mem_Write_IgnoreArg_hi2c() HAL_I2C_Mem_Write_CMockIgnoreArg_hi2c(__LINE__)
void HAL_I2C_Mem_Write_CMockIgnoreArg_hi2c(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Mem_Write_IgnoreArg_addr() HAL_I2C_Mem_Write_CMockIgnoreArg_addr(__LINE__)
void HAL_I2C_Mem_Write_CMockIgnoreArg_addr(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Mem_Write_IgnoreArg_mem_addr() HAL_I2C_Mem_Write_CMockIgnoreArg_mem_addr(__LINE__)
void HAL_I2C_Mem_Write_CMockIgnoreArg_mem_addr(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Mem_Write_IgnoreArg_mem_addr_size() HAL_I2C_Mem_Write_CMockIgnoreArg_mem_addr_size(__LINE__)
void HAL_I2C_Mem_Write_CMockIgnoreArg_mem_addr_size(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Mem_Write_IgnoreArg_data() HAL_I2C_Mem_Write_CMockIgnoreArg_data(__LINE__)
void HAL_I2C_Mem_Write_CMockIgnoreArg_data(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Mem_Write_IgnoreArg_len() HAL_I2C_Mem_Write_CMockIgnoreArg_len(__LINE__)
void HAL_I2C_Mem_Write_CMockIgnoreArg_len(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Mem_Write_IgnoreArg_timeout() HAL_I2C_Mem_Write_CMockIgnoreArg_timeout(__LINE__)
void HAL_I2C_Mem_Write_CMockIgnoreArg_timeout(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Mem_Read_Ignore() TEST_FAIL_MESSAGE("HAL_I2C_Mem_Read requires _IgnoreAndReturn");
#define HAL_I2C_Mem_Read_IgnoreAndReturn(cmock_retval) HAL_I2C_Mem_Read_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_I2C_Mem_Read_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_I2C_Mem_Read_StopIgnore() HAL_I2C_Mem_Read_CMockStopIgnore()
void HAL_I2C_Mem_Read_CMockStopIgnore(void);
#define HAL_I2C_Mem_Read_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_I2C_Mem_Read requires _ExpectAnyArgsAndReturn");
#define HAL_I2C_Mem_Read_ExpectAnyArgsAndReturn(cmock_retval) HAL_I2C_Mem_Read_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_I2C_Mem_Read_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_I2C_Mem_Read_Expect(hi2c, addr, mem_addr, mem_addr_size, data, len, timeout) TEST_FAIL_MESSAGE("HAL_I2C_Mem_Read requires _ExpectAndReturn");
#define HAL_I2C_Mem_Read_ExpectAndReturn(hi2c, addr, mem_addr, mem_addr_size, data, len, timeout, cmock_retval) HAL_I2C_Mem_Read_CMockExpectAndReturn(__LINE__, hi2c, addr, mem_addr, mem_addr_size, data, len, timeout, cmock_retval)
void HAL_I2C_Mem_Read_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, I2C_HandleTypeDef* hi2c, uint16_t addr, uint16_t mem_addr, uint16_t mem_addr_size, uint8_t* data, uint16_t len, uint32_t timeout, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_I2C_Mem_Read_CALLBACK)(I2C_HandleTypeDef* hi2c, uint16_t addr, uint16_t mem_addr, uint16_t mem_addr_size, uint8_t* data, uint16_t len, uint32_t timeout, int cmock_num_calls);
void HAL_I2C_Mem_Read_AddCallback(CMOCK_HAL_I2C_Mem_Read_CALLBACK Callback);
void HAL_I2C_Mem_Read_Stub(CMOCK_HAL_I2C_Mem_Read_CALLBACK Callback);
#define HAL_I2C_Mem_Read_StubWithCallback HAL_I2C_Mem_Read_Stub
int HAL_I2C_Mem_Read_CallCount(void);
#define HAL_I2C_Mem_Read_ReturnThruPtr_hi2c(hi2c) HAL_I2C_Mem_Read_CMockReturnMemThruPtr_hi2c(__LINE__, hi2c, sizeof(I2C_HandleTypeDef))
#define HAL_I2C_Mem_Read_ReturnArrayThruPtr_hi2c(hi2c, cmock_len) HAL_I2C_Mem_Read_CMockReturnMemThruPtr_hi2c(__LINE__, hi2c, (cmock_len * sizeof(*hi2c)))
#define HAL_I2C_Mem_Read_ReturnMemThruPtr_hi2c(hi2c, cmock_size) HAL_I2C_Mem_Read_CMockReturnMemThruPtr_hi2c(__LINE__, hi2c, (cmock_size))
void HAL_I2C_Mem_Read_CMockReturnMemThruPtr_hi2c(UNITY_LINE_TYPE cmock_line, I2C_HandleTypeDef const* hi2c, size_t cmock_size);
#define HAL_I2C_Mem_Read_ReturnThruPtr_data(data) HAL_I2C_Mem_Read_CMockReturnMemThruPtr_data(__LINE__, data, sizeof(uint8_t))
#define HAL_I2C_Mem_Read_ReturnArrayThruPtr_data(data, cmock_len) HAL_I2C_Mem_Read_CMockReturnMemThruPtr_data(__LINE__, data, (cmock_len * sizeof(*data)))
#define HAL_I2C_Mem_Read_ReturnMemThruPtr_data(data, cmock_size) HAL_I2C_Mem_Read_CMockReturnMemThruPtr_data(__LINE__, data, (cmock_size))
void HAL_I2C_Mem_Read_CMockReturnMemThruPtr_data(UNITY_LINE_TYPE cmock_line, uint8_t const* data, size_t cmock_size);
#define HAL_I2C_Mem_Read_IgnoreArg_hi2c() HAL_I2C_Mem_Read_CMockIgnoreArg_hi2c(__LINE__)
void HAL_I2C_Mem_Read_CMockIgnoreArg_hi2c(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Mem_Read_IgnoreArg_addr() HAL_I2C_Mem_Read_CMockIgnoreArg_addr(__LINE__)
void HAL_I2C_Mem_Read_CMockIgnoreArg_addr(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Mem_Read_IgnoreArg_mem_addr() HAL_I2C_Mem_Read_CMockIgnoreArg_mem_addr(__LINE__)
void HAL_I2C_Mem_Read_CMockIgnoreArg_mem_addr(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Mem_Read_IgnoreArg_mem_addr_size() HAL_I2C_Mem_Read_CMockIgnoreArg_mem_addr_size(__LINE__)
void HAL_I2C_Mem_Read_CMockIgnoreArg_mem_addr_size(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Mem_Read_IgnoreArg_data() HAL_I2C_Mem_Read_CMockIgnoreArg_data(__LINE__)
void HAL_I2C_Mem_Read_CMockIgnoreArg_data(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Mem_Read_IgnoreArg_len() HAL_I2C_Mem_Read_CMockIgnoreArg_len(__LINE__)
void HAL_I2C_Mem_Read_CMockIgnoreArg_len(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Mem_Read_IgnoreArg_timeout() HAL_I2C_Mem_Read_CMockIgnoreArg_timeout(__LINE__)
void HAL_I2C_Mem_Read_CMockIgnoreArg_timeout(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Master_Transmit_Ignore() TEST_FAIL_MESSAGE("HAL_I2C_Master_Transmit requires _IgnoreAndReturn");
#define HAL_I2C_Master_Transmit_IgnoreAndReturn(cmock_retval) HAL_I2C_Master_Transmit_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_I2C_Master_Transmit_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_I2C_Master_Transmit_StopIgnore() HAL_I2C_Master_Transmit_CMockStopIgnore()
void HAL_I2C_Master_Transmit_CMockStopIgnore(void);
#define HAL_I2C_Master_Transmit_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_I2C_Master_Transmit requires _ExpectAnyArgsAndReturn");
#define HAL_I2C_Master_Transmit_ExpectAnyArgsAndReturn(cmock_retval) HAL_I2C_Master_Transmit_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_I2C_Master_Transmit_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_I2C_Master_Transmit_Expect(hi2c, addr, data, len, timeout) TEST_FAIL_MESSAGE("HAL_I2C_Master_Transmit requires _ExpectAndReturn");
#define HAL_I2C_Master_Transmit_ExpectAndReturn(hi2c, addr, data, len, timeout, cmock_retval) HAL_I2C_Master_Transmit_CMockExpectAndReturn(__LINE__, hi2c, addr, data, len, timeout, cmock_retval)
void HAL_I2C_Master_Transmit_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, I2C_HandleTypeDef* hi2c, uint16_t addr, uint8_t* data, uint16_t len, uint32_t timeout, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_I2C_Master_Transmit_CALLBACK)(I2C_HandleTypeDef* hi2c, uint16_t addr, uint8_t* data, uint16_t len, uint32_t timeout, int cmock_num_calls);
void HAL_I2C_Master_Transmit_AddCallback(CMOCK_HAL_I2C_Master_Transmit_CALLBACK Callback);
void HAL_I2C_Master_Transmit_Stub(CMOCK_HAL_I2C_Master_Transmit_CALLBACK Callback);
#define HAL_I2C_Master_Transmit_StubWithCallback HAL_I2C_Master_Transmit_Stub
int HAL_I2C_Master_Transmit_CallCount(void);
#define HAL_I2C_Master_Transmit_ReturnThruPtr_hi2c(hi2c) HAL_I2C_Master_Transmit_CMockReturnMemThruPtr_hi2c(__LINE__, hi2c, sizeof(I2C_HandleTypeDef))
#define HAL_I2C_Master_Transmit_ReturnArrayThruPtr_hi2c(hi2c, cmock_len) HAL_I2C_Master_Transmit_CMockReturnMemThruPtr_hi2c(__LINE__, hi2c, (cmock_len * sizeof(*hi2c)))
#define HAL_I2C_Master_Transmit_ReturnMemThruPtr_hi2c(hi2c, cmock_size) HAL_I2C_Master_Transmit_CMockReturnMemThruPtr_hi2c(__LINE__, hi2c, (cmock_size))
void HAL_I2C_Master_Transmit_CMockReturnMemThruPtr_hi2c(UNITY_LINE_TYPE cmock_line, I2C_HandleTypeDef const* hi2c, size_t cmock_size);
#define HAL_I2C_Master_Transmit_ReturnThruPtr_data(data) HAL_I2C_Master_Transmit_CMockReturnMemThruPtr_data(__LINE__, data, sizeof(uint8_t))
#define HAL_I2C_Master_Transmit_ReturnArrayThruPtr_data(data, cmock_len) HAL_I2C_Master_Transmit_CMockReturnMemThruPtr_data(__LINE__, data, (cmock_len * sizeof(*data)))
#define HAL_I2C_Master_Transmit_ReturnMemThruPtr_data(data, cmock_size) HAL_I2C_Master_Transmit_CMockReturnMemThruPtr_data(__LINE__, data, (cmock_size))
void HAL_I2C_Master_Transmit_CMockReturnMemThruPtr_data(UNITY_LINE_TYPE cmock_line, uint8_t const* data, size_t cmock_size);
#define HAL_I2C_Master_Transmit_IgnoreArg_hi2c() HAL_I2C_Master_Transmit_CMockIgnoreArg_hi2c(__LINE__)
void HAL_I2C_Master_Transmit_CMockIgnoreArg_hi2c(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Master_Transmit_IgnoreArg_addr() HAL_I2C_Master_Transmit_CMockIgnoreArg_addr(__LINE__)
void HAL_I2C_Master_Transmit_CMockIgnoreArg_addr(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Master_Transmit_IgnoreArg_data() HAL_I2C_Master_Transmit_CMockIgnoreArg_data(__LINE__)
void HAL_I2C_Master_Transmit_CMockIgnoreArg_data(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Master_Transmit_IgnoreArg_len() HAL_I2C_Master_Transmit_CMockIgnoreArg_len(__LINE__)
void HAL_I2C_Master_Transmit_CMockIgnoreArg_len(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Master_Transmit_IgnoreArg_timeout() HAL_I2C_Master_Transmit_CMockIgnoreArg_timeout(__LINE__)
void HAL_I2C_Master_Transmit_CMockIgnoreArg_timeout(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Master_Receive_Ignore() TEST_FAIL_MESSAGE("HAL_I2C_Master_Receive requires _IgnoreAndReturn");
#define HAL_I2C_Master_Receive_IgnoreAndReturn(cmock_retval) HAL_I2C_Master_Receive_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_I2C_Master_Receive_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_I2C_Master_Receive_StopIgnore() HAL_I2C_Master_Receive_CMockStopIgnore()
void HAL_I2C_Master_Receive_CMockStopIgnore(void);
#define HAL_I2C_Master_Receive_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_I2C_Master_Receive requires _ExpectAnyArgsAndReturn");
#define HAL_I2C_Master_Receive_ExpectAnyArgsAndReturn(cmock_retval) HAL_I2C_Master_Receive_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_I2C_Master_Receive_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_I2C_Master_Receive_Expect(hi2c, addr, data, len, timeout) TEST_FAIL_MESSAGE("HAL_I2C_Master_Receive requires _ExpectAndReturn");
#define HAL_I2C_Master_Receive_ExpectAndReturn(hi2c, addr, data, len, timeout, cmock_retval) HAL_I2C_Master_Receive_CMockExpectAndReturn(__LINE__, hi2c, addr, data, len, timeout, cmock_retval)
void HAL_I2C_Master_Receive_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, I2C_HandleTypeDef* hi2c, uint16_t addr, uint8_t* data, uint16_t len, uint32_t timeout, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_I2C_Master_Receive_CALLBACK)(I2C_HandleTypeDef* hi2c, uint16_t addr, uint8_t* data, uint16_t len, uint32_t timeout, int cmock_num_calls);
void HAL_I2C_Master_Receive_AddCallback(CMOCK_HAL_I2C_Master_Receive_CALLBACK Callback);
void HAL_I2C_Master_Receive_Stub(CMOCK_HAL_I2C_Master_Receive_CALLBACK Callback);
#define HAL_I2C_Master_Receive_StubWithCallback HAL_I2C_Master_Receive_Stub
int HAL_I2C_Master_Receive_CallCount(void);
#define HAL_I2C_Master_Receive_ReturnThruPtr_hi2c(hi2c) HAL_I2C_Master_Receive_CMockReturnMemThruPtr_hi2c(__LINE__, hi2c, sizeof(I2C_HandleTypeDef))
#define HAL_I2C_Master_Receive_ReturnArrayThruPtr_hi2c(hi2c, cmock_len) HAL_I2C_Master_Receive_CMockReturnMemThruPtr_hi2c(__LINE__, hi2c, (cmock_len * sizeof(*hi2c)))
#define HAL_I2C_Master_Receive_ReturnMemThruPtr_hi2c(hi2c, cmock_size) HAL_I2C_Master_Receive_CMockReturnMemThruPtr_hi2c(__LINE__, hi2c, (cmock_size))
void HAL_I2C_Master_Receive_CMockReturnMemThruPtr_hi2c(UNITY_LINE_TYPE cmock_line, I2C_HandleTypeDef const* hi2c, size_t cmock_size);
#define HAL_I2C_Master_Receive_ReturnThruPtr_data(data) HAL_I2C_Master_Receive_CMockReturnMemThruPtr_data(__LINE__, data, sizeof(uint8_t))
#define HAL_I2C_Master_Receive_ReturnArrayThruPtr_data(data, cmock_len) HAL_I2C_Master_Receive_CMockReturnMemThruPtr_data(__LINE__, data, (cmock_len * sizeof(*data)))
#define HAL_I2C_Master_Receive_ReturnMemThruPtr_data(data, cmock_size) HAL_I2C_Master_Receive_CMockReturnMemThruPtr_data(__LINE__, data, (cmock_size))
void HAL_I2C_Master_Receive_CMockReturnMemThruPtr_data(UNITY_LINE_TYPE cmock_line, uint8_t const* data, size_t cmock_size);
#define HAL_I2C_Master_Receive_IgnoreArg_hi2c() HAL_I2C_Master_Receive_CMockIgnoreArg_hi2c(__LINE__)
void HAL_I2C_Master_Receive_CMockIgnoreArg_hi2c(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Master_Receive_IgnoreArg_addr() HAL_I2C_Master_Receive_CMockIgnoreArg_addr(__LINE__)
void HAL_I2C_Master_Receive_CMockIgnoreArg_addr(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Master_Receive_IgnoreArg_data() HAL_I2C_Master_Receive_CMockIgnoreArg_data(__LINE__)
void HAL_I2C_Master_Receive_CMockIgnoreArg_data(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Master_Receive_IgnoreArg_len() HAL_I2C_Master_Receive_CMockIgnoreArg_len(__LINE__)
void HAL_I2C_Master_Receive_CMockIgnoreArg_len(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Master_Receive_IgnoreArg_timeout() HAL_I2C_Master_Receive_CMockIgnoreArg_timeout(__LINE__)
void HAL_I2C_Master_Receive_CMockIgnoreArg_timeout(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_IsDeviceReady_Ignore() TEST_FAIL_MESSAGE("HAL_I2C_IsDeviceReady requires _IgnoreAndReturn");
#define HAL_I2C_IsDeviceReady_IgnoreAndReturn(cmock_retval) HAL_I2C_IsDeviceReady_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_I2C_IsDeviceReady_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_I2C_IsDeviceReady_StopIgnore() HAL_I2C_IsDeviceReady_CMockStopIgnore()
void HAL_I2C_IsDeviceReady_CMockStopIgnore(void);
#define HAL_I2C_IsDeviceReady_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_I2C_IsDeviceReady requires _ExpectAnyArgsAndReturn");
#define HAL_I2C_IsDeviceReady_ExpectAnyArgsAndReturn(cmock_retval) HAL_I2C_IsDeviceReady_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_I2C_IsDeviceReady_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_I2C_IsDeviceReady_Expect(hi2c, addr, trials, timeout) TEST_FAIL_MESSAGE("HAL_I2C_IsDeviceReady requires _ExpectAndReturn");
#define HAL_I2C_IsDeviceReady_ExpectAndReturn(hi2c, addr, trials, timeout, cmock_retval) HAL_I2C_IsDeviceReady_CMockExpectAndReturn(__LINE__, hi2c, addr, trials, timeout, cmock_retval)
void HAL_I2C_IsDeviceReady_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, I2C_HandleTypeDef* hi2c, uint16_t addr, uint32_t trials, uint32_t timeout, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_I2C_IsDeviceReady_CALLBACK)(I2C_HandleTypeDef* hi2c, uint16_t addr, uint32_t trials, uint32_t timeout, int cmock_num_calls);
void HAL_I2C_IsDeviceReady_AddCallback(CMOCK_HAL_I2C_IsDeviceReady_CALLBACK Callback);
void HAL_I2C_IsDeviceReady_Stub(CMOCK_HAL_I2C_IsDeviceReady_CALLBACK Callback);
#define HAL_I2C_IsDeviceReady_StubWithCallback HAL_I2C_IsDeviceReady_Stub
int HAL_I2C_IsDeviceReady_CallCount(void);
#define HAL_I2C_IsDeviceReady_ReturnThruPtr_hi2c(hi2c) HAL_I2C_IsDeviceReady_CMockReturnMemThruPtr_hi2c(__LINE__, hi2c, sizeof(I2C_HandleTypeDef))
#define HAL_I2C_IsDeviceReady_ReturnArrayThruPtr_hi2c(hi2c, cmock_len) HAL_I2C_IsDeviceReady_CMockReturnMemThruPtr_hi2c(__LINE__, hi2c, (cmock_len * sizeof(*hi2c)))
#define HAL_I2C_IsDeviceReady_ReturnMemThruPtr_hi2c(hi2c, cmock_size) HAL_I2C_IsDeviceReady_CMockReturnMemThruPtr_hi2c(__LINE__, hi2c, (cmock_size))
