fakeSkyy/COD_UniCFramework/tests/impl/bsp/stm32h7/mocks/mock_stm32h7xx_hal.h
void HAL_I2C_IsDeviceReady_CMockReturnMemThruPtr_hi2c(UNITY_LINE_TYPE cmock_line, I2C_HandleTypeDef const* hi2c, size_t cmock_size);
#define HAL_I2C_IsDeviceReady_IgnoreArg_hi2c() HAL_I2C_IsDeviceReady_CMockIgnoreArg_hi2c(__LINE__)
void HAL_I2C_IsDeviceReady_CMockIgnoreArg_hi2c(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_IsDeviceReady_IgnoreArg_addr() HAL_I2C_IsDeviceReady_CMockIgnoreArg_addr(__LINE__)
void HAL_I2C_IsDeviceReady_CMockIgnoreArg_addr(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_IsDeviceReady_IgnoreArg_trials() HAL_I2C_IsDeviceReady_CMockIgnoreArg_trials(__LINE__)
void HAL_I2C_IsDeviceReady_CMockIgnoreArg_trials(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_IsDeviceReady_IgnoreArg_timeout() HAL_I2C_IsDeviceReady_CMockIgnoreArg_timeout(__LINE__)
void HAL_I2C_IsDeviceReady_CMockIgnoreArg_timeout(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Mem_Write_IT_Ignore() TEST_FAIL_MESSAGE("HAL_I2C_Mem_Write_IT requires _IgnoreAndReturn");
#define HAL_I2C_Mem_Write_IT_IgnoreAndReturn(cmock_retval) HAL_I2C_Mem_Write_IT_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_I2C_Mem_Write_IT_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_I2C_Mem_Write_IT_StopIgnore() HAL_I2C_Mem_Write_IT_CMockStopIgnore()
void HAL_I2C_Mem_Write_IT_CMockStopIgnore(void);
#define HAL_I2C_Mem_Write_IT_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_I2C_Mem_Write_IT requires _ExpectAnyArgsAndReturn");
#define HAL_I2C_Mem_Write_IT_ExpectAnyArgsAndReturn(cmock_retval) HAL_I2C_Mem_Write_IT_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_I2C_Mem_Write_IT_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_I2C_Mem_Write_IT_Expect(hi2c, addr, mem_addr, mem_addr_size, data, len) TEST_FAIL_MESSAGE("HAL_I2C_Mem_Write_IT requires _ExpectAndReturn");
#define HAL_I2C_Mem_Write_IT_ExpectAndReturn(hi2c, addr, mem_addr, mem_addr_size, data, len, cmock_retval) HAL_I2C_Mem_Write_IT_CMockExpectAndReturn(__LINE__, hi2c, addr, mem_addr, mem_addr_size, data, len, cmock_retval)
void HAL_I2C_Mem_Write_IT_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, I2C_HandleTypeDef* hi2c, uint16_t addr, uint16_t mem_addr, uint16_t mem_addr_size, uint8_t* data, uint16_t len, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_I2C_Mem_Write_IT_CALLBACK)(I2C_HandleTypeDef* hi2c, uint16_t addr, uint16_t mem_addr, uint16_t mem_addr_size, uint8_t* data, uint16_t len, int cmock_num_calls);
void HAL_I2C_Mem_Write_IT_AddCallback(CMOCK_HAL_I2C_Mem_Write_IT_CALLBACK Callback);
void HAL_I2C_Mem_Write_IT_Stub(CMOCK_HAL_I2C_Mem_Write_IT_CALLBACK Callback);
#define HAL_I2C_Mem_Write_IT_StubWithCallback HAL_I2C_Mem_Write_IT_Stub
int HAL_I2C_Mem_Write_IT_CallCount(void);
#define HAL_I2C_Mem_Write_IT_ReturnThruPtr_hi2c(hi2c) HAL_I2C_Mem_Write_IT_CMockReturnMemThruPtr_hi2c(__LINE__, hi2c, sizeof(I2C_HandleTypeDef))
#define HAL_I2C_Mem_Write_IT_ReturnArrayThruPtr_hi2c(hi2c, cmock_len) HAL_I2C_Mem_Write_IT_CMockReturnMemThruPtr_hi2c(__LINE__, hi2c, (cmock_len * sizeof(*hi2c)))
#define HAL_I2C_Mem_Write_IT_ReturnMemThruPtr_hi2c(hi2c, cmock_size) HAL_I2C_Mem_Write_IT_CMockReturnMemThruPtr_hi2c(__LINE__, hi2c, (cmock_size))
void HAL_I2C_Mem_Write_IT_CMockReturnMemThruPtr_hi2c(UNITY_LINE_TYPE cmock_line, I2C_HandleTypeDef const* hi2c, size_t cmock_size);
#define HAL_I2C_Mem_Write_IT_ReturnThruPtr_data(data) HAL_I2C_Mem_Write_IT_CMockReturnMemThruPtr_data(__LINE__, data, sizeof(uint8_t))
#define HAL_I2C_Mem_Write_IT_ReturnArrayThruPtr_data(data, cmock_len) HAL_I2C_Mem_Write_IT_CMockReturnMemThruPtr_data(__LINE__, data, (cmock_len * sizeof(*data)))
#define HAL_I2C_Mem_Write_IT_ReturnMemThruPtr_data(data, cmock_size) HAL_I2C_Mem_Write_IT_CMockReturnMemThruPtr_data(__LINE__, data, (cmock_size))
void HAL_I2C_Mem_Write_IT_CMockReturnMemThruPtr_data(UNITY_LINE_TYPE cmock_line, uint8_t const* data, size_t cmock_size);
#define HAL_I2C_Mem_Write_IT_IgnoreArg_hi2c() HAL_I2C_Mem_Write_IT_CMockIgnoreArg_hi2c(__LINE__)
void HAL_I2C_Mem_Write_IT_CMockIgnoreArg_hi2c(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Mem_Write_IT_IgnoreArg_addr() HAL_I2C_Mem_Write_IT_CMockIgnoreArg_addr(__LINE__)
void HAL_I2C_Mem_Write_IT_CMockIgnoreArg_addr(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Mem_Write_IT_IgnoreArg_mem_addr() HAL_I2C_Mem_Write_IT_CMockIgnoreArg_mem_addr(__LINE__)
void HAL_I2C_Mem_Write_IT_CMockIgnoreArg_mem_addr(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Mem_Write_IT_IgnoreArg_mem_addr_size() HAL_I2C_Mem_Write_IT_CMockIgnoreArg_mem_addr_size(__LINE__)
void HAL_I2C_Mem_Write_IT_CMockIgnoreArg_mem_addr_size(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Mem_Write_IT_IgnoreArg_data() HAL_I2C_Mem_Write_IT_CMockIgnoreArg_data(__LINE__)
void HAL_I2C_Mem_Write_IT_CMockIgnoreArg_data(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Mem_Write_IT_IgnoreArg_len() HAL_I2C_Mem_Write_IT_CMockIgnoreArg_len(__LINE__)
void HAL_I2C_Mem_Write_IT_CMockIgnoreArg_len(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Mem_Write_DMA_Ignore() TEST_FAIL_MESSAGE("HAL_I2C_Mem_Write_DMA requires _IgnoreAndReturn");
#define HAL_I2C_Mem_Write_DMA_IgnoreAndReturn(cmock_retval) HAL_I2C_Mem_Write_DMA_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_I2C_Mem_Write_DMA_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_I2C_Mem_Write_DMA_StopIgnore() HAL_I2C_Mem_Write_DMA_CMockStopIgnore()
void HAL_I2C_Mem_Write_DMA_CMockStopIgnore(void);
#define HAL_I2C_Mem_Write_DMA_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_I2C_Mem_Write_DMA requires _ExpectAnyArgsAndReturn");
#define HAL_I2C_Mem_Write_DMA_ExpectAnyArgsAndReturn(cmock_retval) HAL_I2C_Mem_Write_DMA_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_I2C_Mem_Write_DMA_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_I2C_Mem_Write_DMA_Expect(hi2c, addr, mem_addr, mem_addr_size, data, len) TEST_FAIL_MESSAGE("HAL_I2C_Mem_Write_DMA requires _ExpectAndReturn");
#define HAL_I2C_Mem_Write_DMA_ExpectAndReturn(hi2c, addr, mem_addr, mem_addr_size, data, len, cmock_retval) HAL_I2C_Mem_Write_DMA_CMockExpectAndReturn(__LINE__, hi2c, addr, mem_addr, mem_addr_size, data, len, cmock_retval)
void HAL_I2C_Mem_Write_DMA_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, I2C_HandleTypeDef* hi2c, uint16_t addr, uint16_t mem_addr, uint16_t mem_addr_size, uint8_t* data, uint16_t len, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_I2C_Mem_Write_DMA_CALLBACK)(I2C_HandleTypeDef* hi2c, uint16_t addr, uint16_t mem_addr, uint16_t mem_addr_size, uint8_t* data, uint16_t len, int cmock_num_calls);
void HAL_I2C_Mem_Write_DMA_AddCallback(CMOCK_HAL_I2C_Mem_Write_DMA_CALLBACK Callback);
void HAL_I2C_Mem_Write_DMA_Stub(CMOCK_HAL_I2C_Mem_Write_DMA_CALLBACK Callback);
#define HAL_I2C_Mem_Write_DMA_StubWithCallback HAL_I2C_Mem_Write_DMA_Stub
int HAL_I2C_Mem_Write_DMA_CallCount(void);
#define HAL_I2C_Mem_Write_DMA_ReturnThruPtr_hi2c(hi2c) HAL_I2C_Mem_Write_DMA_CMockReturnMemThruPtr_hi2c(__LINE__, hi2c, sizeof(I2C_HandleTypeDef))
#define HAL_I2C_Mem_Write_DMA_ReturnArrayThruPtr_hi2c(hi2c, cmock_len) HAL_I2C_Mem_Write_DMA_CMockReturnMemThruPtr_hi2c(__LINE__, hi2c, (cmock_len * sizeof(*hi2c)))
#define HAL_I2C_Mem_Write_DMA_ReturnMemThruPtr_hi2c(hi2c, cmock_size) HAL_I2C_Mem_Write_DMA_CMockReturnMemThruPtr_hi2c(__LINE__, hi2c, (cmock_size))
void HAL_I2C_Mem_Write_DMA_CMockReturnMemThruPtr_hi2c(UNITY_LINE_TYPE cmock_line, I2C_HandleTypeDef const* hi2c, size_t cmock_size);
#define HAL_I2C_Mem_Write_DMA_ReturnThruPtr_data(data) HAL_I2C_Mem_Write_DMA_CMockReturnMemThruPtr_data(__LINE__, data, sizeof(uint8_t))
#define HAL_I2C_Mem_Write_DMA_ReturnArrayThruPtr_data(data, cmock_len) HAL_I2C_Mem_Write_DMA_CMockReturnMemThruPtr_data(__LINE__, data, (cmock_len * sizeof(*data)))
#define HAL_I2C_Mem_Write_DMA_ReturnMemThruPtr_data(data, cmock_size) HAL_I2C_Mem_Write_DMA_CMockReturnMemThruPtr_data(__LINE__, data, (cmock_size))
void HAL_I2C_Mem_Write_DMA_CMockReturnMemThruPtr_data(UNITY_LINE_TYPE cmock_line, uint8_t const* data, size_t cmock_size);
#define HAL_I2C_Mem_Write_DMA_IgnoreArg_hi2c() HAL_I2C_Mem_Write_DMA_CMockIgnoreArg_hi2c(__LINE__)
void HAL_I2C_Mem_Write_DMA_CMockIgnoreArg_hi2c(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Mem_Write_DMA_IgnoreArg_addr() HAL_I2C_Mem_Write_DMA_CMockIgnoreArg_addr(__LINE__)
void HAL_I2C_Mem_Write_DMA_CMockIgnoreArg_addr(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Mem_Write_DMA_IgnoreArg_mem_addr() HAL_I2C_Mem_Write_DMA_CMockIgnoreArg_mem_addr(__LINE__)
void HAL_I2C_Mem_Write_DMA_CMockIgnoreArg_mem_addr(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Mem_Write_DMA_IgnoreArg_mem_addr_size() HAL_I2C_Mem_Write_DMA_CMockIgnoreArg_mem_addr_size(__LINE__)
void HAL_I2C_Mem_Write_DMA_CMockIgnoreArg_mem_addr_size(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Mem_Write_DMA_IgnoreArg_data() HAL_I2C_Mem_Write_DMA_CMockIgnoreArg_data(__LINE__)
void HAL_I2C_Mem_Write_DMA_CMockIgnoreArg_data(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Mem_Write_DMA_IgnoreArg_len() HAL_I2C_Mem_Write_DMA_CMockIgnoreArg_len(__LINE__)
void HAL_I2C_Mem_Write_DMA_CMockIgnoreArg_len(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Mem_Read_IT_Ignore() TEST_FAIL_MESSAGE("HAL_I2C_Mem_Read_IT requires _IgnoreAndReturn");
#define HAL_I2C_Mem_Read_IT_IgnoreAndReturn(cmock_retval) HAL_I2C_Mem_Read_IT_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_I2C_Mem_Read_IT_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_I2C_Mem_Read_IT_StopIgnore() HAL_I2C_Mem_Read_IT_CMockStopIgnore()
void HAL_I2C_Mem_Read_IT_CMockStopIgnore(void);
#define HAL_I2C_Mem_Read_IT_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_I2C_Mem_Read_IT requires _ExpectAnyArgsAndReturn");
#define HAL_I2C_Mem_Read_IT_ExpectAnyArgsAndReturn(cmock_retval) HAL_I2C_Mem_Read_IT_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_I2C_Mem_Read_IT_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_I2C_Mem_Read_IT_Expect(hi2c, addr, mem_addr, mem_addr_size, data, len) TEST_FAIL_MESSAGE("HAL_I2C_Mem_Read_IT requires _ExpectAndReturn");
#define HAL_I2C_Mem_Read_IT_ExpectAndReturn(hi2c, addr, mem_addr, mem_addr_size, data, len, cmock_retval) HAL_I2C_Mem_Read_IT_CMockExpectAndReturn(__LINE__, hi2c, addr, mem_addr, mem_addr_size, data, len, cmock_retval)
void HAL_I2C_Mem_Read_IT_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, I2C_HandleTypeDef* hi2c, uint16_t addr, uint16_t mem_addr, uint16_t mem_addr_size, uint8_t* data, uint16_t len, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_I2C_Mem_Read_IT_CALLBACK)(I2C_HandleTypeDef* hi2c, uint16_t addr, uint16_t mem_addr, uint16_t mem_addr_size, uint8_t* data, uint16_t len, int cmock_num_calls);
void HAL_I2C_Mem_Read_IT_AddCallback(CMOCK_HAL_I2C_Mem_Read_IT_CALLBACK Callback);
void HAL_I2C_Mem_Read_IT_Stub(CMOCK_HAL_I2C_Mem_Read_IT_CALLBACK Callback);
#define HAL_I2C_Mem_Read_IT_StubWithCallback HAL_I2C_Mem_Read_IT_Stub
int HAL_I2C_Mem_Read_IT_CallCount(void);
#define HAL_I2C_Mem_Read_IT_ReturnThruPtr_hi2c(hi2c) HAL_I2C_Mem_Read_IT_CMockReturnMemThruPtr_hi2c(__LINE__, hi2c, sizeof(I2C_HandleTypeDef))
#define HAL_I2C_Mem_Read_IT_ReturnArrayThruPtr_hi2c(hi2c, cmock_len) HAL_I2C_Mem_Read_IT_CMockReturnMemThruPtr_hi2c(__LINE__, hi2c, (cmock_len * sizeof(*hi2c)))
#define HAL_I2C_Mem_Read_IT_ReturnMemThruPtr_hi2c(hi2c, cmock_size) HAL_I2C_Mem_Read_IT_CMockReturnMemThruPtr_hi2c(__LINE__, hi2c, (cmock_size))
void HAL_I2C_Mem_Read_IT_CMockReturnMemThruPtr_hi2c(UNITY_LINE_TYPE cmock_line, I2C_HandleTypeDef const* hi2c, size_t cmock_size);
#define HAL_I2C_Mem_Read_IT_ReturnThruPtr_data(data) HAL_I2C_Mem_Read_IT_CMockReturnMemThruPtr_data(__LINE__, data, sizeof(uint8_t))
#define HAL_I2C_Mem_Read_IT_ReturnArrayThruPtr_data(data, cmock_len) HAL_I2C_Mem_Read_IT_CMockReturnMemThruPtr_data(__LINE__, data, (cmock_len * sizeof(*data)))
#define HAL_I2C_Mem_Read_IT_ReturnMemThruPtr_data(data, cmock_size) HAL_I2C_Mem_Read_IT_CMockReturnMemThruPtr_data(__LINE__, data, (cmock_size))
void HAL_I2C_Mem_Read_IT_CMockReturnMemThruPtr_data(UNITY_LINE_TYPE cmock_line, uint8_t const* data, size_t cmock_size);
#define HAL_I2C_Mem_Read_IT_IgnoreArg_hi2c() HAL_I2C_Mem_Read_IT_CMockIgnoreArg_hi2c(__LINE__)
void HAL_I2C_Mem_Read_IT_CMockIgnoreArg_hi2c(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Mem_Read_IT_IgnoreArg_addr() HAL_I2C_Mem_Read_IT_CMockIgnoreArg_addr(__LINE__)
void HAL_I2C_Mem_Read_IT_CMockIgnoreArg_addr(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Mem_Read_IT_IgnoreArg_mem_addr() HAL_I2C_Mem_Read_IT_CMockIgnoreArg_mem_addr(__LINE__)
void HAL_I2C_Mem_Read_IT_CMockIgnoreArg_mem_addr(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Mem_Read_IT_IgnoreArg_mem_addr_size() HAL_I2C_Mem_Read_IT_CMockIgnoreArg_mem_addr_size(__LINE__)
void HAL_I2C_Mem_Read_IT_CMockIgnoreArg_mem_addr_size(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Mem_Read_IT_IgnoreArg_data() HAL_I2C_Mem_Read_IT_CMockIgnoreArg_data(__LINE__)
void HAL_I2C_Mem_Read_IT_CMockIgnoreArg_data(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Mem_Read_IT_IgnoreArg_len() HAL_I2C_Mem_Read_IT_CMockIgnoreArg_len(__LINE__)
void HAL_I2C_Mem_Read_IT_CMockIgnoreArg_len(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Mem_Read_DMA_Ignore() TEST_FAIL_MESSAGE("HAL_I2C_Mem_Read_DMA requires _IgnoreAndReturn");
#define HAL_I2C_Mem_Read_DMA_IgnoreAndReturn(cmock_retval) HAL_I2C_Mem_Read_DMA_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_I2C_Mem_Read_DMA_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_I2C_Mem_Read_DMA_StopIgnore() HAL_I2C_Mem_Read_DMA_CMockStopIgnore()
void HAL_I2C_Mem_Read_DMA_CMockStopIgnore(void);
#define HAL_I2C_Mem_Read_DMA_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_I2C_Mem_Read_DMA requires _ExpectAnyArgsAndReturn");
#define HAL_I2C_Mem_Read_DMA_ExpectAnyArgsAndReturn(cmock_retval) HAL_I2C_Mem_Read_DMA_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_I2C_Mem_Read_DMA_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_I2C_Mem_Read_DMA_Expect(hi2c, addr, mem_addr, mem_addr_size, data, len) TEST_FAIL_MESSAGE("HAL_I2C_Mem_Read_DMA requires _ExpectAndReturn");
#define HAL_I2C_Mem_Read_DMA_ExpectAndReturn(hi2c, addr, mem_addr, mem_addr_size, data, len, cmock_retval) HAL_I2C_Mem_Read_DMA_CMockExpectAndReturn(__LINE__, hi2c, addr, mem_addr, mem_addr_size, data, len, cmock_retval)
void HAL_I2C_Mem_Read_DMA_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, I2C_HandleTypeDef* hi2c, uint16_t addr, uint16_t mem_addr, uint16_t mem_addr_size, uint8_t* data, uint16_t len, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_I2C_Mem_Read_DMA_CALLBACK)(I2C_HandleTypeDef* hi2c, uint16_t addr, uint16_t mem_addr, uint16_t mem_addr_size, uint8_t* data, uint16_t len, int cmock_num_calls);
void HAL_I2C_Mem_Read_DMA_AddCallback(CMOCK_HAL_I2C_Mem_Read_DMA_CALLBACK Callback);
void HAL_I2C_Mem_Read_DMA_Stub(CMOCK_HAL_I2C_Mem_Read_DMA_CALLBACK Callback);
#define HAL_I2C_Mem_Read_DMA_StubWithCallback HAL_I2C_Mem_Read_DMA_Stub
int HAL_I2C_Mem_Read_DMA_CallCount(void);
#define HAL_I2C_Mem_Read_DMA_ReturnThruPtr_hi2c(hi2c) HAL_I2C_Mem_Read_DMA_CMockReturnMemThruPtr_hi2c(__LINE__, hi2c, sizeof(I2C_HandleTypeDef))
#define HAL_I2C_Mem_Read_DMA_ReturnArrayThruPtr_hi2c(hi2c, cmock_len) HAL_I2C_Mem_Read_DMA_CMockReturnMemThruPtr_hi2c(__LINE__, hi2c, (cmock_len * sizeof(*hi2c)))
#define HAL_I2C_Mem_Read_DMA_ReturnMemThruPtr_hi2c(hi2c, cmock_size) HAL_I2C_Mem_Read_DMA_CMockReturnMemThruPtr_hi2c(__LINE__, hi2c, (cmock_size))
void HAL_I2C_Mem_Read_DMA_CMockReturnMemThruPtr_hi2c(UNITY_LINE_TYPE cmock_line, I2C_HandleTypeDef const* hi2c, size_t cmock_size);
#define HAL_I2C_Mem_Read_DMA_ReturnThruPtr_data(data) HAL_I2C_Mem_Read_DMA_CMockReturnMemThruPtr_data(__LINE__, data, sizeof(uint8_t))
#define HAL_I2C_Mem_Read_DMA_ReturnArrayThruPtr_data(data, cmock_len) HAL_I2C_Mem_Read_DMA_CMockReturnMemThruPtr_data(__LINE__, data, (cmock_len * sizeof(*data)))
#define HAL_I2C_Mem_Read_DMA_ReturnMemThruPtr_data(data, cmock_size) HAL_I2C_Mem_Read_DMA_CMockReturnMemThruPtr_data(__LINE__, data, (cmock_size))
void HAL_I2C_Mem_Read_DMA_CMockReturnMemThruPtr_data(UNITY_LINE_TYPE cmock_line, uint8_t const* data, size_t cmock_size);
#define HAL_I2C_Mem_Read_DMA_IgnoreArg_hi2c() HAL_I2C_Mem_Read_DMA_CMockIgnoreArg_hi2c(__LINE__)
void HAL_I2C_Mem_Read_DMA_CMockIgnoreArg_hi2c(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Mem_Read_DMA_IgnoreArg_addr() HAL_I2C_Mem_Read_DMA_CMockIgnoreArg_addr(__LINE__)
void HAL_I2C_Mem_Read_DMA_CMockIgnoreArg_addr(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Mem_Read_DMA_IgnoreArg_mem_addr() HAL_I2C_Mem_Read_DMA_CMockIgnoreArg_mem_addr(__LINE__)
void HAL_I2C_Mem_Read_DMA_CMockIgnoreArg_mem_addr(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Mem_Read_DMA_IgnoreArg_mem_addr_size() HAL_I2C_Mem_Read_DMA_CMockIgnoreArg_mem_addr_size(__LINE__)
void HAL_I2C_Mem_Read_DMA_CMockIgnoreArg_mem_addr_size(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Mem_Read_DMA_IgnoreArg_data() HAL_I2C_Mem_Read_DMA_CMockIgnoreArg_data(__LINE__)
void HAL_I2C_Mem_Read_DMA_CMockIgnoreArg_data(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Mem_Read_DMA_IgnoreArg_len() HAL_I2C_Mem_Read_DMA_CMockIgnoreArg_len(__LINE__)
void HAL_I2C_Mem_Read_DMA_CMockIgnoreArg_len(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Master_Transmit_IT_Ignore() TEST_FAIL_MESSAGE("HAL_I2C_Master_Transmit_IT requires _IgnoreAndReturn");
#define HAL_I2C_Master_Transmit_IT_IgnoreAndReturn(cmock_retval) HAL_I2C_Master_Transmit_IT_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_I2C_Master_Transmit_IT_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_I2C_Master_Transmit_IT_StopIgnore() HAL_I2C_Master_Transmit_IT_CMockStopIgnore()
void HAL_I2C_Master_Transmit_IT_CMockStopIgnore(void);
#define HAL_I2C_Master_Transmit_IT_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_I2C_Master_Transmit_IT requires _ExpectAnyArgsAndReturn");
#define HAL_I2C_Master_Transmit_IT_ExpectAnyArgsAndReturn(cmock_retval) HAL_I2C_Master_Transmit_IT_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_I2C_Master_Transmit_IT_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_I2C_Master_Transmit_IT_Expect(hi2c, addr, data, len) TEST_FAIL_MESSAGE("HAL_I2C_Master_Transmit_IT requires _ExpectAndReturn");
#define HAL_I2C_Master_Transmit_IT_ExpectAndReturn(hi2c, addr, data, len, cmock_retval) HAL_I2C_Master_Transmit_IT_CMockExpectAndReturn(__LINE__, hi2c, addr, data, len, cmock_retval)
void HAL_I2C_Master_Transmit_IT_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, I2C_HandleTypeDef* hi2c, uint16_t addr, uint8_t* data, uint16_t len, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_I2C_Master_Transmit_IT_CALLBACK)(I2C_HandleTypeDef* hi2c, uint16_t addr, uint8_t* data, uint16_t len, int cmock_num_calls);
void HAL_I2C_Master_Transmit_IT_AddCallback(CMOCK_HAL_I2C_Master_Transmit_IT_CALLBACK Callback);
void HAL_I2C_Master_Transmit_IT_Stub(CMOCK_HAL_I2C_Master_Transmit_IT_CALLBACK Callback);
#define HAL_I2C_Master_Transmit_IT_StubWithCallback HAL_I2C_Master_Transmit_IT_Stub
int HAL_I2C_Master_Transmit_IT_CallCount(void);
#define HAL_I2C_Master_Transmit_IT_ReturnThruPtr_hi2c(hi2c) HAL_I2C_Master_Transmit_IT_CMockReturnMemThruPtr_hi2c(__LINE__, hi2c, sizeof(I2C_HandleTypeDef))
#define HAL_I2C_Master_Transmit_IT_ReturnArrayThruPtr_hi2c(hi2c, cmock_len) HAL_I2C_Master_Transmit_IT_CMockReturnMemThruPtr_hi2c(__LINE__, hi2c, (cmock_len * sizeof(*hi2c)))
#define HAL_I2C_Master_Transmit_IT_ReturnMemThruPtr_hi2c(hi2c, cmock_size) HAL_I2C_Master_Transmit_IT_CMockReturnMemThruPtr_hi2c(__LINE__, hi2c, (cmock_size))
void HAL_I2C_Master_Transmit_IT_CMockReturnMemThruPtr_hi2c(UNITY_LINE_TYPE cmock_line, I2C_HandleTypeDef const* hi2c, size_t cmock_size);
#define HAL_I2C_Master_Transmit_IT_ReturnThruPtr_data(data) HAL_I2C_Master_Transmit_IT_CMockReturnMemThruPtr_data(__LINE__, data, sizeof(uint8_t))
#define HAL_I2C_Master_Transmit_IT_ReturnArrayThruPtr_data(data, cmock_len) HAL_I2C_Master_Transmit_IT_CMockReturnMemThruPtr_data(__LINE__, data, (cmock_len * sizeof(*data)))
#define HAL_I2C_Master_Transmit_IT_ReturnMemThruPtr_data(data, cmock_size) HAL_I2C_Master_Transmit_IT_CMockReturnMemThruPtr_data(__LINE__, data, (cmock_size))
void HAL_I2C_Master_Transmit_IT_CMockReturnMemThruPtr_data(UNITY_LINE_TYPE cmock_line, uint8_t const* data, size_t cmock_size);
#define HAL_I2C_Master_Transmit_IT_IgnoreArg_hi2c() HAL_I2C_Master_Transmit_IT_CMockIgnoreArg_hi2c(__LINE__)
void HAL_I2C_Master_Transmit_IT_CMockIgnoreArg_hi2c(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Master_Transmit_IT_IgnoreArg_addr() HAL_I2C_Master_Transmit_IT_CMockIgnoreArg_addr(__LINE__)
void HAL_I2C_Master_Transmit_IT_CMockIgnoreArg_addr(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Master_Transmit_IT_IgnoreArg_data() HAL_I2C_Master_Transmit_IT_CMockIgnoreArg_data(__LINE__)
void HAL_I2C_Master_Transmit_IT_CMockIgnoreArg_data(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Master_Transmit_IT_IgnoreArg_len() HAL_I2C_Master_Transmit_IT_CMockIgnoreArg_len(__LINE__)
void HAL_I2C_Master_Transmit_IT_CMockIgnoreArg_len(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Master_Transmit_DMA_Ignore() TEST_FAIL_MESSAGE("HAL_I2C_Master_Transmit_DMA requires _IgnoreAndReturn");
#define HAL_I2C_Master_Transmit_DMA_IgnoreAndReturn(cmock_retval) HAL_I2C_Master_Transmit_DMA_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_I2C_Master_Transmit_DMA_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_I2C_Master_Transmit_DMA_StopIgnore() HAL_I2C_Master_Transmit_DMA_CMockStopIgnore()
void HAL_I2C_Master_Transmit_DMA_CMockStopIgnore(void);
#define HAL_I2C_Master_Transmit_DMA_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_I2C_Master_Transmit_DMA requires _ExpectAnyArgsAndReturn");
#define HAL_I2C_Master_Transmit_DMA_ExpectAnyArgsAndReturn(cmock_retval) HAL_I2C_Master_Transmit_DMA_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_I2C_Master_Transmit_DMA_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_I2C_Master_Transmit_DMA_Expect(hi2c, addr, data, len) TEST_FAIL_MESSAGE("HAL_I2C_Master_Transmit_DMA requires _ExpectAndReturn");
#define HAL_I2C_Master_Transmit_DMA_ExpectAndReturn(hi2c, addr, data, len, cmock_retval) HAL_I2C_Master_Transmit_DMA_CMockExpectAndReturn(__LINE__, hi2c, addr, data, len, cmock_retval)
void HAL_I2C_Master_Transmit_DMA_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, I2C_HandleTypeDef* hi2c, uint16_t addr, uint8_t* data, uint16_t len, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_I2C_Master_Transmit_DMA_CALLBACK)(I2C_HandleTypeDef* hi2c, uint16_t addr, uint8_t* data, uint16_t len, int cmock_num_calls);
void HAL_I2C_Master_Transmit_DMA_AddCallback(CMOCK_HAL_I2C_Master_Transmit_DMA_CALLBACK Callback);
void HAL_I2C_Master_Transmit_DMA_Stub(CMOCK_HAL_I2C_Master_Transmit_DMA_CALLBACK Callback);
#define HAL_I2C_Master_Transmit_DMA_StubWithCallback HAL_I2C_Master_Transmit_DMA_Stub
int HAL_I2C_Master_Transmit_DMA_CallCount(void);
#define HAL_I2C_Master_Transmit_DMA_ReturnThruPtr_hi2c(hi2c) HAL_I2C_Master_Transmit_DMA_CMockReturnMemThruPtr_hi2c(__LINE__, hi2c, sizeof(I2C_HandleTypeDef))
#define HAL_I2C_Master_Transmit_DMA_ReturnArrayThruPtr_hi2c(hi2c, cmock_len) HAL_I2C_Master_Transmit_DMA_CMockReturnMemThruPtr_hi2c(__LINE__, hi2c, (cmock_len * sizeof(*hi2c)))
#define HAL_I2C_Master_Transmit_DMA_ReturnMemThruPtr_hi2c(hi2c, cmock_size) HAL_I2C_Master_Transmit_DMA_CMockReturnMemThruPtr_hi2c(__LINE__, hi2c, (cmock_size))
void HAL_I2C_Master_Transmit_DMA_CMockReturnMemThruPtr_hi2c(UNITY_LINE_TYPE cmock_line, I2C_HandleTypeDef const* hi2c, size_t cmock_size);
