fakeSkyy/COD_UniCFramework/tests/impl/bsp/stm32h7/mocks/mock_stm32h7xx_hal.h
#define HAL_I2C_Master_Transmit_DMA_ReturnThruPtr_data(data) HAL_I2C_Master_Transmit_DMA_CMockReturnMemThruPtr_data(__LINE__, data, sizeof(uint8_t))
#define HAL_I2C_Master_Transmit_DMA_ReturnArrayThruPtr_data(data, cmock_len) HAL_I2C_Master_Transmit_DMA_CMockReturnMemThruPtr_data(__LINE__, data, (cmock_len * sizeof(*data)))
#define HAL_I2C_Master_Transmit_DMA_ReturnMemThruPtr_data(data, cmock_size) HAL_I2C_Master_Transmit_DMA_CMockReturnMemThruPtr_data(__LINE__, data, (cmock_size))
void HAL_I2C_Master_Transmit_DMA_CMockReturnMemThruPtr_data(UNITY_LINE_TYPE cmock_line, uint8_t const* data, size_t cmock_size);
#define HAL_I2C_Master_Transmit_DMA_IgnoreArg_hi2c() HAL_I2C_Master_Transmit_DMA_CMockIgnoreArg_hi2c(__LINE__)
void HAL_I2C_Master_Transmit_DMA_CMockIgnoreArg_hi2c(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Master_Transmit_DMA_IgnoreArg_addr() HAL_I2C_Master_Transmit_DMA_CMockIgnoreArg_addr(__LINE__)
void HAL_I2C_Master_Transmit_DMA_CMockIgnoreArg_addr(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Master_Transmit_DMA_IgnoreArg_data() HAL_I2C_Master_Transmit_DMA_CMockIgnoreArg_data(__LINE__)
void HAL_I2C_Master_Transmit_DMA_CMockIgnoreArg_data(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Master_Transmit_DMA_IgnoreArg_len() HAL_I2C_Master_Transmit_DMA_CMockIgnoreArg_len(__LINE__)
void HAL_I2C_Master_Transmit_DMA_CMockIgnoreArg_len(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Master_Receive_IT_Ignore() TEST_FAIL_MESSAGE("HAL_I2C_Master_Receive_IT requires _IgnoreAndReturn");
#define HAL_I2C_Master_Receive_IT_IgnoreAndReturn(cmock_retval) HAL_I2C_Master_Receive_IT_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_I2C_Master_Receive_IT_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_I2C_Master_Receive_IT_StopIgnore() HAL_I2C_Master_Receive_IT_CMockStopIgnore()
void HAL_I2C_Master_Receive_IT_CMockStopIgnore(void);
#define HAL_I2C_Master_Receive_IT_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_I2C_Master_Receive_IT requires _ExpectAnyArgsAndReturn");
#define HAL_I2C_Master_Receive_IT_ExpectAnyArgsAndReturn(cmock_retval) HAL_I2C_Master_Receive_IT_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_I2C_Master_Receive_IT_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_I2C_Master_Receive_IT_Expect(hi2c, addr, data, len) TEST_FAIL_MESSAGE("HAL_I2C_Master_Receive_IT requires _ExpectAndReturn");
#define HAL_I2C_Master_Receive_IT_ExpectAndReturn(hi2c, addr, data, len, cmock_retval) HAL_I2C_Master_Receive_IT_CMockExpectAndReturn(__LINE__, hi2c, addr, data, len, cmock_retval)
void HAL_I2C_Master_Receive_IT_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, I2C_HandleTypeDef* hi2c, uint16_t addr, uint8_t* data, uint16_t len, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_I2C_Master_Receive_IT_CALLBACK)(I2C_HandleTypeDef* hi2c, uint16_t addr, uint8_t* data, uint16_t len, int cmock_num_calls);
void HAL_I2C_Master_Receive_IT_AddCallback(CMOCK_HAL_I2C_Master_Receive_IT_CALLBACK Callback);
void HAL_I2C_Master_Receive_IT_Stub(CMOCK_HAL_I2C_Master_Receive_IT_CALLBACK Callback);
#define HAL_I2C_Master_Receive_IT_StubWithCallback HAL_I2C_Master_Receive_IT_Stub
int HAL_I2C_Master_Receive_IT_CallCount(void);
#define HAL_I2C_Master_Receive_IT_ReturnThruPtr_hi2c(hi2c) HAL_I2C_Master_Receive_IT_CMockReturnMemThruPtr_hi2c(__LINE__, hi2c, sizeof(I2C_HandleTypeDef))
#define HAL_I2C_Master_Receive_IT_ReturnArrayThruPtr_hi2c(hi2c, cmock_len) HAL_I2C_Master_Receive_IT_CMockReturnMemThruPtr_hi2c(__LINE__, hi2c, (cmock_len * sizeof(*hi2c)))
#define HAL_I2C_Master_Receive_IT_ReturnMemThruPtr_hi2c(hi2c, cmock_size) HAL_I2C_Master_Receive_IT_CMockReturnMemThruPtr_hi2c(__LINE__, hi2c, (cmock_size))
void HAL_I2C_Master_Receive_IT_CMockReturnMemThruPtr_hi2c(UNITY_LINE_TYPE cmock_line, I2C_HandleTypeDef const* hi2c, size_t cmock_size);
#define HAL_I2C_Master_Receive_IT_ReturnThruPtr_data(data) HAL_I2C_Master_Receive_IT_CMockReturnMemThruPtr_data(__LINE__, data, sizeof(uint8_t))
#define HAL_I2C_Master_Receive_IT_ReturnArrayThruPtr_data(data, cmock_len) HAL_I2C_Master_Receive_IT_CMockReturnMemThruPtr_data(__LINE__, data, (cmock_len * sizeof(*data)))
#define HAL_I2C_Master_Receive_IT_ReturnMemThruPtr_data(data, cmock_size) HAL_I2C_Master_Receive_IT_CMockReturnMemThruPtr_data(__LINE__, data, (cmock_size))
void HAL_I2C_Master_Receive_IT_CMockReturnMemThruPtr_data(UNITY_LINE_TYPE cmock_line, uint8_t const* data, size_t cmock_size);
#define HAL_I2C_Master_Receive_IT_IgnoreArg_hi2c() HAL_I2C_Master_Receive_IT_CMockIgnoreArg_hi2c(__LINE__)
void HAL_I2C_Master_Receive_IT_CMockIgnoreArg_hi2c(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Master_Receive_IT_IgnoreArg_addr() HAL_I2C_Master_Receive_IT_CMockIgnoreArg_addr(__LINE__)
void HAL_I2C_Master_Receive_IT_CMockIgnoreArg_addr(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Master_Receive_IT_IgnoreArg_data() HAL_I2C_Master_Receive_IT_CMockIgnoreArg_data(__LINE__)
void HAL_I2C_Master_Receive_IT_CMockIgnoreArg_data(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Master_Receive_IT_IgnoreArg_len() HAL_I2C_Master_Receive_IT_CMockIgnoreArg_len(__LINE__)
void HAL_I2C_Master_Receive_IT_CMockIgnoreArg_len(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Master_Receive_DMA_Ignore() TEST_FAIL_MESSAGE("HAL_I2C_Master_Receive_DMA requires _IgnoreAndReturn");
#define HAL_I2C_Master_Receive_DMA_IgnoreAndReturn(cmock_retval) HAL_I2C_Master_Receive_DMA_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_I2C_Master_Receive_DMA_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_I2C_Master_Receive_DMA_StopIgnore() HAL_I2C_Master_Receive_DMA_CMockStopIgnore()
void HAL_I2C_Master_Receive_DMA_CMockStopIgnore(void);
#define HAL_I2C_Master_Receive_DMA_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_I2C_Master_Receive_DMA requires _ExpectAnyArgsAndReturn");
#define HAL_I2C_Master_Receive_DMA_ExpectAnyArgsAndReturn(cmock_retval) HAL_I2C_Master_Receive_DMA_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_I2C_Master_Receive_DMA_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_I2C_Master_Receive_DMA_Expect(hi2c, addr, data, len) TEST_FAIL_MESSAGE("HAL_I2C_Master_Receive_DMA requires _ExpectAndReturn");
#define HAL_I2C_Master_Receive_DMA_ExpectAndReturn(hi2c, addr, data, len, cmock_retval) HAL_I2C_Master_Receive_DMA_CMockExpectAndReturn(__LINE__, hi2c, addr, data, len, cmock_retval)
void HAL_I2C_Master_Receive_DMA_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, I2C_HandleTypeDef* hi2c, uint16_t addr, uint8_t* data, uint16_t len, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_I2C_Master_Receive_DMA_CALLBACK)(I2C_HandleTypeDef* hi2c, uint16_t addr, uint8_t* data, uint16_t len, int cmock_num_calls);
void HAL_I2C_Master_Receive_DMA_AddCallback(CMOCK_HAL_I2C_Master_Receive_DMA_CALLBACK Callback);
void HAL_I2C_Master_Receive_DMA_Stub(CMOCK_HAL_I2C_Master_Receive_DMA_CALLBACK Callback);
#define HAL_I2C_Master_Receive_DMA_StubWithCallback HAL_I2C_Master_Receive_DMA_Stub
int HAL_I2C_Master_Receive_DMA_CallCount(void);
#define HAL_I2C_Master_Receive_DMA_ReturnThruPtr_hi2c(hi2c) HAL_I2C_Master_Receive_DMA_CMockReturnMemThruPtr_hi2c(__LINE__, hi2c, sizeof(I2C_HandleTypeDef))
#define HAL_I2C_Master_Receive_DMA_ReturnArrayThruPtr_hi2c(hi2c, cmock_len) HAL_I2C_Master_Receive_DMA_CMockReturnMemThruPtr_hi2c(__LINE__, hi2c, (cmock_len * sizeof(*hi2c)))
#define HAL_I2C_Master_Receive_DMA_ReturnMemThruPtr_hi2c(hi2c, cmock_size) HAL_I2C_Master_Receive_DMA_CMockReturnMemThruPtr_hi2c(__LINE__, hi2c, (cmock_size))
void HAL_I2C_Master_Receive_DMA_CMockReturnMemThruPtr_hi2c(UNITY_LINE_TYPE cmock_line, I2C_HandleTypeDef const* hi2c, size_t cmock_size);
#define HAL_I2C_Master_Receive_DMA_ReturnThruPtr_data(data) HAL_I2C_Master_Receive_DMA_CMockReturnMemThruPtr_data(__LINE__, data, sizeof(uint8_t))
#define HAL_I2C_Master_Receive_DMA_ReturnArrayThruPtr_data(data, cmock_len) HAL_I2C_Master_Receive_DMA_CMockReturnMemThruPtr_data(__LINE__, data, (cmock_len * sizeof(*data)))
#define HAL_I2C_Master_Receive_DMA_ReturnMemThruPtr_data(data, cmock_size) HAL_I2C_Master_Receive_DMA_CMockReturnMemThruPtr_data(__LINE__, data, (cmock_size))
void HAL_I2C_Master_Receive_DMA_CMockReturnMemThruPtr_data(UNITY_LINE_TYPE cmock_line, uint8_t const* data, size_t cmock_size);
#define HAL_I2C_Master_Receive_DMA_IgnoreArg_hi2c() HAL_I2C_Master_Receive_DMA_CMockIgnoreArg_hi2c(__LINE__)
void HAL_I2C_Master_Receive_DMA_CMockIgnoreArg_hi2c(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Master_Receive_DMA_IgnoreArg_addr() HAL_I2C_Master_Receive_DMA_CMockIgnoreArg_addr(__LINE__)
void HAL_I2C_Master_Receive_DMA_CMockIgnoreArg_addr(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Master_Receive_DMA_IgnoreArg_data() HAL_I2C_Master_Receive_DMA_CMockIgnoreArg_data(__LINE__)
void HAL_I2C_Master_Receive_DMA_CMockIgnoreArg_data(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Master_Receive_DMA_IgnoreArg_len() HAL_I2C_Master_Receive_DMA_CMockIgnoreArg_len(__LINE__)
void HAL_I2C_Master_Receive_DMA_CMockIgnoreArg_len(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Master_Seq_Transmit_IT_Ignore() TEST_FAIL_MESSAGE("HAL_I2C_Master_Seq_Transmit_IT requires _IgnoreAndReturn");
#define HAL_I2C_Master_Seq_Transmit_IT_IgnoreAndReturn(cmock_retval) HAL_I2C_Master_Seq_Transmit_IT_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_I2C_Master_Seq_Transmit_IT_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_I2C_Master_Seq_Transmit_IT_StopIgnore() HAL_I2C_Master_Seq_Transmit_IT_CMockStopIgnore()
void HAL_I2C_Master_Seq_Transmit_IT_CMockStopIgnore(void);
#define HAL_I2C_Master_Seq_Transmit_IT_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_I2C_Master_Seq_Transmit_IT requires _ExpectAnyArgsAndReturn");
#define HAL_I2C_Master_Seq_Transmit_IT_ExpectAnyArgsAndReturn(cmock_retval) HAL_I2C_Master_Seq_Transmit_IT_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_I2C_Master_Seq_Transmit_IT_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_I2C_Master_Seq_Transmit_IT_Expect(hi2c, addr, data, len, option) TEST_FAIL_MESSAGE("HAL_I2C_Master_Seq_Transmit_IT requires _ExpectAndReturn");
#define HAL_I2C_Master_Seq_Transmit_IT_ExpectAndReturn(hi2c, addr, data, len, option, cmock_retval) HAL_I2C_Master_Seq_Transmit_IT_CMockExpectAndReturn(__LINE__, hi2c, addr, data, len, option, cmock_retval)
void HAL_I2C_Master_Seq_Transmit_IT_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, I2C_HandleTypeDef* hi2c, uint16_t addr, uint8_t* data, uint16_t len, uint32_t option, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_I2C_Master_Seq_Transmit_IT_CALLBACK)(I2C_HandleTypeDef* hi2c, uint16_t addr, uint8_t* data, uint16_t len, uint32_t option, int cmock_num_calls);
void HAL_I2C_Master_Seq_Transmit_IT_AddCallback(CMOCK_HAL_I2C_Master_Seq_Transmit_IT_CALLBACK Callback);
void HAL_I2C_Master_Seq_Transmit_IT_Stub(CMOCK_HAL_I2C_Master_Seq_Transmit_IT_CALLBACK Callback);
#define HAL_I2C_Master_Seq_Transmit_IT_StubWithCallback HAL_I2C_Master_Seq_Transmit_IT_Stub
int HAL_I2C_Master_Seq_Transmit_IT_CallCount(void);
#define HAL_I2C_Master_Seq_Transmit_IT_ReturnThruPtr_hi2c(hi2c) HAL_I2C_Master_Seq_Transmit_IT_CMockReturnMemThruPtr_hi2c(__LINE__, hi2c, sizeof(I2C_HandleTypeDef))
#define HAL_I2C_Master_Seq_Transmit_IT_ReturnArrayThruPtr_hi2c(hi2c, cmock_len) HAL_I2C_Master_Seq_Transmit_IT_CMockReturnMemThruPtr_hi2c(__LINE__, hi2c, (cmock_len * sizeof(*hi2c)))
#define HAL_I2C_Master_Seq_Transmit_IT_ReturnMemThruPtr_hi2c(hi2c, cmock_size) HAL_I2C_Master_Seq_Transmit_IT_CMockReturnMemThruPtr_hi2c(__LINE__, hi2c, (cmock_size))
void HAL_I2C_Master_Seq_Transmit_IT_CMockReturnMemThruPtr_hi2c(UNITY_LINE_TYPE cmock_line, I2C_HandleTypeDef const* hi2c, size_t cmock_size);
#define HAL_I2C_Master_Seq_Transmit_IT_ReturnThruPtr_data(data) HAL_I2C_Master_Seq_Transmit_IT_CMockReturnMemThruPtr_data(__LINE__, data, sizeof(uint8_t))
#define HAL_I2C_Master_Seq_Transmit_IT_ReturnArrayThruPtr_data(data, cmock_len) HAL_I2C_Master_Seq_Transmit_IT_CMockReturnMemThruPtr_data(__LINE__, data, (cmock_len * sizeof(*data)))
#define HAL_I2C_Master_Seq_Transmit_IT_ReturnMemThruPtr_data(data, cmock_size) HAL_I2C_Master_Seq_Transmit_IT_CMockReturnMemThruPtr_data(__LINE__, data, (cmock_size))
void HAL_I2C_Master_Seq_Transmit_IT_CMockReturnMemThruPtr_data(UNITY_LINE_TYPE cmock_line, uint8_t const* data, size_t cmock_size);
#define HAL_I2C_Master_Seq_Transmit_IT_IgnoreArg_hi2c() HAL_I2C_Master_Seq_Transmit_IT_CMockIgnoreArg_hi2c(__LINE__)
void HAL_I2C_Master_Seq_Transmit_IT_CMockIgnoreArg_hi2c(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Master_Seq_Transmit_IT_IgnoreArg_addr() HAL_I2C_Master_Seq_Transmit_IT_CMockIgnoreArg_addr(__LINE__)
void HAL_I2C_Master_Seq_Transmit_IT_CMockIgnoreArg_addr(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Master_Seq_Transmit_IT_IgnoreArg_data() HAL_I2C_Master_Seq_Transmit_IT_CMockIgnoreArg_data(__LINE__)
void HAL_I2C_Master_Seq_Transmit_IT_CMockIgnoreArg_data(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Master_Seq_Transmit_IT_IgnoreArg_len() HAL_I2C_Master_Seq_Transmit_IT_CMockIgnoreArg_len(__LINE__)
void HAL_I2C_Master_Seq_Transmit_IT_CMockIgnoreArg_len(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Master_Seq_Transmit_IT_IgnoreArg_option() HAL_I2C_Master_Seq_Transmit_IT_CMockIgnoreArg_option(__LINE__)
void HAL_I2C_Master_Seq_Transmit_IT_CMockIgnoreArg_option(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Master_Seq_Transmit_DMA_Ignore() TEST_FAIL_MESSAGE("HAL_I2C_Master_Seq_Transmit_DMA requires _IgnoreAndReturn");
#define HAL_I2C_Master_Seq_Transmit_DMA_IgnoreAndReturn(cmock_retval) HAL_I2C_Master_Seq_Transmit_DMA_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_I2C_Master_Seq_Transmit_DMA_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_I2C_Master_Seq_Transmit_DMA_StopIgnore() HAL_I2C_Master_Seq_Transmit_DMA_CMockStopIgnore()
void HAL_I2C_Master_Seq_Transmit_DMA_CMockStopIgnore(void);
#define HAL_I2C_Master_Seq_Transmit_DMA_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_I2C_Master_Seq_Transmit_DMA requires _ExpectAnyArgsAndReturn");
#define HAL_I2C_Master_Seq_Transmit_DMA_ExpectAnyArgsAndReturn(cmock_retval) HAL_I2C_Master_Seq_Transmit_DMA_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_I2C_Master_Seq_Transmit_DMA_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_I2C_Master_Seq_Transmit_DMA_Expect(hi2c, addr, data, len, option) TEST_FAIL_MESSAGE("HAL_I2C_Master_Seq_Transmit_DMA requires _ExpectAndReturn");
#define HAL_I2C_Master_Seq_Transmit_DMA_ExpectAndReturn(hi2c, addr, data, len, option, cmock_retval) HAL_I2C_Master_Seq_Transmit_DMA_CMockExpectAndReturn(__LINE__, hi2c, addr, data, len, option, cmock_retval)
void HAL_I2C_Master_Seq_Transmit_DMA_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, I2C_HandleTypeDef* hi2c, uint16_t addr, uint8_t* data, uint16_t len, uint32_t option, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_I2C_Master_Seq_Transmit_DMA_CALLBACK)(I2C_HandleTypeDef* hi2c, uint16_t addr, uint8_t* data, uint16_t len, uint32_t option, int cmock_num_calls);
void HAL_I2C_Master_Seq_Transmit_DMA_AddCallback(CMOCK_HAL_I2C_Master_Seq_Transmit_DMA_CALLBACK Callback);
void HAL_I2C_Master_Seq_Transmit_DMA_Stub(CMOCK_HAL_I2C_Master_Seq_Transmit_DMA_CALLBACK Callback);
#define HAL_I2C_Master_Seq_Transmit_DMA_StubWithCallback HAL_I2C_Master_Seq_Transmit_DMA_Stub
int HAL_I2C_Master_Seq_Transmit_DMA_CallCount(void);
#define HAL_I2C_Master_Seq_Transmit_DMA_ReturnThruPtr_hi2c(hi2c) HAL_I2C_Master_Seq_Transmit_DMA_CMockReturnMemThruPtr_hi2c(__LINE__, hi2c, sizeof(I2C_HandleTypeDef))
#define HAL_I2C_Master_Seq_Transmit_DMA_ReturnArrayThruPtr_hi2c(hi2c, cmock_len) HAL_I2C_Master_Seq_Transmit_DMA_CMockReturnMemThruPtr_hi2c(__LINE__, hi2c, (cmock_len * sizeof(*hi2c)))
#define HAL_I2C_Master_Seq_Transmit_DMA_ReturnMemThruPtr_hi2c(hi2c, cmock_size) HAL_I2C_Master_Seq_Transmit_DMA_CMockReturnMemThruPtr_hi2c(__LINE__, hi2c, (cmock_size))
void HAL_I2C_Master_Seq_Transmit_DMA_CMockReturnMemThruPtr_hi2c(UNITY_LINE_TYPE cmock_line, I2C_HandleTypeDef const* hi2c, size_t cmock_size);
#define HAL_I2C_Master_Seq_Transmit_DMA_ReturnThruPtr_data(data) HAL_I2C_Master_Seq_Transmit_DMA_CMockReturnMemThruPtr_data(__LINE__, data, sizeof(uint8_t))
#define HAL_I2C_Master_Seq_Transmit_DMA_ReturnArrayThruPtr_data(data, cmock_len) HAL_I2C_Master_Seq_Transmit_DMA_CMockReturnMemThruPtr_data(__LINE__, data, (cmock_len * sizeof(*data)))
#define HAL_I2C_Master_Seq_Transmit_DMA_ReturnMemThruPtr_data(data, cmock_size) HAL_I2C_Master_Seq_Transmit_DMA_CMockReturnMemThruPtr_data(__LINE__, data, (cmock_size))
void HAL_I2C_Master_Seq_Transmit_DMA_CMockReturnMemThruPtr_data(UNITY_LINE_TYPE cmock_line, uint8_t const* data, size_t cmock_size);
#define HAL_I2C_Master_Seq_Transmit_DMA_IgnoreArg_hi2c() HAL_I2C_Master_Seq_Transmit_DMA_CMockIgnoreArg_hi2c(__LINE__)
void HAL_I2C_Master_Seq_Transmit_DMA_CMockIgnoreArg_hi2c(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Master_Seq_Transmit_DMA_IgnoreArg_addr() HAL_I2C_Master_Seq_Transmit_DMA_CMockIgnoreArg_addr(__LINE__)
void HAL_I2C_Master_Seq_Transmit_DMA_CMockIgnoreArg_addr(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Master_Seq_Transmit_DMA_IgnoreArg_data() HAL_I2C_Master_Seq_Transmit_DMA_CMockIgnoreArg_data(__LINE__)
void HAL_I2C_Master_Seq_Transmit_DMA_CMockIgnoreArg_data(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Master_Seq_Transmit_DMA_IgnoreArg_len() HAL_I2C_Master_Seq_Transmit_DMA_CMockIgnoreArg_len(__LINE__)
void HAL_I2C_Master_Seq_Transmit_DMA_CMockIgnoreArg_len(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Master_Seq_Transmit_DMA_IgnoreArg_option() HAL_I2C_Master_Seq_Transmit_DMA_CMockIgnoreArg_option(__LINE__)
void HAL_I2C_Master_Seq_Transmit_DMA_CMockIgnoreArg_option(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Master_Seq_Receive_IT_Ignore() TEST_FAIL_MESSAGE("HAL_I2C_Master_Seq_Receive_IT requires _IgnoreAndReturn");
#define HAL_I2C_Master_Seq_Receive_IT_IgnoreAndReturn(cmock_retval) HAL_I2C_Master_Seq_Receive_IT_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_I2C_Master_Seq_Receive_IT_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_I2C_Master_Seq_Receive_IT_StopIgnore() HAL_I2C_Master_Seq_Receive_IT_CMockStopIgnore()
void HAL_I2C_Master_Seq_Receive_IT_CMockStopIgnore(void);
#define HAL_I2C_Master_Seq_Receive_IT_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_I2C_Master_Seq_Receive_IT requires _ExpectAnyArgsAndReturn");
#define HAL_I2C_Master_Seq_Receive_IT_ExpectAnyArgsAndReturn(cmock_retval) HAL_I2C_Master_Seq_Receive_IT_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_I2C_Master_Seq_Receive_IT_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_I2C_Master_Seq_Receive_IT_Expect(hi2c, addr, data, len, option) TEST_FAIL_MESSAGE("HAL_I2C_Master_Seq_Receive_IT requires _ExpectAndReturn");
#define HAL_I2C_Master_Seq_Receive_IT_ExpectAndReturn(hi2c, addr, data, len, option, cmock_retval) HAL_I2C_Master_Seq_Receive_IT_CMockExpectAndReturn(__LINE__, hi2c, addr, data, len, option, cmock_retval)
void HAL_I2C_Master_Seq_Receive_IT_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, I2C_HandleTypeDef* hi2c, uint16_t addr, uint8_t* data, uint16_t len, uint32_t option, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_I2C_Master_Seq_Receive_IT_CALLBACK)(I2C_HandleTypeDef* hi2c, uint16_t addr, uint8_t* data, uint16_t len, uint32_t option, int cmock_num_calls);
void HAL_I2C_Master_Seq_Receive_IT_AddCallback(CMOCK_HAL_I2C_Master_Seq_Receive_IT_CALLBACK Callback);
void HAL_I2C_Master_Seq_Receive_IT_Stub(CMOCK_HAL_I2C_Master_Seq_Receive_IT_CALLBACK Callback);
#define HAL_I2C_Master_Seq_Receive_IT_StubWithCallback HAL_I2C_Master_Seq_Receive_IT_Stub
int HAL_I2C_Master_Seq_Receive_IT_CallCount(void);
#define HAL_I2C_Master_Seq_Receive_IT_ReturnThruPtr_hi2c(hi2c) HAL_I2C_Master_Seq_Receive_IT_CMockReturnMemThruPtr_hi2c(__LINE__, hi2c, sizeof(I2C_HandleTypeDef))
#define HAL_I2C_Master_Seq_Receive_IT_ReturnArrayThruPtr_hi2c(hi2c, cmock_len) HAL_I2C_Master_Seq_Receive_IT_CMockReturnMemThruPtr_hi2c(__LINE__, hi2c, (cmock_len * sizeof(*hi2c)))
#define HAL_I2C_Master_Seq_Receive_IT_ReturnMemThruPtr_hi2c(hi2c, cmock_size) HAL_I2C_Master_Seq_Receive_IT_CMockReturnMemThruPtr_hi2c(__LINE__, hi2c, (cmock_size))
void HAL_I2C_Master_Seq_Receive_IT_CMockReturnMemThruPtr_hi2c(UNITY_LINE_TYPE cmock_line, I2C_HandleTypeDef const* hi2c, size_t cmock_size);
#define HAL_I2C_Master_Seq_Receive_IT_ReturnThruPtr_data(data) HAL_I2C_Master_Seq_Receive_IT_CMockReturnMemThruPtr_data(__LINE__, data, sizeof(uint8_t))
#define HAL_I2C_Master_Seq_Receive_IT_ReturnArrayThruPtr_data(data, cmock_len) HAL_I2C_Master_Seq_Receive_IT_CMockReturnMemThruPtr_data(__LINE__, data, (cmock_len * sizeof(*data)))
#define HAL_I2C_Master_Seq_Receive_IT_ReturnMemThruPtr_data(data, cmock_size) HAL_I2C_Master_Seq_Receive_IT_CMockReturnMemThruPtr_data(__LINE__, data, (cmock_size))
void HAL_I2C_Master_Seq_Receive_IT_CMockReturnMemThruPtr_data(UNITY_LINE_TYPE cmock_line, uint8_t const* data, size_t cmock_size);
#define HAL_I2C_Master_Seq_Receive_IT_IgnoreArg_hi2c() HAL_I2C_Master_Seq_Receive_IT_CMockIgnoreArg_hi2c(__LINE__)
void HAL_I2C_Master_Seq_Receive_IT_CMockIgnoreArg_hi2c(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Master_Seq_Receive_IT_IgnoreArg_addr() HAL_I2C_Master_Seq_Receive_IT_CMockIgnoreArg_addr(__LINE__)
void HAL_I2C_Master_Seq_Receive_IT_CMockIgnoreArg_addr(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Master_Seq_Receive_IT_IgnoreArg_data() HAL_I2C_Master_Seq_Receive_IT_CMockIgnoreArg_data(__LINE__)
void HAL_I2C_Master_Seq_Receive_IT_CMockIgnoreArg_data(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Master_Seq_Receive_IT_IgnoreArg_len() HAL_I2C_Master_Seq_Receive_IT_CMockIgnoreArg_len(__LINE__)
void HAL_I2C_Master_Seq_Receive_IT_CMockIgnoreArg_len(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Master_Seq_Receive_IT_IgnoreArg_option() HAL_I2C_Master_Seq_Receive_IT_CMockIgnoreArg_option(__LINE__)
void HAL_I2C_Master_Seq_Receive_IT_CMockIgnoreArg_option(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Master_Seq_Receive_DMA_Ignore() TEST_FAIL_MESSAGE("HAL_I2C_Master_Seq_Receive_DMA requires _IgnoreAndReturn");
#define HAL_I2C_Master_Seq_Receive_DMA_IgnoreAndReturn(cmock_retval) HAL_I2C_Master_Seq_Receive_DMA_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_I2C_Master_Seq_Receive_DMA_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_I2C_Master_Seq_Receive_DMA_StopIgnore() HAL_I2C_Master_Seq_Receive_DMA_CMockStopIgnore()
void HAL_I2C_Master_Seq_Receive_DMA_CMockStopIgnore(void);
#define HAL_I2C_Master_Seq_Receive_DMA_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_I2C_Master_Seq_Receive_DMA requires _ExpectAnyArgsAndReturn");
#define HAL_I2C_Master_Seq_Receive_DMA_ExpectAnyArgsAndReturn(cmock_retval) HAL_I2C_Master_Seq_Receive_DMA_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_I2C_Master_Seq_Receive_DMA_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_I2C_Master_Seq_Receive_DMA_Expect(hi2c, addr, data, len, option) TEST_FAIL_MESSAGE("HAL_I2C_Master_Seq_Receive_DMA requires _ExpectAndReturn");
#define HAL_I2C_Master_Seq_Receive_DMA_ExpectAndReturn(hi2c, addr, data, len, option, cmock_retval) HAL_I2C_Master_Seq_Receive_DMA_CMockExpectAndReturn(__LINE__, hi2c, addr, data, len, option, cmock_retval)
void HAL_I2C_Master_Seq_Receive_DMA_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, I2C_HandleTypeDef* hi2c, uint16_t addr, uint8_t* data, uint16_t len, uint32_t option, HAL_StatusTypeDef cmock_to_return);
