fakeSkyy/COD_UniCFramework/tests/impl/bsp/stm32h7/mocks/mock_stm32h7xx_hal.h
typedef HAL_StatusTypeDef (* CMOCK_HAL_I2C_Master_Seq_Receive_DMA_CALLBACK)(I2C_HandleTypeDef* hi2c, uint16_t addr, uint8_t* data, uint16_t len, uint32_t option, int cmock_num_calls);
void HAL_I2C_Master_Seq_Receive_DMA_AddCallback(CMOCK_HAL_I2C_Master_Seq_Receive_DMA_CALLBACK Callback);
void HAL_I2C_Master_Seq_Receive_DMA_Stub(CMOCK_HAL_I2C_Master_Seq_Receive_DMA_CALLBACK Callback);
#define HAL_I2C_Master_Seq_Receive_DMA_StubWithCallback HAL_I2C_Master_Seq_Receive_DMA_Stub
int HAL_I2C_Master_Seq_Receive_DMA_CallCount(void);
#define HAL_I2C_Master_Seq_Receive_DMA_ReturnThruPtr_hi2c(hi2c) HAL_I2C_Master_Seq_Receive_DMA_CMockReturnMemThruPtr_hi2c(__LINE__, hi2c, sizeof(I2C_HandleTypeDef))
#define HAL_I2C_Master_Seq_Receive_DMA_ReturnArrayThruPtr_hi2c(hi2c, cmock_len) HAL_I2C_Master_Seq_Receive_DMA_CMockReturnMemThruPtr_hi2c(__LINE__, hi2c, (cmock_len * sizeof(*hi2c)))
#define HAL_I2C_Master_Seq_Receive_DMA_ReturnMemThruPtr_hi2c(hi2c, cmock_size) HAL_I2C_Master_Seq_Receive_DMA_CMockReturnMemThruPtr_hi2c(__LINE__, hi2c, (cmock_size))
void HAL_I2C_Master_Seq_Receive_DMA_CMockReturnMemThruPtr_hi2c(UNITY_LINE_TYPE cmock_line, I2C_HandleTypeDef const* hi2c, size_t cmock_size);
#define HAL_I2C_Master_Seq_Receive_DMA_ReturnThruPtr_data(data) HAL_I2C_Master_Seq_Receive_DMA_CMockReturnMemThruPtr_data(__LINE__, data, sizeof(uint8_t))
#define HAL_I2C_Master_Seq_Receive_DMA_ReturnArrayThruPtr_data(data, cmock_len) HAL_I2C_Master_Seq_Receive_DMA_CMockReturnMemThruPtr_data(__LINE__, data, (cmock_len * sizeof(*data)))
#define HAL_I2C_Master_Seq_Receive_DMA_ReturnMemThruPtr_data(data, cmock_size) HAL_I2C_Master_Seq_Receive_DMA_CMockReturnMemThruPtr_data(__LINE__, data, (cmock_size))
void HAL_I2C_Master_Seq_Receive_DMA_CMockReturnMemThruPtr_data(UNITY_LINE_TYPE cmock_line, uint8_t const* data, size_t cmock_size);
#define HAL_I2C_Master_Seq_Receive_DMA_IgnoreArg_hi2c() HAL_I2C_Master_Seq_Receive_DMA_CMockIgnoreArg_hi2c(__LINE__)
void HAL_I2C_Master_Seq_Receive_DMA_CMockIgnoreArg_hi2c(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Master_Seq_Receive_DMA_IgnoreArg_addr() HAL_I2C_Master_Seq_Receive_DMA_CMockIgnoreArg_addr(__LINE__)
void HAL_I2C_Master_Seq_Receive_DMA_CMockIgnoreArg_addr(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Master_Seq_Receive_DMA_IgnoreArg_data() HAL_I2C_Master_Seq_Receive_DMA_CMockIgnoreArg_data(__LINE__)
void HAL_I2C_Master_Seq_Receive_DMA_CMockIgnoreArg_data(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Master_Seq_Receive_DMA_IgnoreArg_len() HAL_I2C_Master_Seq_Receive_DMA_CMockIgnoreArg_len(__LINE__)
void HAL_I2C_Master_Seq_Receive_DMA_CMockIgnoreArg_len(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_Master_Seq_Receive_DMA_IgnoreArg_option() HAL_I2C_Master_Seq_Receive_DMA_CMockIgnoreArg_option(__LINE__)
void HAL_I2C_Master_Seq_Receive_DMA_CMockIgnoreArg_option(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_RegisterCallback_Ignore() TEST_FAIL_MESSAGE("HAL_I2C_RegisterCallback requires _IgnoreAndReturn");
#define HAL_I2C_RegisterCallback_IgnoreAndReturn(cmock_retval) HAL_I2C_RegisterCallback_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_I2C_RegisterCallback_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_I2C_RegisterCallback_StopIgnore() HAL_I2C_RegisterCallback_CMockStopIgnore()
void HAL_I2C_RegisterCallback_CMockStopIgnore(void);
#define HAL_I2C_RegisterCallback_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_I2C_RegisterCallback requires _ExpectAnyArgsAndReturn");
#define HAL_I2C_RegisterCallback_ExpectAnyArgsAndReturn(cmock_retval) HAL_I2C_RegisterCallback_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_I2C_RegisterCallback_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_I2C_RegisterCallback_Expect(hi2c, id, callback) TEST_FAIL_MESSAGE("HAL_I2C_RegisterCallback requires _ExpectAndReturn");
#define HAL_I2C_RegisterCallback_ExpectAndReturn(hi2c, id, callback, cmock_retval) HAL_I2C_RegisterCallback_CMockExpectAndReturn(__LINE__, hi2c, id, callback, cmock_retval)
void HAL_I2C_RegisterCallback_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, I2C_HandleTypeDef* hi2c, uint32_t id, pI2C_CallbackTypeDef callback, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_I2C_RegisterCallback_CALLBACK)(I2C_HandleTypeDef* hi2c, uint32_t id, pI2C_CallbackTypeDef callback, int cmock_num_calls);
void HAL_I2C_RegisterCallback_AddCallback(CMOCK_HAL_I2C_RegisterCallback_CALLBACK Callback);
void HAL_I2C_RegisterCallback_Stub(CMOCK_HAL_I2C_RegisterCallback_CALLBACK Callback);
#define HAL_I2C_RegisterCallback_StubWithCallback HAL_I2C_RegisterCallback_Stub
int HAL_I2C_RegisterCallback_CallCount(void);
#define HAL_I2C_RegisterCallback_ReturnThruPtr_hi2c(hi2c) HAL_I2C_RegisterCallback_CMockReturnMemThruPtr_hi2c(__LINE__, hi2c, sizeof(I2C_HandleTypeDef))
#define HAL_I2C_RegisterCallback_ReturnArrayThruPtr_hi2c(hi2c, cmock_len) HAL_I2C_RegisterCallback_CMockReturnMemThruPtr_hi2c(__LINE__, hi2c, (cmock_len * sizeof(*hi2c)))
#define HAL_I2C_RegisterCallback_ReturnMemThruPtr_hi2c(hi2c, cmock_size) HAL_I2C_RegisterCallback_CMockReturnMemThruPtr_hi2c(__LINE__, hi2c, (cmock_size))
void HAL_I2C_RegisterCallback_CMockReturnMemThruPtr_hi2c(UNITY_LINE_TYPE cmock_line, I2C_HandleTypeDef const* hi2c, size_t cmock_size);
#define HAL_I2C_RegisterCallback_IgnoreArg_hi2c() HAL_I2C_RegisterCallback_CMockIgnoreArg_hi2c(__LINE__)
void HAL_I2C_RegisterCallback_CMockIgnoreArg_hi2c(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_RegisterCallback_IgnoreArg_id() HAL_I2C_RegisterCallback_CMockIgnoreArg_id(__LINE__)
void HAL_I2C_RegisterCallback_CMockIgnoreArg_id(UNITY_LINE_TYPE cmock_line);
#define HAL_I2C_RegisterCallback_IgnoreArg_callback() HAL_I2C_RegisterCallback_CMockIgnoreArg_callback(__LINE__)
void HAL_I2C_RegisterCallback_CMockIgnoreArg_callback(UNITY_LINE_TYPE cmock_line);
#define HAL_SPI_Transmit_Ignore() TEST_FAIL_MESSAGE("HAL_SPI_Transmit requires _IgnoreAndReturn");
#define HAL_SPI_Transmit_IgnoreAndReturn(cmock_retval) HAL_SPI_Transmit_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_SPI_Transmit_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_SPI_Transmit_StopIgnore() HAL_SPI_Transmit_CMockStopIgnore()
void HAL_SPI_Transmit_CMockStopIgnore(void);
#define HAL_SPI_Transmit_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_SPI_Transmit requires _ExpectAnyArgsAndReturn");
#define HAL_SPI_Transmit_ExpectAnyArgsAndReturn(cmock_retval) HAL_SPI_Transmit_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_SPI_Transmit_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_SPI_Transmit_Expect(hspi, data, len, timeout) TEST_FAIL_MESSAGE("HAL_SPI_Transmit requires _ExpectAndReturn");
#define HAL_SPI_Transmit_ExpectAndReturn(hspi, data, len, timeout, cmock_retval) HAL_SPI_Transmit_CMockExpectAndReturn(__LINE__, hspi, data, len, timeout, cmock_retval)
void HAL_SPI_Transmit_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, SPI_HandleTypeDef* hspi, const uint8_t* data, uint16_t len, uint32_t timeout, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_SPI_Transmit_CALLBACK)(SPI_HandleTypeDef* hspi, const uint8_t* data, uint16_t len, uint32_t timeout, int cmock_num_calls);
void HAL_SPI_Transmit_AddCallback(CMOCK_HAL_SPI_Transmit_CALLBACK Callback);
void HAL_SPI_Transmit_Stub(CMOCK_HAL_SPI_Transmit_CALLBACK Callback);
#define HAL_SPI_Transmit_StubWithCallback HAL_SPI_Transmit_Stub
int HAL_SPI_Transmit_CallCount(void);
#define HAL_SPI_Transmit_ReturnThruPtr_hspi(hspi) HAL_SPI_Transmit_CMockReturnMemThruPtr_hspi(__LINE__, hspi, sizeof(SPI_HandleTypeDef))
#define HAL_SPI_Transmit_ReturnArrayThruPtr_hspi(hspi, cmock_len) HAL_SPI_Transmit_CMockReturnMemThruPtr_hspi(__LINE__, hspi, (cmock_len * sizeof(*hspi)))
#define HAL_SPI_Transmit_ReturnMemThruPtr_hspi(hspi, cmock_size) HAL_SPI_Transmit_CMockReturnMemThruPtr_hspi(__LINE__, hspi, (cmock_size))
void HAL_SPI_Transmit_CMockReturnMemThruPtr_hspi(UNITY_LINE_TYPE cmock_line, SPI_HandleTypeDef const* hspi, size_t cmock_size);
#define HAL_SPI_Transmit_IgnoreArg_hspi() HAL_SPI_Transmit_CMockIgnoreArg_hspi(__LINE__)
void HAL_SPI_Transmit_CMockIgnoreArg_hspi(UNITY_LINE_TYPE cmock_line);
#define HAL_SPI_Transmit_IgnoreArg_data() HAL_SPI_Transmit_CMockIgnoreArg_data(__LINE__)
void HAL_SPI_Transmit_CMockIgnoreArg_data(UNITY_LINE_TYPE cmock_line);
#define HAL_SPI_Transmit_IgnoreArg_len() HAL_SPI_Transmit_CMockIgnoreArg_len(__LINE__)
void HAL_SPI_Transmit_CMockIgnoreArg_len(UNITY_LINE_TYPE cmock_line);
#define HAL_SPI_Transmit_IgnoreArg_timeout() HAL_SPI_Transmit_CMockIgnoreArg_timeout(__LINE__)
void HAL_SPI_Transmit_CMockIgnoreArg_timeout(UNITY_LINE_TYPE cmock_line);
#define HAL_SPI_Receive_Ignore() TEST_FAIL_MESSAGE("HAL_SPI_Receive requires _IgnoreAndReturn");
#define HAL_SPI_Receive_IgnoreAndReturn(cmock_retval) HAL_SPI_Receive_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_SPI_Receive_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_SPI_Receive_StopIgnore() HAL_SPI_Receive_CMockStopIgnore()
void HAL_SPI_Receive_CMockStopIgnore(void);
#define HAL_SPI_Receive_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_SPI_Receive requires _ExpectAnyArgsAndReturn");
#define HAL_SPI_Receive_ExpectAnyArgsAndReturn(cmock_retval) HAL_SPI_Receive_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_SPI_Receive_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_SPI_Receive_Expect(hspi, data, len, timeout) TEST_FAIL_MESSAGE("HAL_SPI_Receive requires _ExpectAndReturn");
#define HAL_SPI_Receive_ExpectAndReturn(hspi, data, len, timeout, cmock_retval) HAL_SPI_Receive_CMockExpectAndReturn(__LINE__, hspi, data, len, timeout, cmock_retval)
void HAL_SPI_Receive_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, SPI_HandleTypeDef* hspi, uint8_t* data, uint16_t len, uint32_t timeout, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_SPI_Receive_CALLBACK)(SPI_HandleTypeDef* hspi, uint8_t* data, uint16_t len, uint32_t timeout, int cmock_num_calls);
void HAL_SPI_Receive_AddCallback(CMOCK_HAL_SPI_Receive_CALLBACK Callback);
void HAL_SPI_Receive_Stub(CMOCK_HAL_SPI_Receive_CALLBACK Callback);
#define HAL_SPI_Receive_StubWithCallback HAL_SPI_Receive_Stub
int HAL_SPI_Receive_CallCount(void);
#define HAL_SPI_Receive_ReturnThruPtr_hspi(hspi) HAL_SPI_Receive_CMockReturnMemThruPtr_hspi(__LINE__, hspi, sizeof(SPI_HandleTypeDef))
#define HAL_SPI_Receive_ReturnArrayThruPtr_hspi(hspi, cmock_len) HAL_SPI_Receive_CMockReturnMemThruPtr_hspi(__LINE__, hspi, (cmock_len * sizeof(*hspi)))
#define HAL_SPI_Receive_ReturnMemThruPtr_hspi(hspi, cmock_size) HAL_SPI_Receive_CMockReturnMemThruPtr_hspi(__LINE__, hspi, (cmock_size))
void HAL_SPI_Receive_CMockReturnMemThruPtr_hspi(UNITY_LINE_TYPE cmock_line, SPI_HandleTypeDef const* hspi, size_t cmock_size);
#define HAL_SPI_Receive_ReturnThruPtr_data(data) HAL_SPI_Receive_CMockReturnMemThruPtr_data(__LINE__, data, sizeof(uint8_t))
#define HAL_SPI_Receive_ReturnArrayThruPtr_data(data, cmock_len) HAL_SPI_Receive_CMockReturnMemThruPtr_data(__LINE__, data, (cmock_len * sizeof(*data)))
#define HAL_SPI_Receive_ReturnMemThruPtr_data(data, cmock_size) HAL_SPI_Receive_CMockReturnMemThruPtr_data(__LINE__, data, (cmock_size))
void HAL_SPI_Receive_CMockReturnMemThruPtr_data(UNITY_LINE_TYPE cmock_line, uint8_t const* data, size_t cmock_size);
#define HAL_SPI_Receive_IgnoreArg_hspi() HAL_SPI_Receive_CMockIgnoreArg_hspi(__LINE__)
void HAL_SPI_Receive_CMockIgnoreArg_hspi(UNITY_LINE_TYPE cmock_line);
#define HAL_SPI_Receive_IgnoreArg_data() HAL_SPI_Receive_CMockIgnoreArg_data(__LINE__)
void HAL_SPI_Receive_CMockIgnoreArg_data(UNITY_LINE_TYPE cmock_line);
#define HAL_SPI_Receive_IgnoreArg_len() HAL_SPI_Receive_CMockIgnoreArg_len(__LINE__)
void HAL_SPI_Receive_CMockIgnoreArg_len(UNITY_LINE_TYPE cmock_line);
#define HAL_SPI_Receive_IgnoreArg_timeout() HAL_SPI_Receive_CMockIgnoreArg_timeout(__LINE__)
void HAL_SPI_Receive_CMockIgnoreArg_timeout(UNITY_LINE_TYPE cmock_line);
#define HAL_SPI_TransmitReceive_Ignore() TEST_FAIL_MESSAGE("HAL_SPI_TransmitReceive requires _IgnoreAndReturn");
#define HAL_SPI_TransmitReceive_IgnoreAndReturn(cmock_retval) HAL_SPI_TransmitReceive_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_SPI_TransmitReceive_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_SPI_TransmitReceive_StopIgnore() HAL_SPI_TransmitReceive_CMockStopIgnore()
void HAL_SPI_TransmitReceive_CMockStopIgnore(void);
#define HAL_SPI_TransmitReceive_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_SPI_TransmitReceive requires _ExpectAnyArgsAndReturn");
#define HAL_SPI_TransmitReceive_ExpectAnyArgsAndReturn(cmock_retval) HAL_SPI_TransmitReceive_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_SPI_TransmitReceive_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_SPI_TransmitReceive_Expect(hspi, tx, rx, len, timeout) TEST_FAIL_MESSAGE("HAL_SPI_TransmitReceive requires _ExpectAndReturn");
#define HAL_SPI_TransmitReceive_ExpectAndReturn(hspi, tx, rx, len, timeout, cmock_retval) HAL_SPI_TransmitReceive_CMockExpectAndReturn(__LINE__, hspi, tx, rx, len, timeout, cmock_retval)
void HAL_SPI_TransmitReceive_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, SPI_HandleTypeDef* hspi, const uint8_t* tx, uint8_t* rx, uint16_t len, uint32_t timeout, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_SPI_TransmitReceive_CALLBACK)(SPI_HandleTypeDef* hspi, const uint8_t* tx, uint8_t* rx, uint16_t len, uint32_t timeout, int cmock_num_calls);
void HAL_SPI_TransmitReceive_AddCallback(CMOCK_HAL_SPI_TransmitReceive_CALLBACK Callback);
void HAL_SPI_TransmitReceive_Stub(CMOCK_HAL_SPI_TransmitReceive_CALLBACK Callback);
#define HAL_SPI_TransmitReceive_StubWithCallback HAL_SPI_TransmitReceive_Stub
int HAL_SPI_TransmitReceive_CallCount(void);
#define HAL_SPI_TransmitReceive_ReturnThruPtr_hspi(hspi) HAL_SPI_TransmitReceive_CMockReturnMemThruPtr_hspi(__LINE__, hspi, sizeof(SPI_HandleTypeDef))
#define HAL_SPI_TransmitReceive_ReturnArrayThruPtr_hspi(hspi, cmock_len) HAL_SPI_TransmitReceive_CMockReturnMemThruPtr_hspi(__LINE__, hspi, (cmock_len * sizeof(*hspi)))
#define HAL_SPI_TransmitReceive_ReturnMemThruPtr_hspi(hspi, cmock_size) HAL_SPI_TransmitReceive_CMockReturnMemThruPtr_hspi(__LINE__, hspi, (cmock_size))
void HAL_SPI_TransmitReceive_CMockReturnMemThruPtr_hspi(UNITY_LINE_TYPE cmock_line, SPI_HandleTypeDef const* hspi, size_t cmock_size);
#define HAL_SPI_TransmitReceive_ReturnThruPtr_rx(rx) HAL_SPI_TransmitReceive_CMockReturnMemThruPtr_rx(__LINE__, rx, sizeof(uint8_t))
#define HAL_SPI_TransmitReceive_ReturnArrayThruPtr_rx(rx, cmock_len) HAL_SPI_TransmitReceive_CMockReturnMemThruPtr_rx(__LINE__, rx, (cmock_len * sizeof(*rx)))
#define HAL_SPI_TransmitReceive_ReturnMemThruPtr_rx(rx, cmock_size) HAL_SPI_TransmitReceive_CMockReturnMemThruPtr_rx(__LINE__, rx, (cmock_size))
void HAL_SPI_TransmitReceive_CMockReturnMemThruPtr_rx(UNITY_LINE_TYPE cmock_line, uint8_t const* rx, size_t cmock_size);
#define HAL_SPI_TransmitReceive_IgnoreArg_hspi() HAL_SPI_TransmitReceive_CMockIgnoreArg_hspi(__LINE__)
void HAL_SPI_TransmitReceive_CMockIgnoreArg_hspi(UNITY_LINE_TYPE cmock_line);
#define HAL_SPI_TransmitReceive_IgnoreArg_tx() HAL_SPI_TransmitReceive_CMockIgnoreArg_tx(__LINE__)
void HAL_SPI_TransmitReceive_CMockIgnoreArg_tx(UNITY_LINE_TYPE cmock_line);
#define HAL_SPI_TransmitReceive_IgnoreArg_rx() HAL_SPI_TransmitReceive_CMockIgnoreArg_rx(__LINE__)
void HAL_SPI_TransmitReceive_CMockIgnoreArg_rx(UNITY_LINE_TYPE cmock_line);
#define HAL_SPI_TransmitReceive_IgnoreArg_len() HAL_SPI_TransmitReceive_CMockIgnoreArg_len(__LINE__)
void HAL_SPI_TransmitReceive_CMockIgnoreArg_len(UNITY_LINE_TYPE cmock_line);
#define HAL_SPI_TransmitReceive_IgnoreArg_timeout() HAL_SPI_TransmitReceive_CMockIgnoreArg_timeout(__LINE__)
void HAL_SPI_TransmitReceive_CMockIgnoreArg_timeout(UNITY_LINE_TYPE cmock_line);
#define HAL_SPI_Transmit_IT_Ignore() TEST_FAIL_MESSAGE("HAL_SPI_Transmit_IT requires _IgnoreAndReturn");
#define HAL_SPI_Transmit_IT_IgnoreAndReturn(cmock_retval) HAL_SPI_Transmit_IT_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_SPI_Transmit_IT_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_SPI_Transmit_IT_StopIgnore() HAL_SPI_Transmit_IT_CMockStopIgnore()
void HAL_SPI_Transmit_IT_CMockStopIgnore(void);
#define HAL_SPI_Transmit_IT_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_SPI_Transmit_IT requires _ExpectAnyArgsAndReturn");
#define HAL_SPI_Transmit_IT_ExpectAnyArgsAndReturn(cmock_retval) HAL_SPI_Transmit_IT_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_SPI_Transmit_IT_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_SPI_Transmit_IT_Expect(hspi, data, len) TEST_FAIL_MESSAGE("HAL_SPI_Transmit_IT requires _ExpectAndReturn");
#define HAL_SPI_Transmit_IT_ExpectAndReturn(hspi, data, len, cmock_retval) HAL_SPI_Transmit_IT_CMockExpectAndReturn(__LINE__, hspi, data, len, cmock_retval)
void HAL_SPI_Transmit_IT_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, SPI_HandleTypeDef* hspi, const uint8_t* data, uint16_t len, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_SPI_Transmit_IT_CALLBACK)(SPI_HandleTypeDef* hspi, const uint8_t* data, uint16_t len, int cmock_num_calls);
void HAL_SPI_Transmit_IT_AddCallback(CMOCK_HAL_SPI_Transmit_IT_CALLBACK Callback);
void HAL_SPI_Transmit_IT_Stub(CMOCK_HAL_SPI_Transmit_IT_CALLBACK Callback);
#define HAL_SPI_Transmit_IT_StubWithCallback HAL_SPI_Transmit_IT_Stub
int HAL_SPI_Transmit_IT_CallCount(void);
#define HAL_SPI_Transmit_IT_ReturnThruPtr_hspi(hspi) HAL_SPI_Transmit_IT_CMockReturnMemThruPtr_hspi(__LINE__, hspi, sizeof(SPI_HandleTypeDef))
#define HAL_SPI_Transmit_IT_ReturnArrayThruPtr_hspi(hspi, cmock_len) HAL_SPI_Transmit_IT_CMockReturnMemThruPtr_hspi(__LINE__, hspi, (cmock_len * sizeof(*hspi)))
#define HAL_SPI_Transmit_IT_ReturnMemThruPtr_hspi(hspi, cmock_size) HAL_SPI_Transmit_IT_CMockReturnMemThruPtr_hspi(__LINE__, hspi, (cmock_size))
void HAL_SPI_Transmit_IT_CMockReturnMemThruPtr_hspi(UNITY_LINE_TYPE cmock_line, SPI_HandleTypeDef const* hspi, size_t cmock_size);
#define HAL_SPI_Transmit_IT_IgnoreArg_hspi() HAL_SPI_Transmit_IT_CMockIgnoreArg_hspi(__LINE__)
void HAL_SPI_Transmit_IT_CMockIgnoreArg_hspi(UNITY_LINE_TYPE cmock_line);
#define HAL_SPI_Transmit_IT_IgnoreArg_data() HAL_SPI_Transmit_IT_CMockIgnoreArg_data(__LINE__)
void HAL_SPI_Transmit_IT_CMockIgnoreArg_data(UNITY_LINE_TYPE cmock_line);
#define HAL_SPI_Transmit_IT_IgnoreArg_len() HAL_SPI_Transmit_IT_CMockIgnoreArg_len(__LINE__)
void HAL_SPI_Transmit_IT_CMockIgnoreArg_len(UNITY_LINE_TYPE cmock_line);
#define HAL_SPI_Receive_IT_Ignore() TEST_FAIL_MESSAGE("HAL_SPI_Receive_IT requires _IgnoreAndReturn");
#define HAL_SPI_Receive_IT_IgnoreAndReturn(cmock_retval) HAL_SPI_Receive_IT_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_SPI_Receive_IT_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_SPI_Receive_IT_StopIgnore() HAL_SPI_Receive_IT_CMockStopIgnore()
void HAL_SPI_Receive_IT_CMockStopIgnore(void);
#define HAL_SPI_Receive_IT_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_SPI_Receive_IT requires _ExpectAnyArgsAndReturn");
#define HAL_SPI_Receive_IT_ExpectAnyArgsAndReturn(cmock_retval) HAL_SPI_Receive_IT_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_SPI_Receive_IT_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_SPI_Receive_IT_Expect(hspi, data, len) TEST_FAIL_MESSAGE("HAL_SPI_Receive_IT requires _ExpectAndReturn");
#define HAL_SPI_Receive_IT_ExpectAndReturn(hspi, data, len, cmock_retval) HAL_SPI_Receive_IT_CMockExpectAndReturn(__LINE__, hspi, data, len, cmock_retval)
void HAL_SPI_Receive_IT_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, SPI_HandleTypeDef* hspi, uint8_t* data, uint16_t len, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_SPI_Receive_IT_CALLBACK)(SPI_HandleTypeDef* hspi, uint8_t* data, uint16_t len, int cmock_num_calls);
void HAL_SPI_Receive_IT_AddCallback(CMOCK_HAL_SPI_Receive_IT_CALLBACK Callback);
void HAL_SPI_Receive_IT_Stub(CMOCK_HAL_SPI_Receive_IT_CALLBACK Callback);
#define HAL_SPI_Receive_IT_StubWithCallback HAL_SPI_Receive_IT_Stub
int HAL_SPI_Receive_IT_CallCount(void);
#define HAL_SPI_Receive_IT_ReturnThruPtr_hspi(hspi) HAL_SPI_Receive_IT_CMockReturnMemThruPtr_hspi(__LINE__, hspi, sizeof(SPI_HandleTypeDef))
#define HAL_SPI_Receive_IT_ReturnArrayThruPtr_hspi(hspi, cmock_len) HAL_SPI_Receive_IT_CMockReturnMemThruPtr_hspi(__LINE__, hspi, (cmock_len * sizeof(*hspi)))
#define HAL_SPI_Receive_IT_ReturnMemThruPtr_hspi(hspi, cmock_size) HAL_SPI_Receive_IT_CMockReturnMemThruPtr_hspi(__LINE__, hspi, (cmock_size))
void HAL_SPI_Receive_IT_CMockReturnMemThruPtr_hspi(UNITY_LINE_TYPE cmock_line, SPI_HandleTypeDef const* hspi, size_t cmock_size);
#define HAL_SPI_Receive_IT_ReturnThruPtr_data(data) HAL_SPI_Receive_IT_CMockReturnMemThruPtr_data(__LINE__, data, sizeof(uint8_t))
#define HAL_SPI_Receive_IT_ReturnArrayThruPtr_data(data, cmock_len) HAL_SPI_Receive_IT_CMockReturnMemThruPtr_data(__LINE__, data, (cmock_len * sizeof(*data)))
#define HAL_SPI_Receive_IT_ReturnMemThruPtr_data(data, cmock_size) HAL_SPI_Receive_IT_CMockReturnMemThruPtr_data(__LINE__, data, (cmock_size))
void HAL_SPI_Receive_IT_CMockReturnMemThruPtr_data(UNITY_LINE_TYPE cmock_line, uint8_t const* data, size_t cmock_size);
#define HAL_SPI_Receive_IT_IgnoreArg_hspi() HAL_SPI_Receive_IT_CMockIgnoreArg_hspi(__LINE__)
void HAL_SPI_Receive_IT_CMockIgnoreArg_hspi(UNITY_LINE_TYPE cmock_line);
#define HAL_SPI_Receive_IT_IgnoreArg_data() HAL_SPI_Receive_IT_CMockIgnoreArg_data(__LINE__)
void HAL_SPI_Receive_IT_CMockIgnoreArg_data(UNITY_LINE_TYPE cmock_line);
#define HAL_SPI_Receive_IT_IgnoreArg_len() HAL_SPI_Receive_IT_CMockIgnoreArg_len(__LINE__)
void HAL_SPI_Receive_IT_CMockIgnoreArg_len(UNITY_LINE_TYPE cmock_line);
#define HAL_SPI_TransmitReceive_IT_Ignore() TEST_FAIL_MESSAGE("HAL_SPI_TransmitReceive_IT requires _IgnoreAndReturn");
#define HAL_SPI_TransmitReceive_IT_IgnoreAndReturn(cmock_retval) HAL_SPI_TransmitReceive_IT_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_SPI_TransmitReceive_IT_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_SPI_TransmitReceive_IT_StopIgnore() HAL_SPI_TransmitReceive_IT_CMockStopIgnore()
void HAL_SPI_TransmitReceive_IT_CMockStopIgnore(void);
#define HAL_SPI_TransmitReceive_IT_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_SPI_TransmitReceive_IT requires _ExpectAnyArgsAndReturn");
#define HAL_SPI_TransmitReceive_IT_ExpectAnyArgsAndReturn(cmock_retval) HAL_SPI_TransmitReceive_IT_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_SPI_TransmitReceive_IT_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_SPI_TransmitReceive_IT_Expect(hspi, tx, rx, len) TEST_FAIL_MESSAGE("HAL_SPI_TransmitReceive_IT requires _ExpectAndReturn");
#define HAL_SPI_TransmitReceive_IT_ExpectAndReturn(hspi, tx, rx, len, cmock_retval) HAL_SPI_TransmitReceive_IT_CMockExpectAndReturn(__LINE__, hspi, tx, rx, len, cmock_retval)
void HAL_SPI_TransmitReceive_IT_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, SPI_HandleTypeDef* hspi, const uint8_t* tx, uint8_t* rx, uint16_t len, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_SPI_TransmitReceive_IT_CALLBACK)(SPI_HandleTypeDef* hspi, const uint8_t* tx, uint8_t* rx, uint16_t len, int cmock_num_calls);
void HAL_SPI_TransmitReceive_IT_AddCallback(CMOCK_HAL_SPI_TransmitReceive_IT_CALLBACK Callback);
void HAL_SPI_TransmitReceive_IT_Stub(CMOCK_HAL_SPI_TransmitReceive_IT_CALLBACK Callback);
