fakeSkyy/COD_UniCFramework/tests/impl/bsp/stm32h7/mocks/mock_stm32h7xx_hal.h
#define HAL_SPI_TransmitReceive_IT_StubWithCallback HAL_SPI_TransmitReceive_IT_Stub
int HAL_SPI_TransmitReceive_IT_CallCount(void);
#define HAL_SPI_TransmitReceive_IT_ReturnThruPtr_hspi(hspi) HAL_SPI_TransmitReceive_IT_CMockReturnMemThruPtr_hspi(__LINE__, hspi, sizeof(SPI_HandleTypeDef))
#define HAL_SPI_TransmitReceive_IT_ReturnArrayThruPtr_hspi(hspi, cmock_len) HAL_SPI_TransmitReceive_IT_CMockReturnMemThruPtr_hspi(__LINE__, hspi, (cmock_len * sizeof(*hspi)))
#define HAL_SPI_TransmitReceive_IT_ReturnMemThruPtr_hspi(hspi, cmock_size) HAL_SPI_TransmitReceive_IT_CMockReturnMemThruPtr_hspi(__LINE__, hspi, (cmock_size))
void HAL_SPI_TransmitReceive_IT_CMockReturnMemThruPtr_hspi(UNITY_LINE_TYPE cmock_line, SPI_HandleTypeDef const* hspi, size_t cmock_size);
#define HAL_SPI_TransmitReceive_IT_ReturnThruPtr_rx(rx) HAL_SPI_TransmitReceive_IT_CMockReturnMemThruPtr_rx(__LINE__, rx, sizeof(uint8_t))
#define HAL_SPI_TransmitReceive_IT_ReturnArrayThruPtr_rx(rx, cmock_len) HAL_SPI_TransmitReceive_IT_CMockReturnMemThruPtr_rx(__LINE__, rx, (cmock_len * sizeof(*rx)))
#define HAL_SPI_TransmitReceive_IT_ReturnMemThruPtr_rx(rx, cmock_size) HAL_SPI_TransmitReceive_IT_CMockReturnMemThruPtr_rx(__LINE__, rx, (cmock_size))
void HAL_SPI_TransmitReceive_IT_CMockReturnMemThruPtr_rx(UNITY_LINE_TYPE cmock_line, uint8_t const* rx, size_t cmock_size);
#define HAL_SPI_TransmitReceive_IT_IgnoreArg_hspi() HAL_SPI_TransmitReceive_IT_CMockIgnoreArg_hspi(__LINE__)
void HAL_SPI_TransmitReceive_IT_CMockIgnoreArg_hspi(UNITY_LINE_TYPE cmock_line);
#define HAL_SPI_TransmitReceive_IT_IgnoreArg_tx() HAL_SPI_TransmitReceive_IT_CMockIgnoreArg_tx(__LINE__)
void HAL_SPI_TransmitReceive_IT_CMockIgnoreArg_tx(UNITY_LINE_TYPE cmock_line);
#define HAL_SPI_TransmitReceive_IT_IgnoreArg_rx() HAL_SPI_TransmitReceive_IT_CMockIgnoreArg_rx(__LINE__)
void HAL_SPI_TransmitReceive_IT_CMockIgnoreArg_rx(UNITY_LINE_TYPE cmock_line);
#define HAL_SPI_TransmitReceive_IT_IgnoreArg_len() HAL_SPI_TransmitReceive_IT_CMockIgnoreArg_len(__LINE__)
void HAL_SPI_TransmitReceive_IT_CMockIgnoreArg_len(UNITY_LINE_TYPE cmock_line);
#define HAL_SPI_Transmit_DMA_Ignore() TEST_FAIL_MESSAGE("HAL_SPI_Transmit_DMA requires _IgnoreAndReturn");
#define HAL_SPI_Transmit_DMA_IgnoreAndReturn(cmock_retval) HAL_SPI_Transmit_DMA_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_SPI_Transmit_DMA_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_SPI_Transmit_DMA_StopIgnore() HAL_SPI_Transmit_DMA_CMockStopIgnore()
void HAL_SPI_Transmit_DMA_CMockStopIgnore(void);
#define HAL_SPI_Transmit_DMA_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_SPI_Transmit_DMA requires _ExpectAnyArgsAndReturn");
#define HAL_SPI_Transmit_DMA_ExpectAnyArgsAndReturn(cmock_retval) HAL_SPI_Transmit_DMA_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_SPI_Transmit_DMA_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_SPI_Transmit_DMA_Expect(hspi, data, len) TEST_FAIL_MESSAGE("HAL_SPI_Transmit_DMA requires _ExpectAndReturn");
#define HAL_SPI_Transmit_DMA_ExpectAndReturn(hspi, data, len, cmock_retval) HAL_SPI_Transmit_DMA_CMockExpectAndReturn(__LINE__, hspi, data, len, cmock_retval)
void HAL_SPI_Transmit_DMA_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, SPI_HandleTypeDef* hspi, const uint8_t* data, uint16_t len, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_SPI_Transmit_DMA_CALLBACK)(SPI_HandleTypeDef* hspi, const uint8_t* data, uint16_t len, int cmock_num_calls);
void HAL_SPI_Transmit_DMA_AddCallback(CMOCK_HAL_SPI_Transmit_DMA_CALLBACK Callback);
void HAL_SPI_Transmit_DMA_Stub(CMOCK_HAL_SPI_Transmit_DMA_CALLBACK Callback);
#define HAL_SPI_Transmit_DMA_StubWithCallback HAL_SPI_Transmit_DMA_Stub
int HAL_SPI_Transmit_DMA_CallCount(void);
#define HAL_SPI_Transmit_DMA_ReturnThruPtr_hspi(hspi) HAL_SPI_Transmit_DMA_CMockReturnMemThruPtr_hspi(__LINE__, hspi, sizeof(SPI_HandleTypeDef))
#define HAL_SPI_Transmit_DMA_ReturnArrayThruPtr_hspi(hspi, cmock_len) HAL_SPI_Transmit_DMA_CMockReturnMemThruPtr_hspi(__LINE__, hspi, (cmock_len * sizeof(*hspi)))
#define HAL_SPI_Transmit_DMA_ReturnMemThruPtr_hspi(hspi, cmock_size) HAL_SPI_Transmit_DMA_CMockReturnMemThruPtr_hspi(__LINE__, hspi, (cmock_size))
void HAL_SPI_Transmit_DMA_CMockReturnMemThruPtr_hspi(UNITY_LINE_TYPE cmock_line, SPI_HandleTypeDef const* hspi, size_t cmock_size);
#define HAL_SPI_Transmit_DMA_IgnoreArg_hspi() HAL_SPI_Transmit_DMA_CMockIgnoreArg_hspi(__LINE__)
void HAL_SPI_Transmit_DMA_CMockIgnoreArg_hspi(UNITY_LINE_TYPE cmock_line);
#define HAL_SPI_Transmit_DMA_IgnoreArg_data() HAL_SPI_Transmit_DMA_CMockIgnoreArg_data(__LINE__)
void HAL_SPI_Transmit_DMA_CMockIgnoreArg_data(UNITY_LINE_TYPE cmock_line);
#define HAL_SPI_Transmit_DMA_IgnoreArg_len() HAL_SPI_Transmit_DMA_CMockIgnoreArg_len(__LINE__)
void HAL_SPI_Transmit_DMA_CMockIgnoreArg_len(UNITY_LINE_TYPE cmock_line);
#define HAL_SPI_Receive_DMA_Ignore() TEST_FAIL_MESSAGE("HAL_SPI_Receive_DMA requires _IgnoreAndReturn");
#define HAL_SPI_Receive_DMA_IgnoreAndReturn(cmock_retval) HAL_SPI_Receive_DMA_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_SPI_Receive_DMA_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_SPI_Receive_DMA_StopIgnore() HAL_SPI_Receive_DMA_CMockStopIgnore()
void HAL_SPI_Receive_DMA_CMockStopIgnore(void);
#define HAL_SPI_Receive_DMA_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_SPI_Receive_DMA requires _ExpectAnyArgsAndReturn");
#define HAL_SPI_Receive_DMA_ExpectAnyArgsAndReturn(cmock_retval) HAL_SPI_Receive_DMA_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_SPI_Receive_DMA_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_SPI_Receive_DMA_Expect(hspi, data, len) TEST_FAIL_MESSAGE("HAL_SPI_Receive_DMA requires _ExpectAndReturn");
#define HAL_SPI_Receive_DMA_ExpectAndReturn(hspi, data, len, cmock_retval) HAL_SPI_Receive_DMA_CMockExpectAndReturn(__LINE__, hspi, data, len, cmock_retval)
void HAL_SPI_Receive_DMA_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, SPI_HandleTypeDef* hspi, uint8_t* data, uint16_t len, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_SPI_Receive_DMA_CALLBACK)(SPI_HandleTypeDef* hspi, uint8_t* data, uint16_t len, int cmock_num_calls);
void HAL_SPI_Receive_DMA_AddCallback(CMOCK_HAL_SPI_Receive_DMA_CALLBACK Callback);
void HAL_SPI_Receive_DMA_Stub(CMOCK_HAL_SPI_Receive_DMA_CALLBACK Callback);
#define HAL_SPI_Receive_DMA_StubWithCallback HAL_SPI_Receive_DMA_Stub
int HAL_SPI_Receive_DMA_CallCount(void);
#define HAL_SPI_Receive_DMA_ReturnThruPtr_hspi(hspi) HAL_SPI_Receive_DMA_CMockReturnMemThruPtr_hspi(__LINE__, hspi, sizeof(SPI_HandleTypeDef))
#define HAL_SPI_Receive_DMA_ReturnArrayThruPtr_hspi(hspi, cmock_len) HAL_SPI_Receive_DMA_CMockReturnMemThruPtr_hspi(__LINE__, hspi, (cmock_len * sizeof(*hspi)))
#define HAL_SPI_Receive_DMA_ReturnMemThruPtr_hspi(hspi, cmock_size) HAL_SPI_Receive_DMA_CMockReturnMemThruPtr_hspi(__LINE__, hspi, (cmock_size))
void HAL_SPI_Receive_DMA_CMockReturnMemThruPtr_hspi(UNITY_LINE_TYPE cmock_line, SPI_HandleTypeDef const* hspi, size_t cmock_size);
#define HAL_SPI_Receive_DMA_ReturnThruPtr_data(data) HAL_SPI_Receive_DMA_CMockReturnMemThruPtr_data(__LINE__, data, sizeof(uint8_t))
#define HAL_SPI_Receive_DMA_ReturnArrayThruPtr_data(data, cmock_len) HAL_SPI_Receive_DMA_CMockReturnMemThruPtr_data(__LINE__, data, (cmock_len * sizeof(*data)))
#define HAL_SPI_Receive_DMA_ReturnMemThruPtr_data(data, cmock_size) HAL_SPI_Receive_DMA_CMockReturnMemThruPtr_data(__LINE__, data, (cmock_size))
void HAL_SPI_Receive_DMA_CMockReturnMemThruPtr_data(UNITY_LINE_TYPE cmock_line, uint8_t const* data, size_t cmock_size);
#define HAL_SPI_Receive_DMA_IgnoreArg_hspi() HAL_SPI_Receive_DMA_CMockIgnoreArg_hspi(__LINE__)
void HAL_SPI_Receive_DMA_CMockIgnoreArg_hspi(UNITY_LINE_TYPE cmock_line);
#define HAL_SPI_Receive_DMA_IgnoreArg_data() HAL_SPI_Receive_DMA_CMockIgnoreArg_data(__LINE__)
void HAL_SPI_Receive_DMA_CMockIgnoreArg_data(UNITY_LINE_TYPE cmock_line);
#define HAL_SPI_Receive_DMA_IgnoreArg_len() HAL_SPI_Receive_DMA_CMockIgnoreArg_len(__LINE__)
void HAL_SPI_Receive_DMA_CMockIgnoreArg_len(UNITY_LINE_TYPE cmock_line);
#define HAL_SPI_TransmitReceive_DMA_Ignore() TEST_FAIL_MESSAGE("HAL_SPI_TransmitReceive_DMA requires _IgnoreAndReturn");
#define HAL_SPI_TransmitReceive_DMA_IgnoreAndReturn(cmock_retval) HAL_SPI_TransmitReceive_DMA_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_SPI_TransmitReceive_DMA_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_SPI_TransmitReceive_DMA_StopIgnore() HAL_SPI_TransmitReceive_DMA_CMockStopIgnore()
void HAL_SPI_TransmitReceive_DMA_CMockStopIgnore(void);
#define HAL_SPI_TransmitReceive_DMA_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_SPI_TransmitReceive_DMA requires _ExpectAnyArgsAndReturn");
#define HAL_SPI_TransmitReceive_DMA_ExpectAnyArgsAndReturn(cmock_retval) HAL_SPI_TransmitReceive_DMA_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_SPI_TransmitReceive_DMA_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_SPI_TransmitReceive_DMA_Expect(hspi, tx, rx, len) TEST_FAIL_MESSAGE("HAL_SPI_TransmitReceive_DMA requires _ExpectAndReturn");
#define HAL_SPI_TransmitReceive_DMA_ExpectAndReturn(hspi, tx, rx, len, cmock_retval) HAL_SPI_TransmitReceive_DMA_CMockExpectAndReturn(__LINE__, hspi, tx, rx, len, cmock_retval)
void HAL_SPI_TransmitReceive_DMA_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, SPI_HandleTypeDef* hspi, const uint8_t* tx, uint8_t* rx, uint16_t len, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_SPI_TransmitReceive_DMA_CALLBACK)(SPI_HandleTypeDef* hspi, const uint8_t* tx, uint8_t* rx, uint16_t len, int cmock_num_calls);
void HAL_SPI_TransmitReceive_DMA_AddCallback(CMOCK_HAL_SPI_TransmitReceive_DMA_CALLBACK Callback);
void HAL_SPI_TransmitReceive_DMA_Stub(CMOCK_HAL_SPI_TransmitReceive_DMA_CALLBACK Callback);
#define HAL_SPI_TransmitReceive_DMA_StubWithCallback HAL_SPI_TransmitReceive_DMA_Stub
int HAL_SPI_TransmitReceive_DMA_CallCount(void);
#define HAL_SPI_TransmitReceive_DMA_ReturnThruPtr_hspi(hspi) HAL_SPI_TransmitReceive_DMA_CMockReturnMemThruPtr_hspi(__LINE__, hspi, sizeof(SPI_HandleTypeDef))
#define HAL_SPI_TransmitReceive_DMA_ReturnArrayThruPtr_hspi(hspi, cmock_len) HAL_SPI_TransmitReceive_DMA_CMockReturnMemThruPtr_hspi(__LINE__, hspi, (cmock_len * sizeof(*hspi)))
#define HAL_SPI_TransmitReceive_DMA_ReturnMemThruPtr_hspi(hspi, cmock_size) HAL_SPI_TransmitReceive_DMA_CMockReturnMemThruPtr_hspi(__LINE__, hspi, (cmock_size))
void HAL_SPI_TransmitReceive_DMA_CMockReturnMemThruPtr_hspi(UNITY_LINE_TYPE cmock_line, SPI_HandleTypeDef const* hspi, size_t cmock_size);
#define HAL_SPI_TransmitReceive_DMA_ReturnThruPtr_rx(rx) HAL_SPI_TransmitReceive_DMA_CMockReturnMemThruPtr_rx(__LINE__, rx, sizeof(uint8_t))
#define HAL_SPI_TransmitReceive_DMA_ReturnArrayThruPtr_rx(rx, cmock_len) HAL_SPI_TransmitReceive_DMA_CMockReturnMemThruPtr_rx(__LINE__, rx, (cmock_len * sizeof(*rx)))
#define HAL_SPI_TransmitReceive_DMA_ReturnMemThruPtr_rx(rx, cmock_size) HAL_SPI_TransmitReceive_DMA_CMockReturnMemThruPtr_rx(__LINE__, rx, (cmock_size))
void HAL_SPI_TransmitReceive_DMA_CMockReturnMemThruPtr_rx(UNITY_LINE_TYPE cmock_line, uint8_t const* rx, size_t cmock_size);
#define HAL_SPI_TransmitReceive_DMA_IgnoreArg_hspi() HAL_SPI_TransmitReceive_DMA_CMockIgnoreArg_hspi(__LINE__)
void HAL_SPI_TransmitReceive_DMA_CMockIgnoreArg_hspi(UNITY_LINE_TYPE cmock_line);
#define HAL_SPI_TransmitReceive_DMA_IgnoreArg_tx() HAL_SPI_TransmitReceive_DMA_CMockIgnoreArg_tx(__LINE__)
void HAL_SPI_TransmitReceive_DMA_CMockIgnoreArg_tx(UNITY_LINE_TYPE cmock_line);
#define HAL_SPI_TransmitReceive_DMA_IgnoreArg_rx() HAL_SPI_TransmitReceive_DMA_CMockIgnoreArg_rx(__LINE__)
void HAL_SPI_TransmitReceive_DMA_CMockIgnoreArg_rx(UNITY_LINE_TYPE cmock_line);
#define HAL_SPI_TransmitReceive_DMA_IgnoreArg_len() HAL_SPI_TransmitReceive_DMA_CMockIgnoreArg_len(__LINE__)
void HAL_SPI_TransmitReceive_DMA_CMockIgnoreArg_len(UNITY_LINE_TYPE cmock_line);
#define HAL_SPI_RegisterCallback_Ignore() TEST_FAIL_MESSAGE("HAL_SPI_RegisterCallback requires _IgnoreAndReturn");
#define HAL_SPI_RegisterCallback_IgnoreAndReturn(cmock_retval) HAL_SPI_RegisterCallback_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_SPI_RegisterCallback_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_SPI_RegisterCallback_StopIgnore() HAL_SPI_RegisterCallback_CMockStopIgnore()
void HAL_SPI_RegisterCallback_CMockStopIgnore(void);
#define HAL_SPI_RegisterCallback_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_SPI_RegisterCallback requires _ExpectAnyArgsAndReturn");
#define HAL_SPI_RegisterCallback_ExpectAnyArgsAndReturn(cmock_retval) HAL_SPI_RegisterCallback_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_SPI_RegisterCallback_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_SPI_RegisterCallback_Expect(hspi, id, callback) TEST_FAIL_MESSAGE("HAL_SPI_RegisterCallback requires _ExpectAndReturn");
#define HAL_SPI_RegisterCallback_ExpectAndReturn(hspi, id, callback, cmock_retval) HAL_SPI_RegisterCallback_CMockExpectAndReturn(__LINE__, hspi, id, callback, cmock_retval)
void HAL_SPI_RegisterCallback_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, SPI_HandleTypeDef* hspi, uint32_t id, pSPI_CallbackTypeDef callback, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_SPI_RegisterCallback_CALLBACK)(SPI_HandleTypeDef* hspi, uint32_t id, pSPI_CallbackTypeDef callback, int cmock_num_calls);
void HAL_SPI_RegisterCallback_AddCallback(CMOCK_HAL_SPI_RegisterCallback_CALLBACK Callback);
void HAL_SPI_RegisterCallback_Stub(CMOCK_HAL_SPI_RegisterCallback_CALLBACK Callback);
#define HAL_SPI_RegisterCallback_StubWithCallback HAL_SPI_RegisterCallback_Stub
int HAL_SPI_RegisterCallback_CallCount(void);
#define HAL_SPI_RegisterCallback_ReturnThruPtr_hspi(hspi) HAL_SPI_RegisterCallback_CMockReturnMemThruPtr_hspi(__LINE__, hspi, sizeof(SPI_HandleTypeDef))
#define HAL_SPI_RegisterCallback_ReturnArrayThruPtr_hspi(hspi, cmock_len) HAL_SPI_RegisterCallback_CMockReturnMemThruPtr_hspi(__LINE__, hspi, (cmock_len * sizeof(*hspi)))
#define HAL_SPI_RegisterCallback_ReturnMemThruPtr_hspi(hspi, cmock_size) HAL_SPI_RegisterCallback_CMockReturnMemThruPtr_hspi(__LINE__, hspi, (cmock_size))
void HAL_SPI_RegisterCallback_CMockReturnMemThruPtr_hspi(UNITY_LINE_TYPE cmock_line, SPI_HandleTypeDef const* hspi, size_t cmock_size);
#define HAL_SPI_RegisterCallback_IgnoreArg_hspi() HAL_SPI_RegisterCallback_CMockIgnoreArg_hspi(__LINE__)
void HAL_SPI_RegisterCallback_CMockIgnoreArg_hspi(UNITY_LINE_TYPE cmock_line);
#define HAL_SPI_RegisterCallback_IgnoreArg_id() HAL_SPI_RegisterCallback_CMockIgnoreArg_id(__LINE__)
void HAL_SPI_RegisterCallback_CMockIgnoreArg_id(UNITY_LINE_TYPE cmock_line);
#define HAL_SPI_RegisterCallback_IgnoreArg_callback() HAL_SPI_RegisterCallback_CMockIgnoreArg_callback(__LINE__)
void HAL_SPI_RegisterCallback_CMockIgnoreArg_callback(UNITY_LINE_TYPE cmock_line);
#define HAL_FDCAN_ConfigFilter_Ignore() TEST_FAIL_MESSAGE("HAL_FDCAN_ConfigFilter requires _IgnoreAndReturn");
#define HAL_FDCAN_ConfigFilter_IgnoreAndReturn(cmock_retval) HAL_FDCAN_ConfigFilter_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_FDCAN_ConfigFilter_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_FDCAN_ConfigFilter_StopIgnore() HAL_FDCAN_ConfigFilter_CMockStopIgnore()
void HAL_FDCAN_ConfigFilter_CMockStopIgnore(void);
#define HAL_FDCAN_ConfigFilter_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_FDCAN_ConfigFilter requires _ExpectAnyArgsAndReturn");
#define HAL_FDCAN_ConfigFilter_ExpectAnyArgsAndReturn(cmock_retval) HAL_FDCAN_ConfigFilter_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_FDCAN_ConfigFilter_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_FDCAN_ConfigFilter_Expect(hfdcan, filter) TEST_FAIL_MESSAGE("HAL_FDCAN_ConfigFilter requires _ExpectAndReturn");
#define HAL_FDCAN_ConfigFilter_ExpectAndReturn(hfdcan, filter, cmock_retval) HAL_FDCAN_ConfigFilter_CMockExpectAndReturn(__LINE__, hfdcan, filter, cmock_retval)
void HAL_FDCAN_ConfigFilter_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, FDCAN_HandleTypeDef* hfdcan, FDCAN_FilterTypeDef* filter, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_FDCAN_ConfigFilter_CALLBACK)(FDCAN_HandleTypeDef* hfdcan, FDCAN_FilterTypeDef* filter, int cmock_num_calls);
void HAL_FDCAN_ConfigFilter_AddCallback(CMOCK_HAL_FDCAN_ConfigFilter_CALLBACK Callback);
void HAL_FDCAN_ConfigFilter_Stub(CMOCK_HAL_FDCAN_ConfigFilter_CALLBACK Callback);
#define HAL_FDCAN_ConfigFilter_StubWithCallback HAL_FDCAN_ConfigFilter_Stub
int HAL_FDCAN_ConfigFilter_CallCount(void);
#define HAL_FDCAN_ConfigFilter_ReturnThruPtr_hfdcan(hfdcan) HAL_FDCAN_ConfigFilter_CMockReturnMemThruPtr_hfdcan(__LINE__, hfdcan, sizeof(FDCAN_HandleTypeDef))
#define HAL_FDCAN_ConfigFilter_ReturnArrayThruPtr_hfdcan(hfdcan, cmock_len) HAL_FDCAN_ConfigFilter_CMockReturnMemThruPtr_hfdcan(__LINE__, hfdcan, (cmock_len * sizeof(*hfdcan)))
#define HAL_FDCAN_ConfigFilter_ReturnMemThruPtr_hfdcan(hfdcan, cmock_size) HAL_FDCAN_ConfigFilter_CMockReturnMemThruPtr_hfdcan(__LINE__, hfdcan, (cmock_size))
void HAL_FDCAN_ConfigFilter_CMockReturnMemThruPtr_hfdcan(UNITY_LINE_TYPE cmock_line, FDCAN_HandleTypeDef const* hfdcan, size_t cmock_size);
#define HAL_FDCAN_ConfigFilter_ReturnThruPtr_filter(filter) HAL_FDCAN_ConfigFilter_CMockReturnMemThruPtr_filter(__LINE__, filter, sizeof(FDCAN_FilterTypeDef))
#define HAL_FDCAN_ConfigFilter_ReturnArrayThruPtr_filter(filter, cmock_len) HAL_FDCAN_ConfigFilter_CMockReturnMemThruPtr_filter(__LINE__, filter, (cmock_len * sizeof(*filter)))
#define HAL_FDCAN_ConfigFilter_ReturnMemThruPtr_filter(filter, cmock_size) HAL_FDCAN_ConfigFilter_CMockReturnMemThruPtr_filter(__LINE__, filter, (cmock_size))
void HAL_FDCAN_ConfigFilter_CMockReturnMemThruPtr_filter(UNITY_LINE_TYPE cmock_line, FDCAN_FilterTypeDef const* filter, size_t cmock_size);
#define HAL_FDCAN_ConfigFilter_IgnoreArg_hfdcan() HAL_FDCAN_ConfigFilter_CMockIgnoreArg_hfdcan(__LINE__)
void HAL_FDCAN_ConfigFilter_CMockIgnoreArg_hfdcan(UNITY_LINE_TYPE cmock_line);
#define HAL_FDCAN_ConfigFilter_IgnoreArg_filter() HAL_FDCAN_ConfigFilter_CMockIgnoreArg_filter(__LINE__)
void HAL_FDCAN_ConfigFilter_CMockIgnoreArg_filter(UNITY_LINE_TYPE cmock_line);
#define HAL_FDCAN_ConfigGlobalFilter_Ignore() TEST_FAIL_MESSAGE("HAL_FDCAN_ConfigGlobalFilter requires _IgnoreAndReturn");
#define HAL_FDCAN_ConfigGlobalFilter_IgnoreAndReturn(cmock_retval) HAL_FDCAN_ConfigGlobalFilter_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_FDCAN_ConfigGlobalFilter_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_FDCAN_ConfigGlobalFilter_StopIgnore() HAL_FDCAN_ConfigGlobalFilter_CMockStopIgnore()
void HAL_FDCAN_ConfigGlobalFilter_CMockStopIgnore(void);
#define HAL_FDCAN_ConfigGlobalFilter_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_FDCAN_ConfigGlobalFilter requires _ExpectAnyArgsAndReturn");
#define HAL_FDCAN_ConfigGlobalFilter_ExpectAnyArgsAndReturn(cmock_retval) HAL_FDCAN_ConfigGlobalFilter_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_FDCAN_ConfigGlobalFilter_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_FDCAN_ConfigGlobalFilter_Expect(hfdcan, nonmatch_std, nonmatch_ext, reject_std_remote, reject_ext_remote) TEST_FAIL_MESSAGE("HAL_FDCAN_ConfigGlobalFilter requires _ExpectAndReturn");
#define HAL_FDCAN_ConfigGlobalFilter_ExpectAndReturn(hfdcan, nonmatch_std, nonmatch_ext, reject_std_remote, reject_ext_remote, cmock_retval) HAL_FDCAN_ConfigGlobalFilter_CMockExpectAndReturn(__LINE__, hfdcan, nonmatch_std, nonmatch_ext, reject_std_remote, reject_ext_remote, cmock_retval)
void HAL_FDCAN_ConfigGlobalFilter_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, FDCAN_HandleTypeDef* hfdcan, uint32_t nonmatch_std, uint32_t nonmatch_ext, uint32_t reject_std_remote, uint32_t reject_ext_remote, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_FDCAN_ConfigGlobalFilter_CALLBACK)(FDCAN_HandleTypeDef* hfdcan, uint32_t nonmatch_std, uint32_t nonmatch_ext, uint32_t reject_std_remote, uint32_t reject_ext_remote, int cmock_num_calls);
void HAL_FDCAN_ConfigGlobalFilter_AddCallback(CMOCK_HAL_FDCAN_ConfigGlobalFilter_CALLBACK Callback);
void HAL_FDCAN_ConfigGlobalFilter_Stub(CMOCK_HAL_FDCAN_ConfigGlobalFilter_CALLBACK Callback);
#define HAL_FDCAN_ConfigGlobalFilter_StubWithCallback HAL_FDCAN_ConfigGlobalFilter_Stub
int HAL_FDCAN_ConfigGlobalFilter_CallCount(void);
#define HAL_FDCAN_ConfigGlobalFilter_ReturnThruPtr_hfdcan(hfdcan) HAL_FDCAN_ConfigGlobalFilter_CMockReturnMemThruPtr_hfdcan(__LINE__, hfdcan, sizeof(FDCAN_HandleTypeDef))
#define HAL_FDCAN_ConfigGlobalFilter_ReturnArrayThruPtr_hfdcan(hfdcan, cmock_len) HAL_FDCAN_ConfigGlobalFilter_CMockReturnMemThruPtr_hfdcan(__LINE__, hfdcan, (cmock_len * sizeof(*hfdcan)))
#define HAL_FDCAN_ConfigGlobalFilter_ReturnMemThruPtr_hfdcan(hfdcan, cmock_size) HAL_FDCAN_ConfigGlobalFilter_CMockReturnMemThruPtr_hfdcan(__LINE__, hfdcan, (cmock_size))
void HAL_FDCAN_ConfigGlobalFilter_CMockReturnMemThruPtr_hfdcan(UNITY_LINE_TYPE cmock_line, FDCAN_HandleTypeDef const* hfdcan, size_t cmock_size);
#define HAL_FDCAN_ConfigGlobalFilter_IgnoreArg_hfdcan() HAL_FDCAN_ConfigGlobalFilter_CMockIgnoreArg_hfdcan(__LINE__)
void HAL_FDCAN_ConfigGlobalFilter_CMockIgnoreArg_hfdcan(UNITY_LINE_TYPE cmock_line);
#define HAL_FDCAN_ConfigGlobalFilter_IgnoreArg_nonmatch_std() HAL_FDCAN_ConfigGlobalFilter_CMockIgnoreArg_nonmatch_std(__LINE__)
void HAL_FDCAN_ConfigGlobalFilter_CMockIgnoreArg_nonmatch_std(UNITY_LINE_TYPE cmock_line);
#define HAL_FDCAN_ConfigGlobalFilter_IgnoreArg_nonmatch_ext() HAL_FDCAN_ConfigGlobalFilter_CMockIgnoreArg_nonmatch_ext(__LINE__)
void HAL_FDCAN_ConfigGlobalFilter_CMockIgnoreArg_nonmatch_ext(UNITY_LINE_TYPE cmock_line);
#define HAL_FDCAN_ConfigGlobalFilter_IgnoreArg_reject_std_remote() HAL_FDCAN_ConfigGlobalFilter_CMockIgnoreArg_reject_std_remote(__LINE__)
void HAL_FDCAN_ConfigGlobalFilter_CMockIgnoreArg_reject_std_remote(UNITY_LINE_TYPE cmock_line);
#define HAL_FDCAN_ConfigGlobalFilter_IgnoreArg_reject_ext_remote() HAL_FDCAN_ConfigGlobalFilter_CMockIgnoreArg_reject_ext_remote(__LINE__)
void HAL_FDCAN_ConfigGlobalFilter_CMockIgnoreArg_reject_ext_remote(UNITY_LINE_TYPE cmock_line);
#define HAL_FDCAN_AddMessageToTxFifoQ_Ignore() TEST_FAIL_MESSAGE("HAL_FDCAN_AddMessageToTxFifoQ requires _IgnoreAndReturn");
#define HAL_FDCAN_AddMessageToTxFifoQ_IgnoreAndReturn(cmock_retval) HAL_FDCAN_AddMessageToTxFifoQ_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_FDCAN_AddMessageToTxFifoQ_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_FDCAN_AddMessageToTxFifoQ_StopIgnore() HAL_FDCAN_AddMessageToTxFifoQ_CMockStopIgnore()
void HAL_FDCAN_AddMessageToTxFifoQ_CMockStopIgnore(void);
#define HAL_FDCAN_AddMessageToTxFifoQ_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_FDCAN_AddMessageToTxFifoQ requires _ExpectAnyArgsAndReturn");
#define HAL_FDCAN_AddMessageToTxFifoQ_ExpectAnyArgsAndReturn(cmock_retval) HAL_FDCAN_AddMessageToTxFifoQ_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_FDCAN_AddMessageToTxFifoQ_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_FDCAN_AddMessageToTxFifoQ_Expect(hfdcan, header, data) TEST_FAIL_MESSAGE("HAL_FDCAN_AddMessageToTxFifoQ requires _ExpectAndReturn");
#define HAL_FDCAN_AddMessageToTxFifoQ_ExpectAndReturn(hfdcan, header, data, cmock_retval) HAL_FDCAN_AddMessageToTxFifoQ_CMockExpectAndReturn(__LINE__, hfdcan, header, data, cmock_retval)
