fakeSkyy/COD_UniCFramework/tests/impl/bsp/stm32h7/mocks/mock_stm32h7xx_hal.h
void HAL_FDCAN_AddMessageToTxFifoQ_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, FDCAN_HandleTypeDef* hfdcan, FDCAN_TxHeaderTypeDef* header, uint8_t* data, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_FDCAN_AddMessageToTxFifoQ_CALLBACK)(FDCAN_HandleTypeDef* hfdcan, FDCAN_TxHeaderTypeDef* header, uint8_t* data, int cmock_num_calls);
void HAL_FDCAN_AddMessageToTxFifoQ_AddCallback(CMOCK_HAL_FDCAN_AddMessageToTxFifoQ_CALLBACK Callback);
void HAL_FDCAN_AddMessageToTxFifoQ_Stub(CMOCK_HAL_FDCAN_AddMessageToTxFifoQ_CALLBACK Callback);
#define HAL_FDCAN_AddMessageToTxFifoQ_StubWithCallback HAL_FDCAN_AddMessageToTxFifoQ_Stub
int HAL_FDCAN_AddMessageToTxFifoQ_CallCount(void);
#define HAL_FDCAN_AddMessageToTxFifoQ_ReturnThruPtr_hfdcan(hfdcan) HAL_FDCAN_AddMessageToTxFifoQ_CMockReturnMemThruPtr_hfdcan(__LINE__, hfdcan, sizeof(FDCAN_HandleTypeDef))
#define HAL_FDCAN_AddMessageToTxFifoQ_ReturnArrayThruPtr_hfdcan(hfdcan, cmock_len) HAL_FDCAN_AddMessageToTxFifoQ_CMockReturnMemThruPtr_hfdcan(__LINE__, hfdcan, (cmock_len * sizeof(*hfdcan)))
#define HAL_FDCAN_AddMessageToTxFifoQ_ReturnMemThruPtr_hfdcan(hfdcan, cmock_size) HAL_FDCAN_AddMessageToTxFifoQ_CMockReturnMemThruPtr_hfdcan(__LINE__, hfdcan, (cmock_size))
void HAL_FDCAN_AddMessageToTxFifoQ_CMockReturnMemThruPtr_hfdcan(UNITY_LINE_TYPE cmock_line, FDCAN_HandleTypeDef const* hfdcan, size_t cmock_size);
#define HAL_FDCAN_AddMessageToTxFifoQ_ReturnThruPtr_header(header) HAL_FDCAN_AddMessageToTxFifoQ_CMockReturnMemThruPtr_header(__LINE__, header, sizeof(FDCAN_TxHeaderTypeDef))
#define HAL_FDCAN_AddMessageToTxFifoQ_ReturnArrayThruPtr_header(header, cmock_len) HAL_FDCAN_AddMessageToTxFifoQ_CMockReturnMemThruPtr_header(__LINE__, header, (cmock_len * sizeof(*header)))
#define HAL_FDCAN_AddMessageToTxFifoQ_ReturnMemThruPtr_header(header, cmock_size) HAL_FDCAN_AddMessageToTxFifoQ_CMockReturnMemThruPtr_header(__LINE__, header, (cmock_size))
void HAL_FDCAN_AddMessageToTxFifoQ_CMockReturnMemThruPtr_header(UNITY_LINE_TYPE cmock_line, FDCAN_TxHeaderTypeDef const* header, size_t cmock_size);
#define HAL_FDCAN_AddMessageToTxFifoQ_ReturnThruPtr_data(data) HAL_FDCAN_AddMessageToTxFifoQ_CMockReturnMemThruPtr_data(__LINE__, data, sizeof(uint8_t))
#define HAL_FDCAN_AddMessageToTxFifoQ_ReturnArrayThruPtr_data(data, cmock_len) HAL_FDCAN_AddMessageToTxFifoQ_CMockReturnMemThruPtr_data(__LINE__, data, (cmock_len * sizeof(*data)))
#define HAL_FDCAN_AddMessageToTxFifoQ_ReturnMemThruPtr_data(data, cmock_size) HAL_FDCAN_AddMessageToTxFifoQ_CMockReturnMemThruPtr_data(__LINE__, data, (cmock_size))
void HAL_FDCAN_AddMessageToTxFifoQ_CMockReturnMemThruPtr_data(UNITY_LINE_TYPE cmock_line, uint8_t const* data, size_t cmock_size);
#define HAL_FDCAN_AddMessageToTxFifoQ_IgnoreArg_hfdcan() HAL_FDCAN_AddMessageToTxFifoQ_CMockIgnoreArg_hfdcan(__LINE__)
void HAL_FDCAN_AddMessageToTxFifoQ_CMockIgnoreArg_hfdcan(UNITY_LINE_TYPE cmock_line);
#define HAL_FDCAN_AddMessageToTxFifoQ_IgnoreArg_header() HAL_FDCAN_AddMessageToTxFifoQ_CMockIgnoreArg_header(__LINE__)
void HAL_FDCAN_AddMessageToTxFifoQ_CMockIgnoreArg_header(UNITY_LINE_TYPE cmock_line);
#define HAL_FDCAN_AddMessageToTxFifoQ_IgnoreArg_data() HAL_FDCAN_AddMessageToTxFifoQ_CMockIgnoreArg_data(__LINE__)
void HAL_FDCAN_AddMessageToTxFifoQ_CMockIgnoreArg_data(UNITY_LINE_TYPE cmock_line);
#define HAL_FDCAN_GetTxFifoFreeLevel_Ignore() TEST_FAIL_MESSAGE("HAL_FDCAN_GetTxFifoFreeLevel requires _IgnoreAndReturn");
#define HAL_FDCAN_GetTxFifoFreeLevel_IgnoreAndReturn(cmock_retval) HAL_FDCAN_GetTxFifoFreeLevel_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_FDCAN_GetTxFifoFreeLevel_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, uint32_t cmock_to_return);
#define HAL_FDCAN_GetTxFifoFreeLevel_StopIgnore() HAL_FDCAN_GetTxFifoFreeLevel_CMockStopIgnore()
void HAL_FDCAN_GetTxFifoFreeLevel_CMockStopIgnore(void);
#define HAL_FDCAN_GetTxFifoFreeLevel_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_FDCAN_GetTxFifoFreeLevel requires _ExpectAnyArgsAndReturn");
#define HAL_FDCAN_GetTxFifoFreeLevel_ExpectAnyArgsAndReturn(cmock_retval) HAL_FDCAN_GetTxFifoFreeLevel_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_FDCAN_GetTxFifoFreeLevel_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, uint32_t cmock_to_return);
#define HAL_FDCAN_GetTxFifoFreeLevel_Expect(hfdcan) TEST_FAIL_MESSAGE("HAL_FDCAN_GetTxFifoFreeLevel requires _ExpectAndReturn");
#define HAL_FDCAN_GetTxFifoFreeLevel_ExpectAndReturn(hfdcan, cmock_retval) HAL_FDCAN_GetTxFifoFreeLevel_CMockExpectAndReturn(__LINE__, hfdcan, cmock_retval)
void HAL_FDCAN_GetTxFifoFreeLevel_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, FDCAN_HandleTypeDef* hfdcan, uint32_t cmock_to_return);
typedef uint32_t (* CMOCK_HAL_FDCAN_GetTxFifoFreeLevel_CALLBACK)(FDCAN_HandleTypeDef* hfdcan, int cmock_num_calls);
void HAL_FDCAN_GetTxFifoFreeLevel_AddCallback(CMOCK_HAL_FDCAN_GetTxFifoFreeLevel_CALLBACK Callback);
void HAL_FDCAN_GetTxFifoFreeLevel_Stub(CMOCK_HAL_FDCAN_GetTxFifoFreeLevel_CALLBACK Callback);
#define HAL_FDCAN_GetTxFifoFreeLevel_StubWithCallback HAL_FDCAN_GetTxFifoFreeLevel_Stub
int HAL_FDCAN_GetTxFifoFreeLevel_CallCount(void);
#define HAL_FDCAN_GetTxFifoFreeLevel_ReturnThruPtr_hfdcan(hfdcan) HAL_FDCAN_GetTxFifoFreeLevel_CMockReturnMemThruPtr_hfdcan(__LINE__, hfdcan, sizeof(FDCAN_HandleTypeDef))
#define HAL_FDCAN_GetTxFifoFreeLevel_ReturnArrayThruPtr_hfdcan(hfdcan, cmock_len) HAL_FDCAN_GetTxFifoFreeLevel_CMockReturnMemThruPtr_hfdcan(__LINE__, hfdcan, (cmock_len * sizeof(*hfdcan)))
#define HAL_FDCAN_GetTxFifoFreeLevel_ReturnMemThruPtr_hfdcan(hfdcan, cmock_size) HAL_FDCAN_GetTxFifoFreeLevel_CMockReturnMemThruPtr_hfdcan(__LINE__, hfdcan, (cmock_size))
void HAL_FDCAN_GetTxFifoFreeLevel_CMockReturnMemThruPtr_hfdcan(UNITY_LINE_TYPE cmock_line, FDCAN_HandleTypeDef const* hfdcan, size_t cmock_size);
#define HAL_FDCAN_GetTxFifoFreeLevel_IgnoreArg_hfdcan() HAL_FDCAN_GetTxFifoFreeLevel_CMockIgnoreArg_hfdcan(__LINE__)
void HAL_FDCAN_GetTxFifoFreeLevel_CMockIgnoreArg_hfdcan(UNITY_LINE_TYPE cmock_line);
#define HAL_FDCAN_Start_Ignore() TEST_FAIL_MESSAGE("HAL_FDCAN_Start requires _IgnoreAndReturn");
#define HAL_FDCAN_Start_IgnoreAndReturn(cmock_retval) HAL_FDCAN_Start_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_FDCAN_Start_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_FDCAN_Start_StopIgnore() HAL_FDCAN_Start_CMockStopIgnore()
void HAL_FDCAN_Start_CMockStopIgnore(void);
#define HAL_FDCAN_Start_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_FDCAN_Start requires _ExpectAnyArgsAndReturn");
#define HAL_FDCAN_Start_ExpectAnyArgsAndReturn(cmock_retval) HAL_FDCAN_Start_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_FDCAN_Start_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_FDCAN_Start_Expect(hfdcan) TEST_FAIL_MESSAGE("HAL_FDCAN_Start requires _ExpectAndReturn");
#define HAL_FDCAN_Start_ExpectAndReturn(hfdcan, cmock_retval) HAL_FDCAN_Start_CMockExpectAndReturn(__LINE__, hfdcan, cmock_retval)
void HAL_FDCAN_Start_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, FDCAN_HandleTypeDef* hfdcan, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_FDCAN_Start_CALLBACK)(FDCAN_HandleTypeDef* hfdcan, int cmock_num_calls);
void HAL_FDCAN_Start_AddCallback(CMOCK_HAL_FDCAN_Start_CALLBACK Callback);
void HAL_FDCAN_Start_Stub(CMOCK_HAL_FDCAN_Start_CALLBACK Callback);
#define HAL_FDCAN_Start_StubWithCallback HAL_FDCAN_Start_Stub
int HAL_FDCAN_Start_CallCount(void);
#define HAL_FDCAN_Start_ReturnThruPtr_hfdcan(hfdcan) HAL_FDCAN_Start_CMockReturnMemThruPtr_hfdcan(__LINE__, hfdcan, sizeof(FDCAN_HandleTypeDef))
#define HAL_FDCAN_Start_ReturnArrayThruPtr_hfdcan(hfdcan, cmock_len) HAL_FDCAN_Start_CMockReturnMemThruPtr_hfdcan(__LINE__, hfdcan, (cmock_len * sizeof(*hfdcan)))
#define HAL_FDCAN_Start_ReturnMemThruPtr_hfdcan(hfdcan, cmock_size) HAL_FDCAN_Start_CMockReturnMemThruPtr_hfdcan(__LINE__, hfdcan, (cmock_size))
void HAL_FDCAN_Start_CMockReturnMemThruPtr_hfdcan(UNITY_LINE_TYPE cmock_line, FDCAN_HandleTypeDef const* hfdcan, size_t cmock_size);
#define HAL_FDCAN_Start_IgnoreArg_hfdcan() HAL_FDCAN_Start_CMockIgnoreArg_hfdcan(__LINE__)
void HAL_FDCAN_Start_CMockIgnoreArg_hfdcan(UNITY_LINE_TYPE cmock_line);
#define HAL_FDCAN_Stop_Ignore() TEST_FAIL_MESSAGE("HAL_FDCAN_Stop requires _IgnoreAndReturn");
#define HAL_FDCAN_Stop_IgnoreAndReturn(cmock_retval) HAL_FDCAN_Stop_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_FDCAN_Stop_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_FDCAN_Stop_StopIgnore() HAL_FDCAN_Stop_CMockStopIgnore()
void HAL_FDCAN_Stop_CMockStopIgnore(void);
#define HAL_FDCAN_Stop_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_FDCAN_Stop requires _ExpectAnyArgsAndReturn");
#define HAL_FDCAN_Stop_ExpectAnyArgsAndReturn(cmock_retval) HAL_FDCAN_Stop_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_FDCAN_Stop_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_FDCAN_Stop_Expect(hfdcan) TEST_FAIL_MESSAGE("HAL_FDCAN_Stop requires _ExpectAndReturn");
#define HAL_FDCAN_Stop_ExpectAndReturn(hfdcan, cmock_retval) HAL_FDCAN_Stop_CMockExpectAndReturn(__LINE__, hfdcan, cmock_retval)
void HAL_FDCAN_Stop_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, FDCAN_HandleTypeDef* hfdcan, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_FDCAN_Stop_CALLBACK)(FDCAN_HandleTypeDef* hfdcan, int cmock_num_calls);
void HAL_FDCAN_Stop_AddCallback(CMOCK_HAL_FDCAN_Stop_CALLBACK Callback);
void HAL_FDCAN_Stop_Stub(CMOCK_HAL_FDCAN_Stop_CALLBACK Callback);
#define HAL_FDCAN_Stop_StubWithCallback HAL_FDCAN_Stop_Stub
int HAL_FDCAN_Stop_CallCount(void);
#define HAL_FDCAN_Stop_ReturnThruPtr_hfdcan(hfdcan) HAL_FDCAN_Stop_CMockReturnMemThruPtr_hfdcan(__LINE__, hfdcan, sizeof(FDCAN_HandleTypeDef))
#define HAL_FDCAN_Stop_ReturnArrayThruPtr_hfdcan(hfdcan, cmock_len) HAL_FDCAN_Stop_CMockReturnMemThruPtr_hfdcan(__LINE__, hfdcan, (cmock_len * sizeof(*hfdcan)))
#define HAL_FDCAN_Stop_ReturnMemThruPtr_hfdcan(hfdcan, cmock_size) HAL_FDCAN_Stop_CMockReturnMemThruPtr_hfdcan(__LINE__, hfdcan, (cmock_size))
void HAL_FDCAN_Stop_CMockReturnMemThruPtr_hfdcan(UNITY_LINE_TYPE cmock_line, FDCAN_HandleTypeDef const* hfdcan, size_t cmock_size);
#define HAL_FDCAN_Stop_IgnoreArg_hfdcan() HAL_FDCAN_Stop_CMockIgnoreArg_hfdcan(__LINE__)
void HAL_FDCAN_Stop_CMockIgnoreArg_hfdcan(UNITY_LINE_TYPE cmock_line);
#define HAL_FDCAN_ActivateNotification_Ignore() TEST_FAIL_MESSAGE("HAL_FDCAN_ActivateNotification requires _IgnoreAndReturn");
#define HAL_FDCAN_ActivateNotification_IgnoreAndReturn(cmock_retval) HAL_FDCAN_ActivateNotification_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_FDCAN_ActivateNotification_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_FDCAN_ActivateNotification_StopIgnore() HAL_FDCAN_ActivateNotification_CMockStopIgnore()
void HAL_FDCAN_ActivateNotification_CMockStopIgnore(void);
#define HAL_FDCAN_ActivateNotification_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_FDCAN_ActivateNotification requires _ExpectAnyArgsAndReturn");
#define HAL_FDCAN_ActivateNotification_ExpectAnyArgsAndReturn(cmock_retval) HAL_FDCAN_ActivateNotification_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_FDCAN_ActivateNotification_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_FDCAN_ActivateNotification_Expect(hfdcan, it, tx_buffer_index) TEST_FAIL_MESSAGE("HAL_FDCAN_ActivateNotification requires _ExpectAndReturn");
#define HAL_FDCAN_ActivateNotification_ExpectAndReturn(hfdcan, it, tx_buffer_index, cmock_retval) HAL_FDCAN_ActivateNotification_CMockExpectAndReturn(__LINE__, hfdcan, it, tx_buffer_index, cmock_retval)
void HAL_FDCAN_ActivateNotification_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, FDCAN_HandleTypeDef* hfdcan, uint32_t it, uint32_t tx_buffer_index, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_FDCAN_ActivateNotification_CALLBACK)(FDCAN_HandleTypeDef* hfdcan, uint32_t it, uint32_t tx_buffer_index, int cmock_num_calls);
void HAL_FDCAN_ActivateNotification_AddCallback(CMOCK_HAL_FDCAN_ActivateNotification_CALLBACK Callback);
void HAL_FDCAN_ActivateNotification_Stub(CMOCK_HAL_FDCAN_ActivateNotification_CALLBACK Callback);
#define HAL_FDCAN_ActivateNotification_StubWithCallback HAL_FDCAN_ActivateNotification_Stub
int HAL_FDCAN_ActivateNotification_CallCount(void);
#define HAL_FDCAN_ActivateNotification_ReturnThruPtr_hfdcan(hfdcan) HAL_FDCAN_ActivateNotification_CMockReturnMemThruPtr_hfdcan(__LINE__, hfdcan, sizeof(FDCAN_HandleTypeDef))
#define HAL_FDCAN_ActivateNotification_ReturnArrayThruPtr_hfdcan(hfdcan, cmock_len) HAL_FDCAN_ActivateNotification_CMockReturnMemThruPtr_hfdcan(__LINE__, hfdcan, (cmock_len * sizeof(*hfdcan)))
#define HAL_FDCAN_ActivateNotification_ReturnMemThruPtr_hfdcan(hfdcan, cmock_size) HAL_FDCAN_ActivateNotification_CMockReturnMemThruPtr_hfdcan(__LINE__, hfdcan, (cmock_size))
void HAL_FDCAN_ActivateNotification_CMockReturnMemThruPtr_hfdcan(UNITY_LINE_TYPE cmock_line, FDCAN_HandleTypeDef const* hfdcan, size_t cmock_size);
#define HAL_FDCAN_ActivateNotification_IgnoreArg_hfdcan() HAL_FDCAN_ActivateNotification_CMockIgnoreArg_hfdcan(__LINE__)
void HAL_FDCAN_ActivateNotification_CMockIgnoreArg_hfdcan(UNITY_LINE_TYPE cmock_line);
#define HAL_FDCAN_ActivateNotification_IgnoreArg_it() HAL_FDCAN_ActivateNotification_CMockIgnoreArg_it(__LINE__)
void HAL_FDCAN_ActivateNotification_CMockIgnoreArg_it(UNITY_LINE_TYPE cmock_line);
#define HAL_FDCAN_ActivateNotification_IgnoreArg_tx_buffer_index() HAL_FDCAN_ActivateNotification_CMockIgnoreArg_tx_buffer_index(__LINE__)
void HAL_FDCAN_ActivateNotification_CMockIgnoreArg_tx_buffer_index(UNITY_LINE_TYPE cmock_line);
#define HAL_FDCAN_GetRxFifoFillLevel_Ignore() TEST_FAIL_MESSAGE("HAL_FDCAN_GetRxFifoFillLevel requires _IgnoreAndReturn");
#define HAL_FDCAN_GetRxFifoFillLevel_IgnoreAndReturn(cmock_retval) HAL_FDCAN_GetRxFifoFillLevel_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_FDCAN_GetRxFifoFillLevel_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, uint32_t cmock_to_return);
#define HAL_FDCAN_GetRxFifoFillLevel_StopIgnore() HAL_FDCAN_GetRxFifoFillLevel_CMockStopIgnore()
void HAL_FDCAN_GetRxFifoFillLevel_CMockStopIgnore(void);
#define HAL_FDCAN_GetRxFifoFillLevel_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_FDCAN_GetRxFifoFillLevel requires _ExpectAnyArgsAndReturn");
#define HAL_FDCAN_GetRxFifoFillLevel_ExpectAnyArgsAndReturn(cmock_retval) HAL_FDCAN_GetRxFifoFillLevel_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_FDCAN_GetRxFifoFillLevel_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, uint32_t cmock_to_return);
#define HAL_FDCAN_GetRxFifoFillLevel_Expect(hfdcan, fifo) TEST_FAIL_MESSAGE("HAL_FDCAN_GetRxFifoFillLevel requires _ExpectAndReturn");
#define HAL_FDCAN_GetRxFifoFillLevel_ExpectAndReturn(hfdcan, fifo, cmock_retval) HAL_FDCAN_GetRxFifoFillLevel_CMockExpectAndReturn(__LINE__, hfdcan, fifo, cmock_retval)
void HAL_FDCAN_GetRxFifoFillLevel_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, FDCAN_HandleTypeDef* hfdcan, uint32_t fifo, uint32_t cmock_to_return);
typedef uint32_t (* CMOCK_HAL_FDCAN_GetRxFifoFillLevel_CALLBACK)(FDCAN_HandleTypeDef* hfdcan, uint32_t fifo, int cmock_num_calls);
void HAL_FDCAN_GetRxFifoFillLevel_AddCallback(CMOCK_HAL_FDCAN_GetRxFifoFillLevel_CALLBACK Callback);
void HAL_FDCAN_GetRxFifoFillLevel_Stub(CMOCK_HAL_FDCAN_GetRxFifoFillLevel_CALLBACK Callback);
#define HAL_FDCAN_GetRxFifoFillLevel_StubWithCallback HAL_FDCAN_GetRxFifoFillLevel_Stub
int HAL_FDCAN_GetRxFifoFillLevel_CallCount(void);
#define HAL_FDCAN_GetRxFifoFillLevel_ReturnThruPtr_hfdcan(hfdcan) HAL_FDCAN_GetRxFifoFillLevel_CMockReturnMemThruPtr_hfdcan(__LINE__, hfdcan, sizeof(FDCAN_HandleTypeDef))
#define HAL_FDCAN_GetRxFifoFillLevel_ReturnArrayThruPtr_hfdcan(hfdcan, cmock_len) HAL_FDCAN_GetRxFifoFillLevel_CMockReturnMemThruPtr_hfdcan(__LINE__, hfdcan, (cmock_len * sizeof(*hfdcan)))
#define HAL_FDCAN_GetRxFifoFillLevel_ReturnMemThruPtr_hfdcan(hfdcan, cmock_size) HAL_FDCAN_GetRxFifoFillLevel_CMockReturnMemThruPtr_hfdcan(__LINE__, hfdcan, (cmock_size))
void HAL_FDCAN_GetRxFifoFillLevel_CMockReturnMemThruPtr_hfdcan(UNITY_LINE_TYPE cmock_line, FDCAN_HandleTypeDef const* hfdcan, size_t cmock_size);
#define HAL_FDCAN_GetRxFifoFillLevel_IgnoreArg_hfdcan() HAL_FDCAN_GetRxFifoFillLevel_CMockIgnoreArg_hfdcan(__LINE__)
void HAL_FDCAN_GetRxFifoFillLevel_CMockIgnoreArg_hfdcan(UNITY_LINE_TYPE cmock_line);
#define HAL_FDCAN_GetRxFifoFillLevel_IgnoreArg_fifo() HAL_FDCAN_GetRxFifoFillLevel_CMockIgnoreArg_fifo(__LINE__)
void HAL_FDCAN_GetRxFifoFillLevel_CMockIgnoreArg_fifo(UNITY_LINE_TYPE cmock_line);
#define HAL_FDCAN_GetRxMessage_Ignore() TEST_FAIL_MESSAGE("HAL_FDCAN_GetRxMessage requires _IgnoreAndReturn");
#define HAL_FDCAN_GetRxMessage_IgnoreAndReturn(cmock_retval) HAL_FDCAN_GetRxMessage_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_FDCAN_GetRxMessage_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_FDCAN_GetRxMessage_StopIgnore() HAL_FDCAN_GetRxMessage_CMockStopIgnore()
void HAL_FDCAN_GetRxMessage_CMockStopIgnore(void);
#define HAL_FDCAN_GetRxMessage_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_FDCAN_GetRxMessage requires _ExpectAnyArgsAndReturn");
#define HAL_FDCAN_GetRxMessage_ExpectAnyArgsAndReturn(cmock_retval) HAL_FDCAN_GetRxMessage_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_FDCAN_GetRxMessage_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_FDCAN_GetRxMessage_Expect(hfdcan, fifo, header, data) TEST_FAIL_MESSAGE("HAL_FDCAN_GetRxMessage requires _ExpectAndReturn");
#define HAL_FDCAN_GetRxMessage_ExpectAndReturn(hfdcan, fifo, header, data, cmock_retval) HAL_FDCAN_GetRxMessage_CMockExpectAndReturn(__LINE__, hfdcan, fifo, header, data, cmock_retval)
void HAL_FDCAN_GetRxMessage_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, FDCAN_HandleTypeDef* hfdcan, uint32_t fifo, FDCAN_RxHeaderTypeDef* header, uint8_t* data, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_FDCAN_GetRxMessage_CALLBACK)(FDCAN_HandleTypeDef* hfdcan, uint32_t fifo, FDCAN_RxHeaderTypeDef* header, uint8_t* data, int cmock_num_calls);
void HAL_FDCAN_GetRxMessage_AddCallback(CMOCK_HAL_FDCAN_GetRxMessage_CALLBACK Callback);
void HAL_FDCAN_GetRxMessage_Stub(CMOCK_HAL_FDCAN_GetRxMessage_CALLBACK Callback);
#define HAL_FDCAN_GetRxMessage_StubWithCallback HAL_FDCAN_GetRxMessage_Stub
int HAL_FDCAN_GetRxMessage_CallCount(void);
#define HAL_FDCAN_GetRxMessage_ReturnThruPtr_hfdcan(hfdcan) HAL_FDCAN_GetRxMessage_CMockReturnMemThruPtr_hfdcan(__LINE__, hfdcan, sizeof(FDCAN_HandleTypeDef))
#define HAL_FDCAN_GetRxMessage_ReturnArrayThruPtr_hfdcan(hfdcan, cmock_len) HAL_FDCAN_GetRxMessage_CMockReturnMemThruPtr_hfdcan(__LINE__, hfdcan, (cmock_len * sizeof(*hfdcan)))
#define HAL_FDCAN_GetRxMessage_ReturnMemThruPtr_hfdcan(hfdcan, cmock_size) HAL_FDCAN_GetRxMessage_CMockReturnMemThruPtr_hfdcan(__LINE__, hfdcan, (cmock_size))
void HAL_FDCAN_GetRxMessage_CMockReturnMemThruPtr_hfdcan(UNITY_LINE_TYPE cmock_line, FDCAN_HandleTypeDef const* hfdcan, size_t cmock_size);
#define HAL_FDCAN_GetRxMessage_ReturnThruPtr_header(header) HAL_FDCAN_GetRxMessage_CMockReturnMemThruPtr_header(__LINE__, header, sizeof(FDCAN_RxHeaderTypeDef))
#define HAL_FDCAN_GetRxMessage_ReturnArrayThruPtr_header(header, cmock_len) HAL_FDCAN_GetRxMessage_CMockReturnMemThruPtr_header(__LINE__, header, (cmock_len * sizeof(*header)))
#define HAL_FDCAN_GetRxMessage_ReturnMemThruPtr_header(header, cmock_size) HAL_FDCAN_GetRxMessage_CMockReturnMemThruPtr_header(__LINE__, header, (cmock_size))
void HAL_FDCAN_GetRxMessage_CMockReturnMemThruPtr_header(UNITY_LINE_TYPE cmock_line, FDCAN_RxHeaderTypeDef const* header, size_t cmock_size);
#define HAL_FDCAN_GetRxMessage_ReturnThruPtr_data(data) HAL_FDCAN_GetRxMessage_CMockReturnMemThruPtr_data(__LINE__, data, sizeof(uint8_t))
#define HAL_FDCAN_GetRxMessage_ReturnArrayThruPtr_data(data, cmock_len) HAL_FDCAN_GetRxMessage_CMockReturnMemThruPtr_data(__LINE__, data, (cmock_len * sizeof(*data)))
#define HAL_FDCAN_GetRxMessage_ReturnMemThruPtr_data(data, cmock_size) HAL_FDCAN_GetRxMessage_CMockReturnMemThruPtr_data(__LINE__, data, (cmock_size))
void HAL_FDCAN_GetRxMessage_CMockReturnMemThruPtr_data(UNITY_LINE_TYPE cmock_line, uint8_t const* data, size_t cmock_size);
#define HAL_FDCAN_GetRxMessage_IgnoreArg_hfdcan() HAL_FDCAN_GetRxMessage_CMockIgnoreArg_hfdcan(__LINE__)
void HAL_FDCAN_GetRxMessage_CMockIgnoreArg_hfdcan(UNITY_LINE_TYPE cmock_line);
#define HAL_FDCAN_GetRxMessage_IgnoreArg_fifo() HAL_FDCAN_GetRxMessage_CMockIgnoreArg_fifo(__LINE__)
void HAL_FDCAN_GetRxMessage_CMockIgnoreArg_fifo(UNITY_LINE_TYPE cmock_line);
#define HAL_FDCAN_GetRxMessage_IgnoreArg_header() HAL_FDCAN_GetRxMessage_CMockIgnoreArg_header(__LINE__)
void HAL_FDCAN_GetRxMessage_CMockIgnoreArg_header(UNITY_LINE_TYPE cmock_line);
#define HAL_FDCAN_GetRxMessage_IgnoreArg_data() HAL_FDCAN_GetRxMessage_CMockIgnoreArg_data(__LINE__)
void HAL_FDCAN_GetRxMessage_CMockIgnoreArg_data(UNITY_LINE_TYPE cmock_line);
#define HAL_FDCAN_GetProtocolStatus_Ignore() TEST_FAIL_MESSAGE("HAL_FDCAN_GetProtocolStatus requires _IgnoreAndReturn");
#define HAL_FDCAN_GetProtocolStatus_IgnoreAndReturn(cmock_retval) HAL_FDCAN_GetProtocolStatus_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_FDCAN_GetProtocolStatus_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_FDCAN_GetProtocolStatus_StopIgnore() HAL_FDCAN_GetProtocolStatus_CMockStopIgnore()
void HAL_FDCAN_GetProtocolStatus_CMockStopIgnore(void);
#define HAL_FDCAN_GetProtocolStatus_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_FDCAN_GetProtocolStatus requires _ExpectAnyArgsAndReturn");
#define HAL_FDCAN_GetProtocolStatus_ExpectAnyArgsAndReturn(cmock_retval) HAL_FDCAN_GetProtocolStatus_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_FDCAN_GetProtocolStatus_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_FDCAN_GetProtocolStatus_Expect(hfdcan, status) TEST_FAIL_MESSAGE("HAL_FDCAN_GetProtocolStatus requires _ExpectAndReturn");
#define HAL_FDCAN_GetProtocolStatus_ExpectAndReturn(hfdcan, status, cmock_retval) HAL_FDCAN_GetProtocolStatus_CMockExpectAndReturn(__LINE__, hfdcan, status, cmock_retval)
void HAL_FDCAN_GetProtocolStatus_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, FDCAN_HandleTypeDef* hfdcan, FDCAN_ProtocolStatusTypeDef* status, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_FDCAN_GetProtocolStatus_CALLBACK)(FDCAN_HandleTypeDef* hfdcan, FDCAN_ProtocolStatusTypeDef* status, int cmock_num_calls);
void HAL_FDCAN_GetProtocolStatus_AddCallback(CMOCK_HAL_FDCAN_GetProtocolStatus_CALLBACK Callback);
void HAL_FDCAN_GetProtocolStatus_Stub(CMOCK_HAL_FDCAN_GetProtocolStatus_CALLBACK Callback);
#define HAL_FDCAN_GetProtocolStatus_StubWithCallback HAL_FDCAN_GetProtocolStatus_Stub
int HAL_FDCAN_GetProtocolStatus_CallCount(void);
#define HAL_FDCAN_GetProtocolStatus_ReturnThruPtr_hfdcan(hfdcan) HAL_FDCAN_GetProtocolStatus_CMockReturnMemThruPtr_hfdcan(__LINE__, hfdcan, sizeof(FDCAN_HandleTypeDef))
#define HAL_FDCAN_GetProtocolStatus_ReturnArrayThruPtr_hfdcan(hfdcan, cmock_len) HAL_FDCAN_GetProtocolStatus_CMockReturnMemThruPtr_hfdcan(__LINE__, hfdcan, (cmock_len * sizeof(*hfdcan)))
#define HAL_FDCAN_GetProtocolStatus_ReturnMemThruPtr_hfdcan(hfdcan, cmock_size) HAL_FDCAN_GetProtocolStatus_CMockReturnMemThruPtr_hfdcan(__LINE__, hfdcan, (cmock_size))
void HAL_FDCAN_GetProtocolStatus_CMockReturnMemThruPtr_hfdcan(UNITY_LINE_TYPE cmock_line, FDCAN_HandleTypeDef const* hfdcan, size_t cmock_size);
