fakeSkyy/COD_UniCFramework/tests/impl/bsp/stm32h7/mocks/mock_stm32h7xx_hal.h
#define HAL_FDCAN_GetProtocolStatus_ReturnThruPtr_status(status) HAL_FDCAN_GetProtocolStatus_CMockReturnMemThruPtr_status(__LINE__, status, sizeof(FDCAN_ProtocolStatusTypeDef))
#define HAL_FDCAN_GetProtocolStatus_ReturnArrayThruPtr_status(status, cmock_len) HAL_FDCAN_GetProtocolStatus_CMockReturnMemThruPtr_status(__LINE__, status, (cmock_len * sizeof(*status)))
#define HAL_FDCAN_GetProtocolStatus_ReturnMemThruPtr_status(status, cmock_size) HAL_FDCAN_GetProtocolStatus_CMockReturnMemThruPtr_status(__LINE__, status, (cmock_size))
void HAL_FDCAN_GetProtocolStatus_CMockReturnMemThruPtr_status(UNITY_LINE_TYPE cmock_line, FDCAN_ProtocolStatusTypeDef const* status, size_t cmock_size);
#define HAL_FDCAN_GetProtocolStatus_IgnoreArg_hfdcan() HAL_FDCAN_GetProtocolStatus_CMockIgnoreArg_hfdcan(__LINE__)
void HAL_FDCAN_GetProtocolStatus_CMockIgnoreArg_hfdcan(UNITY_LINE_TYPE cmock_line);
#define HAL_FDCAN_GetProtocolStatus_IgnoreArg_status() HAL_FDCAN_GetProtocolStatus_CMockIgnoreArg_status(__LINE__)
void HAL_FDCAN_GetProtocolStatus_CMockIgnoreArg_status(UNITY_LINE_TYPE cmock_line);
#define HAL_FDCAN_RegisterRxFifo0Callback_Ignore() TEST_FAIL_MESSAGE("HAL_FDCAN_RegisterRxFifo0Callback requires _IgnoreAndReturn");
#define HAL_FDCAN_RegisterRxFifo0Callback_IgnoreAndReturn(cmock_retval) HAL_FDCAN_RegisterRxFifo0Callback_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_FDCAN_RegisterRxFifo0Callback_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_FDCAN_RegisterRxFifo0Callback_StopIgnore() HAL_FDCAN_RegisterRxFifo0Callback_CMockStopIgnore()
void HAL_FDCAN_RegisterRxFifo0Callback_CMockStopIgnore(void);
#define HAL_FDCAN_RegisterRxFifo0Callback_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_FDCAN_RegisterRxFifo0Callback requires _ExpectAnyArgsAndReturn");
#define HAL_FDCAN_RegisterRxFifo0Callback_ExpectAnyArgsAndReturn(cmock_retval) HAL_FDCAN_RegisterRxFifo0Callback_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_FDCAN_RegisterRxFifo0Callback_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_FDCAN_RegisterRxFifo0Callback_Expect(hfdcan, callback) TEST_FAIL_MESSAGE("HAL_FDCAN_RegisterRxFifo0Callback requires _ExpectAndReturn");
#define HAL_FDCAN_RegisterRxFifo0Callback_ExpectAndReturn(hfdcan, callback, cmock_retval) HAL_FDCAN_RegisterRxFifo0Callback_CMockExpectAndReturn(__LINE__, hfdcan, callback, cmock_retval)
void HAL_FDCAN_RegisterRxFifo0Callback_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, FDCAN_HandleTypeDef* hfdcan, pFDCAN_RxFifo0CallbackTypeDef callback, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_FDCAN_RegisterRxFifo0Callback_CALLBACK)(FDCAN_HandleTypeDef* hfdcan, pFDCAN_RxFifo0CallbackTypeDef callback, int cmock_num_calls);
void HAL_FDCAN_RegisterRxFifo0Callback_AddCallback(CMOCK_HAL_FDCAN_RegisterRxFifo0Callback_CALLBACK Callback);
void HAL_FDCAN_RegisterRxFifo0Callback_Stub(CMOCK_HAL_FDCAN_RegisterRxFifo0Callback_CALLBACK Callback);
#define HAL_FDCAN_RegisterRxFifo0Callback_StubWithCallback HAL_FDCAN_RegisterRxFifo0Callback_Stub
int HAL_FDCAN_RegisterRxFifo0Callback_CallCount(void);
#define HAL_FDCAN_RegisterRxFifo0Callback_ReturnThruPtr_hfdcan(hfdcan) HAL_FDCAN_RegisterRxFifo0Callback_CMockReturnMemThruPtr_hfdcan(__LINE__, hfdcan, sizeof(FDCAN_HandleTypeDef))
#define HAL_FDCAN_RegisterRxFifo0Callback_ReturnArrayThruPtr_hfdcan(hfdcan, cmock_len) HAL_FDCAN_RegisterRxFifo0Callback_CMockReturnMemThruPtr_hfdcan(__LINE__, hfdcan, (cmock_len * sizeof(*hfdcan)))
#define HAL_FDCAN_RegisterRxFifo0Callback_ReturnMemThruPtr_hfdcan(hfdcan, cmock_size) HAL_FDCAN_RegisterRxFifo0Callback_CMockReturnMemThruPtr_hfdcan(__LINE__, hfdcan, (cmock_size))
void HAL_FDCAN_RegisterRxFifo0Callback_CMockReturnMemThruPtr_hfdcan(UNITY_LINE_TYPE cmock_line, FDCAN_HandleTypeDef const* hfdcan, size_t cmock_size);
#define HAL_FDCAN_RegisterRxFifo0Callback_IgnoreArg_hfdcan() HAL_FDCAN_RegisterRxFifo0Callback_CMockIgnoreArg_hfdcan(__LINE__)
void HAL_FDCAN_RegisterRxFifo0Callback_CMockIgnoreArg_hfdcan(UNITY_LINE_TYPE cmock_line);
#define HAL_FDCAN_RegisterRxFifo0Callback_IgnoreArg_callback() HAL_FDCAN_RegisterRxFifo0Callback_CMockIgnoreArg_callback(__LINE__)
void HAL_FDCAN_RegisterRxFifo0Callback_CMockIgnoreArg_callback(UNITY_LINE_TYPE cmock_line);
#define HAL_FDCAN_RegisterRxFifo1Callback_Ignore() TEST_FAIL_MESSAGE("HAL_FDCAN_RegisterRxFifo1Callback requires _IgnoreAndReturn");
#define HAL_FDCAN_RegisterRxFifo1Callback_IgnoreAndReturn(cmock_retval) HAL_FDCAN_RegisterRxFifo1Callback_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_FDCAN_RegisterRxFifo1Callback_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_FDCAN_RegisterRxFifo1Callback_StopIgnore() HAL_FDCAN_RegisterRxFifo1Callback_CMockStopIgnore()
void HAL_FDCAN_RegisterRxFifo1Callback_CMockStopIgnore(void);
#define HAL_FDCAN_RegisterRxFifo1Callback_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_FDCAN_RegisterRxFifo1Callback requires _ExpectAnyArgsAndReturn");
#define HAL_FDCAN_RegisterRxFifo1Callback_ExpectAnyArgsAndReturn(cmock_retval) HAL_FDCAN_RegisterRxFifo1Callback_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_FDCAN_RegisterRxFifo1Callback_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_FDCAN_RegisterRxFifo1Callback_Expect(hfdcan, callback) TEST_FAIL_MESSAGE("HAL_FDCAN_RegisterRxFifo1Callback requires _ExpectAndReturn");
#define HAL_FDCAN_RegisterRxFifo1Callback_ExpectAndReturn(hfdcan, callback, cmock_retval) HAL_FDCAN_RegisterRxFifo1Callback_CMockExpectAndReturn(__LINE__, hfdcan, callback, cmock_retval)
void HAL_FDCAN_RegisterRxFifo1Callback_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, FDCAN_HandleTypeDef* hfdcan, pFDCAN_RxFifo1CallbackTypeDef callback, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_FDCAN_RegisterRxFifo1Callback_CALLBACK)(FDCAN_HandleTypeDef* hfdcan, pFDCAN_RxFifo1CallbackTypeDef callback, int cmock_num_calls);
void HAL_FDCAN_RegisterRxFifo1Callback_AddCallback(CMOCK_HAL_FDCAN_RegisterRxFifo1Callback_CALLBACK Callback);
void HAL_FDCAN_RegisterRxFifo1Callback_Stub(CMOCK_HAL_FDCAN_RegisterRxFifo1Callback_CALLBACK Callback);
#define HAL_FDCAN_RegisterRxFifo1Callback_StubWithCallback HAL_FDCAN_RegisterRxFifo1Callback_Stub
int HAL_FDCAN_RegisterRxFifo1Callback_CallCount(void);
#define HAL_FDCAN_RegisterRxFifo1Callback_ReturnThruPtr_hfdcan(hfdcan) HAL_FDCAN_RegisterRxFifo1Callback_CMockReturnMemThruPtr_hfdcan(__LINE__, hfdcan, sizeof(FDCAN_HandleTypeDef))
#define HAL_FDCAN_RegisterRxFifo1Callback_ReturnArrayThruPtr_hfdcan(hfdcan, cmock_len) HAL_FDCAN_RegisterRxFifo1Callback_CMockReturnMemThruPtr_hfdcan(__LINE__, hfdcan, (cmock_len * sizeof(*hfdcan)))
#define HAL_FDCAN_RegisterRxFifo1Callback_ReturnMemThruPtr_hfdcan(hfdcan, cmock_size) HAL_FDCAN_RegisterRxFifo1Callback_CMockReturnMemThruPtr_hfdcan(__LINE__, hfdcan, (cmock_size))
void HAL_FDCAN_RegisterRxFifo1Callback_CMockReturnMemThruPtr_hfdcan(UNITY_LINE_TYPE cmock_line, FDCAN_HandleTypeDef const* hfdcan, size_t cmock_size);
#define HAL_FDCAN_RegisterRxFifo1Callback_IgnoreArg_hfdcan() HAL_FDCAN_RegisterRxFifo1Callback_CMockIgnoreArg_hfdcan(__LINE__)
void HAL_FDCAN_RegisterRxFifo1Callback_CMockIgnoreArg_hfdcan(UNITY_LINE_TYPE cmock_line);
#define HAL_FDCAN_RegisterRxFifo1Callback_IgnoreArg_callback() HAL_FDCAN_RegisterRxFifo1Callback_CMockIgnoreArg_callback(__LINE__)
void HAL_FDCAN_RegisterRxFifo1Callback_CMockIgnoreArg_callback(UNITY_LINE_TYPE cmock_line);
#define HAL_FDCAN_RegisterErrorStatusCallback_Ignore() TEST_FAIL_MESSAGE("HAL_FDCAN_RegisterErrorStatusCallback requires _IgnoreAndReturn");
#define HAL_FDCAN_RegisterErrorStatusCallback_IgnoreAndReturn(cmock_retval) HAL_FDCAN_RegisterErrorStatusCallback_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_FDCAN_RegisterErrorStatusCallback_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_FDCAN_RegisterErrorStatusCallback_StopIgnore() HAL_FDCAN_RegisterErrorStatusCallback_CMockStopIgnore()
void HAL_FDCAN_RegisterErrorStatusCallback_CMockStopIgnore(void);
#define HAL_FDCAN_RegisterErrorStatusCallback_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_FDCAN_RegisterErrorStatusCallback requires _ExpectAnyArgsAndReturn");
#define HAL_FDCAN_RegisterErrorStatusCallback_ExpectAnyArgsAndReturn(cmock_retval) HAL_FDCAN_RegisterErrorStatusCallback_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_FDCAN_RegisterErrorStatusCallback_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_FDCAN_RegisterErrorStatusCallback_Expect(hfdcan, callback) TEST_FAIL_MESSAGE("HAL_FDCAN_RegisterErrorStatusCallback requires _ExpectAndReturn");
#define HAL_FDCAN_RegisterErrorStatusCallback_ExpectAndReturn(hfdcan, callback, cmock_retval) HAL_FDCAN_RegisterErrorStatusCallback_CMockExpectAndReturn(__LINE__, hfdcan, callback, cmock_retval)
void HAL_FDCAN_RegisterErrorStatusCallback_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, FDCAN_HandleTypeDef* hfdcan, pFDCAN_ErrorStatusCallbackTypeDef callback, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_FDCAN_RegisterErrorStatusCallback_CALLBACK)(FDCAN_HandleTypeDef* hfdcan, pFDCAN_ErrorStatusCallbackTypeDef callback, int cmock_num_calls);
void HAL_FDCAN_RegisterErrorStatusCallback_AddCallback(CMOCK_HAL_FDCAN_RegisterErrorStatusCallback_CALLBACK Callback);
void HAL_FDCAN_RegisterErrorStatusCallback_Stub(CMOCK_HAL_FDCAN_RegisterErrorStatusCallback_CALLBACK Callback);
#define HAL_FDCAN_RegisterErrorStatusCallback_StubWithCallback HAL_FDCAN_RegisterErrorStatusCallback_Stub
int HAL_FDCAN_RegisterErrorStatusCallback_CallCount(void);
#define HAL_FDCAN_RegisterErrorStatusCallback_ReturnThruPtr_hfdcan(hfdcan) HAL_FDCAN_RegisterErrorStatusCallback_CMockReturnMemThruPtr_hfdcan(__LINE__, hfdcan, sizeof(FDCAN_HandleTypeDef))
#define HAL_FDCAN_RegisterErrorStatusCallback_ReturnArrayThruPtr_hfdcan(hfdcan, cmock_len) HAL_FDCAN_RegisterErrorStatusCallback_CMockReturnMemThruPtr_hfdcan(__LINE__, hfdcan, (cmock_len * sizeof(*hfdcan)))
#define HAL_FDCAN_RegisterErrorStatusCallback_ReturnMemThruPtr_hfdcan(hfdcan, cmock_size) HAL_FDCAN_RegisterErrorStatusCallback_CMockReturnMemThruPtr_hfdcan(__LINE__, hfdcan, (cmock_size))
void HAL_FDCAN_RegisterErrorStatusCallback_CMockReturnMemThruPtr_hfdcan(UNITY_LINE_TYPE cmock_line, FDCAN_HandleTypeDef const* hfdcan, size_t cmock_size);
#define HAL_FDCAN_RegisterErrorStatusCallback_IgnoreArg_hfdcan() HAL_FDCAN_RegisterErrorStatusCallback_CMockIgnoreArg_hfdcan(__LINE__)
void HAL_FDCAN_RegisterErrorStatusCallback_CMockIgnoreArg_hfdcan(UNITY_LINE_TYPE cmock_line);
#define HAL_FDCAN_RegisterErrorStatusCallback_IgnoreArg_callback() HAL_FDCAN_RegisterErrorStatusCallback_CMockIgnoreArg_callback(__LINE__)
void HAL_FDCAN_RegisterErrorStatusCallback_CMockIgnoreArg_callback(UNITY_LINE_TYPE cmock_line);
#define HAL_FDCAN_RegisterCallback_Ignore() TEST_FAIL_MESSAGE("HAL_FDCAN_RegisterCallback requires _IgnoreAndReturn");
#define HAL_FDCAN_RegisterCallback_IgnoreAndReturn(cmock_retval) HAL_FDCAN_RegisterCallback_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_FDCAN_RegisterCallback_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_FDCAN_RegisterCallback_StopIgnore() HAL_FDCAN_RegisterCallback_CMockStopIgnore()
void HAL_FDCAN_RegisterCallback_CMockStopIgnore(void);
#define HAL_FDCAN_RegisterCallback_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_FDCAN_RegisterCallback requires _ExpectAnyArgsAndReturn");
#define HAL_FDCAN_RegisterCallback_ExpectAnyArgsAndReturn(cmock_retval) HAL_FDCAN_RegisterCallback_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_FDCAN_RegisterCallback_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_FDCAN_RegisterCallback_Expect(hfdcan, id, callback) TEST_FAIL_MESSAGE("HAL_FDCAN_RegisterCallback requires _ExpectAndReturn");
#define HAL_FDCAN_RegisterCallback_ExpectAndReturn(hfdcan, id, callback, cmock_retval) HAL_FDCAN_RegisterCallback_CMockExpectAndReturn(__LINE__, hfdcan, id, callback, cmock_retval)
void HAL_FDCAN_RegisterCallback_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, FDCAN_HandleTypeDef* hfdcan, uint32_t id, pFDCAN_CallbackTypeDef callback, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_FDCAN_RegisterCallback_CALLBACK)(FDCAN_HandleTypeDef* hfdcan, uint32_t id, pFDCAN_CallbackTypeDef callback, int cmock_num_calls);
void HAL_FDCAN_RegisterCallback_AddCallback(CMOCK_HAL_FDCAN_RegisterCallback_CALLBACK Callback);
void HAL_FDCAN_RegisterCallback_Stub(CMOCK_HAL_FDCAN_RegisterCallback_CALLBACK Callback);
#define HAL_FDCAN_RegisterCallback_StubWithCallback HAL_FDCAN_RegisterCallback_Stub
int HAL_FDCAN_RegisterCallback_CallCount(void);
#define HAL_FDCAN_RegisterCallback_ReturnThruPtr_hfdcan(hfdcan) HAL_FDCAN_RegisterCallback_CMockReturnMemThruPtr_hfdcan(__LINE__, hfdcan, sizeof(FDCAN_HandleTypeDef))
#define HAL_FDCAN_RegisterCallback_ReturnArrayThruPtr_hfdcan(hfdcan, cmock_len) HAL_FDCAN_RegisterCallback_CMockReturnMemThruPtr_hfdcan(__LINE__, hfdcan, (cmock_len * sizeof(*hfdcan)))
#define HAL_FDCAN_RegisterCallback_ReturnMemThruPtr_hfdcan(hfdcan, cmock_size) HAL_FDCAN_RegisterCallback_CMockReturnMemThruPtr_hfdcan(__LINE__, hfdcan, (cmock_size))
void HAL_FDCAN_RegisterCallback_CMockReturnMemThruPtr_hfdcan(UNITY_LINE_TYPE cmock_line, FDCAN_HandleTypeDef const* hfdcan, size_t cmock_size);
#define HAL_FDCAN_RegisterCallback_IgnoreArg_hfdcan() HAL_FDCAN_RegisterCallback_CMockIgnoreArg_hfdcan(__LINE__)
void HAL_FDCAN_RegisterCallback_CMockIgnoreArg_hfdcan(UNITY_LINE_TYPE cmock_line);
#define HAL_FDCAN_RegisterCallback_IgnoreArg_id() HAL_FDCAN_RegisterCallback_CMockIgnoreArg_id(__LINE__)
void HAL_FDCAN_RegisterCallback_CMockIgnoreArg_id(UNITY_LINE_TYPE cmock_line);
#define HAL_FDCAN_RegisterCallback_IgnoreArg_callback() HAL_FDCAN_RegisterCallback_CMockIgnoreArg_callback(__LINE__)
void HAL_FDCAN_RegisterCallback_CMockIgnoreArg_callback(UNITY_LINE_TYPE cmock_line);
#define HAL_FLASH_Unlock_Ignore() TEST_FAIL_MESSAGE("HAL_FLASH_Unlock requires _IgnoreAndReturn");
#define HAL_FLASH_Unlock_IgnoreAndReturn(cmock_retval) HAL_FLASH_Unlock_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_FLASH_Unlock_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_FLASH_Unlock_StopIgnore() HAL_FLASH_Unlock_CMockStopIgnore()
void HAL_FLASH_Unlock_CMockStopIgnore(void);
#define HAL_FLASH_Unlock_Expect() TEST_FAIL_MESSAGE("HAL_FLASH_Unlock requires _ExpectAndReturn");
#define HAL_FLASH_Unlock_ExpectAndReturn(cmock_retval) HAL_FLASH_Unlock_CMockExpectAndReturn(__LINE__, cmock_retval)
void HAL_FLASH_Unlock_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_FLASH_Unlock_CALLBACK)(int cmock_num_calls);
void HAL_FLASH_Unlock_AddCallback(CMOCK_HAL_FLASH_Unlock_CALLBACK Callback);
void HAL_FLASH_Unlock_Stub(CMOCK_HAL_FLASH_Unlock_CALLBACK Callback);
#define HAL_FLASH_Unlock_StubWithCallback HAL_FLASH_Unlock_Stub
int HAL_FLASH_Unlock_CallCount(void);
#define HAL_FLASH_Lock_Ignore() TEST_FAIL_MESSAGE("HAL_FLASH_Lock requires _IgnoreAndReturn");
#define HAL_FLASH_Lock_IgnoreAndReturn(cmock_retval) HAL_FLASH_Lock_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_FLASH_Lock_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_FLASH_Lock_StopIgnore() HAL_FLASH_Lock_CMockStopIgnore()
void HAL_FLASH_Lock_CMockStopIgnore(void);
#define HAL_FLASH_Lock_Expect() TEST_FAIL_MESSAGE("HAL_FLASH_Lock requires _ExpectAndReturn");
#define HAL_FLASH_Lock_ExpectAndReturn(cmock_retval) HAL_FLASH_Lock_CMockExpectAndReturn(__LINE__, cmock_retval)
void HAL_FLASH_Lock_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_FLASH_Lock_CALLBACK)(int cmock_num_calls);
void HAL_FLASH_Lock_AddCallback(CMOCK_HAL_FLASH_Lock_CALLBACK Callback);
void HAL_FLASH_Lock_Stub(CMOCK_HAL_FLASH_Lock_CALLBACK Callback);
#define HAL_FLASH_Lock_StubWithCallback HAL_FLASH_Lock_Stub
int HAL_FLASH_Lock_CallCount(void);
#define HAL_FLASH_Program_Ignore() TEST_FAIL_MESSAGE("HAL_FLASH_Program requires _IgnoreAndReturn");
#define HAL_FLASH_Program_IgnoreAndReturn(cmock_retval) HAL_FLASH_Program_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_FLASH_Program_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_FLASH_Program_StopIgnore() HAL_FLASH_Program_CMockStopIgnore()
void HAL_FLASH_Program_CMockStopIgnore(void);
#define HAL_FLASH_Program_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_FLASH_Program requires _ExpectAnyArgsAndReturn");
#define HAL_FLASH_Program_ExpectAnyArgsAndReturn(cmock_retval) HAL_FLASH_Program_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_FLASH_Program_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_FLASH_Program_Expect(type, addr, data_addr) TEST_FAIL_MESSAGE("HAL_FLASH_Program requires _ExpectAndReturn");
#define HAL_FLASH_Program_ExpectAndReturn(type, addr, data_addr, cmock_retval) HAL_FLASH_Program_CMockExpectAndReturn(__LINE__, type, addr, data_addr, cmock_retval)
void HAL_FLASH_Program_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, uint32_t type, uint32_t addr, uint32_t data_addr, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_FLASH_Program_CALLBACK)(uint32_t type, uint32_t addr, uint32_t data_addr, int cmock_num_calls);
void HAL_FLASH_Program_AddCallback(CMOCK_HAL_FLASH_Program_CALLBACK Callback);
void HAL_FLASH_Program_Stub(CMOCK_HAL_FLASH_Program_CALLBACK Callback);
#define HAL_FLASH_Program_StubWithCallback HAL_FLASH_Program_Stub
int HAL_FLASH_Program_CallCount(void);
#define HAL_FLASH_Program_IgnoreArg_type() HAL_FLASH_Program_CMockIgnoreArg_type(__LINE__)
void HAL_FLASH_Program_CMockIgnoreArg_type(UNITY_LINE_TYPE cmock_line);
#define HAL_FLASH_Program_IgnoreArg_addr() HAL_FLASH_Program_CMockIgnoreArg_addr(__LINE__)
void HAL_FLASH_Program_CMockIgnoreArg_addr(UNITY_LINE_TYPE cmock_line);
#define HAL_FLASH_Program_IgnoreArg_data_addr() HAL_FLASH_Program_CMockIgnoreArg_data_addr(__LINE__)
void HAL_FLASH_Program_CMockIgnoreArg_data_addr(UNITY_LINE_TYPE cmock_line);
#define HAL_FLASHEx_Erase_Ignore() TEST_FAIL_MESSAGE("HAL_FLASHEx_Erase requires _IgnoreAndReturn");
#define HAL_FLASHEx_Erase_IgnoreAndReturn(cmock_retval) HAL_FLASHEx_Erase_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_FLASHEx_Erase_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_FLASHEx_Erase_StopIgnore() HAL_FLASHEx_Erase_CMockStopIgnore()
void HAL_FLASHEx_Erase_CMockStopIgnore(void);
#define HAL_FLASHEx_Erase_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_FLASHEx_Erase requires _ExpectAnyArgsAndReturn");
#define HAL_FLASHEx_Erase_ExpectAnyArgsAndReturn(cmock_retval) HAL_FLASHEx_Erase_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_FLASHEx_Erase_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_FLASHEx_Erase_Expect(erase, failed_sector) TEST_FAIL_MESSAGE("HAL_FLASHEx_Erase requires _ExpectAndReturn");
#define HAL_FLASHEx_Erase_ExpectAndReturn(erase, failed_sector, cmock_retval) HAL_FLASHEx_Erase_CMockExpectAndReturn(__LINE__, erase, failed_sector, cmock_retval)
void HAL_FLASHEx_Erase_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, FLASH_EraseInitTypeDef* erase, uint32_t* failed_sector, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_FLASHEx_Erase_CALLBACK)(FLASH_EraseInitTypeDef* erase, uint32_t* failed_sector, int cmock_num_calls);
void HAL_FLASHEx_Erase_AddCallback(CMOCK_HAL_FLASHEx_Erase_CALLBACK Callback);
void HAL_FLASHEx_Erase_Stub(CMOCK_HAL_FLASHEx_Erase_CALLBACK Callback);
#define HAL_FLASHEx_Erase_StubWithCallback HAL_FLASHEx_Erase_Stub
int HAL_FLASHEx_Erase_CallCount(void);
#define HAL_FLASHEx_Erase_ReturnThruPtr_erase(erase) HAL_FLASHEx_Erase_CMockReturnMemThruPtr_erase(__LINE__, erase, sizeof(FLASH_EraseInitTypeDef))
#define HAL_FLASHEx_Erase_ReturnArrayThruPtr_erase(erase, cmock_len) HAL_FLASHEx_Erase_CMockReturnMemThruPtr_erase(__LINE__, erase, (cmock_len * sizeof(*erase)))
#define HAL_FLASHEx_Erase_ReturnMemThruPtr_erase(erase, cmock_size) HAL_FLASHEx_Erase_CMockReturnMemThruPtr_erase(__LINE__, erase, (cmock_size))
void HAL_FLASHEx_Erase_CMockReturnMemThruPtr_erase(UNITY_LINE_TYPE cmock_line, FLASH_EraseInitTypeDef const* erase, size_t cmock_size);
#define HAL_FLASHEx_Erase_ReturnThruPtr_failed_sector(failed_sector) HAL_FLASHEx_Erase_CMockReturnMemThruPtr_failed_sector(__LINE__, failed_sector, sizeof(uint32_t))
#define HAL_FLASHEx_Erase_ReturnArrayThruPtr_failed_sector(failed_sector, cmock_len) HAL_FLASHEx_Erase_CMockReturnMemThruPtr_failed_sector(__LINE__, failed_sector, (cmock_len * sizeof(*failed_sector)))
#define HAL_FLASHEx_Erase_ReturnMemThruPtr_failed_sector(failed_sector, cmock_size) HAL_FLASHEx_Erase_CMockReturnMemThruPtr_failed_sector(__LINE__, failed_sector, (cmock_size))
void HAL_FLASHEx_Erase_CMockReturnMemThruPtr_failed_sector(UNITY_LINE_TYPE cmock_line, uint32_t const* failed_sector, size_t cmock_size);
#define HAL_FLASHEx_Erase_IgnoreArg_erase() HAL_FLASHEx_Erase_CMockIgnoreArg_erase(__LINE__)
void HAL_FLASHEx_Erase_CMockIgnoreArg_erase(UNITY_LINE_TYPE cmock_line);
#define HAL_FLASHEx_Erase_IgnoreArg_failed_sector() HAL_FLASHEx_Erase_CMockIgnoreArg_failed_sector(__LINE__)
void HAL_FLASHEx_Erase_CMockIgnoreArg_failed_sector(UNITY_LINE_TYPE cmock_line);
#define HAL_FLASH_ClearFlag_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_FLASH_ClearFlag requires _Ignore (not AndReturn)");
#define HAL_FLASH_ClearFlag_Ignore() HAL_FLASH_ClearFlag_CMockIgnore()
void HAL_FLASH_ClearFlag_CMockIgnore(void);
#define HAL_FLASH_ClearFlag_StopIgnore() HAL_FLASH_ClearFlag_CMockStopIgnore()
void HAL_FLASH_ClearFlag_CMockStopIgnore(void);
#define HAL_FLASH_ClearFlag_ExpectAnyArgsAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_FLASH_ClearFlag requires _ExpectAnyArgs (not AndReturn)");
#define HAL_FLASH_ClearFlag_ExpectAnyArgs() HAL_FLASH_ClearFlag_CMockExpectAnyArgs(__LINE__)
void HAL_FLASH_ClearFlag_CMockExpectAnyArgs(UNITY_LINE_TYPE cmock_line);
#define HAL_FLASH_ClearFlag_ExpectAndReturn(flags, cmock_retval) TEST_FAIL_MESSAGE("HAL_FLASH_ClearFlag requires _Expect (not AndReturn)");
#define HAL_FLASH_ClearFlag_Expect(flags) HAL_FLASH_ClearFlag_CMockExpect(__LINE__, flags)
void HAL_FLASH_ClearFlag_CMockExpect(UNITY_LINE_TYPE cmock_line, uint32_t flags);
typedef void (* CMOCK_HAL_FLASH_ClearFlag_CALLBACK)(uint32_t flags, int cmock_num_calls);
void HAL_FLASH_ClearFlag_AddCallback(CMOCK_HAL_FLASH_ClearFlag_CALLBACK Callback);
void HAL_FLASH_ClearFlag_Stub(CMOCK_HAL_FLASH_ClearFlag_CALLBACK Callback);
#define HAL_FLASH_ClearFlag_StubWithCallback HAL_FLASH_ClearFlag_Stub
int HAL_FLASH_ClearFlag_CallCount(void);
#define HAL_FLASH_ClearFlag_IgnoreArg_flags() HAL_FLASH_ClearFlag_CMockIgnoreArg_flags(__LINE__)
void HAL_FLASH_ClearFlag_CMockIgnoreArg_flags(UNITY_LINE_TYPE cmock_line);
#define SCB_CleanDCache_by_Addr_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("SCB_CleanDCache_by_Addr requires _Ignore (not AndReturn)");
#define SCB_CleanDCache_by_Addr_Ignore() SCB_CleanDCache_by_Addr_CMockIgnore()
void SCB_CleanDCache_by_Addr_CMockIgnore(void);
#define SCB_CleanDCache_by_Addr_StopIgnore() SCB_CleanDCache_by_Addr_CMockStopIgnore()
void SCB_CleanDCache_by_Addr_CMockStopIgnore(void);
#define SCB_CleanDCache_by_Addr_ExpectAnyArgsAndReturn(cmock_retval) TEST_FAIL_MESSAGE("SCB_CleanDCache_by_Addr requires _ExpectAnyArgs (not AndReturn)");
#define SCB_CleanDCache_by_Addr_ExpectAnyArgs() SCB_CleanDCache_by_Addr_CMockExpectAnyArgs(__LINE__)
