fakeSkyy/COD_UniCFramework/tests/impl/bsp/stm32h7/mocks/mock_stm32h7xx_hal.h
void SCB_CleanDCache_by_Addr_CMockExpectAnyArgs(UNITY_LINE_TYPE cmock_line);
#define SCB_CleanDCache_by_Addr_ExpectAndReturn(addr, len, cmock_retval) TEST_FAIL_MESSAGE("SCB_CleanDCache_by_Addr requires _Expect (not AndReturn)");
#define SCB_CleanDCache_by_Addr_Expect(addr, len) SCB_CleanDCache_by_Addr_CMockExpect(__LINE__, addr, len)
void SCB_CleanDCache_by_Addr_CMockExpect(UNITY_LINE_TYPE cmock_line, volatile void* addr, int32_t len);
typedef void (* CMOCK_SCB_CleanDCache_by_Addr_CALLBACK)(volatile void* addr, int32_t len, int cmock_num_calls);
void SCB_CleanDCache_by_Addr_AddCallback(CMOCK_SCB_CleanDCache_by_Addr_CALLBACK Callback);
void SCB_CleanDCache_by_Addr_Stub(CMOCK_SCB_CleanDCache_by_Addr_CALLBACK Callback);
#define SCB_CleanDCache_by_Addr_StubWithCallback SCB_CleanDCache_by_Addr_Stub
int SCB_CleanDCache_by_Addr_CallCount(void);
#define SCB_CleanDCache_by_Addr_ReturnThruPtr_addr(addr) SCB_CleanDCache_by_Addr_CMockReturnMemThruPtr_addr(__LINE__, addr, sizeof(*addr))
#define SCB_CleanDCache_by_Addr_ReturnArrayThruPtr_addr(addr, cmock_len) SCB_CleanDCache_by_Addr_CMockReturnMemThruPtr_addr(__LINE__, addr, (cmock_len * sizeof(*addr)))
#define SCB_CleanDCache_by_Addr_ReturnMemThruPtr_addr(addr, cmock_size) SCB_CleanDCache_by_Addr_CMockReturnMemThruPtr_addr(__LINE__, addr, (cmock_size))
void SCB_CleanDCache_by_Addr_CMockReturnMemThruPtr_addr(UNITY_LINE_TYPE cmock_line, void const* addr, size_t cmock_size);
#define SCB_CleanDCache_by_Addr_IgnoreArg_addr() SCB_CleanDCache_by_Addr_CMockIgnoreArg_addr(__LINE__)
void SCB_CleanDCache_by_Addr_CMockIgnoreArg_addr(UNITY_LINE_TYPE cmock_line);
#define SCB_CleanDCache_by_Addr_IgnoreArg_len() SCB_CleanDCache_by_Addr_CMockIgnoreArg_len(__LINE__)
void SCB_CleanDCache_by_Addr_CMockIgnoreArg_len(UNITY_LINE_TYPE cmock_line);
#define SCB_InvalidateDCache_by_Addr_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("SCB_InvalidateDCache_by_Addr requires _Ignore (not AndReturn)");
#define SCB_InvalidateDCache_by_Addr_Ignore() SCB_InvalidateDCache_by_Addr_CMockIgnore()
void SCB_InvalidateDCache_by_Addr_CMockIgnore(void);
#define SCB_InvalidateDCache_by_Addr_StopIgnore() SCB_InvalidateDCache_by_Addr_CMockStopIgnore()
void SCB_InvalidateDCache_by_Addr_CMockStopIgnore(void);
#define SCB_InvalidateDCache_by_Addr_ExpectAnyArgsAndReturn(cmock_retval) TEST_FAIL_MESSAGE("SCB_InvalidateDCache_by_Addr requires _ExpectAnyArgs (not AndReturn)");
#define SCB_InvalidateDCache_by_Addr_ExpectAnyArgs() SCB_InvalidateDCache_by_Addr_CMockExpectAnyArgs(__LINE__)
void SCB_InvalidateDCache_by_Addr_CMockExpectAnyArgs(UNITY_LINE_TYPE cmock_line);
#define SCB_InvalidateDCache_by_Addr_ExpectAndReturn(addr, len, cmock_retval) TEST_FAIL_MESSAGE("SCB_InvalidateDCache_by_Addr requires _Expect (not AndReturn)");
#define SCB_InvalidateDCache_by_Addr_Expect(addr, len) SCB_InvalidateDCache_by_Addr_CMockExpect(__LINE__, addr, len)
void SCB_InvalidateDCache_by_Addr_CMockExpect(UNITY_LINE_TYPE cmock_line, volatile void* addr, int32_t len);
typedef void (* CMOCK_SCB_InvalidateDCache_by_Addr_CALLBACK)(volatile void* addr, int32_t len, int cmock_num_calls);
void SCB_InvalidateDCache_by_Addr_AddCallback(CMOCK_SCB_InvalidateDCache_by_Addr_CALLBACK Callback);
void SCB_InvalidateDCache_by_Addr_Stub(CMOCK_SCB_InvalidateDCache_by_Addr_CALLBACK Callback);
#define SCB_InvalidateDCache_by_Addr_StubWithCallback SCB_InvalidateDCache_by_Addr_Stub
int SCB_InvalidateDCache_by_Addr_CallCount(void);
#define SCB_InvalidateDCache_by_Addr_ReturnThruPtr_addr(addr) SCB_InvalidateDCache_by_Addr_CMockReturnMemThruPtr_addr(__LINE__, addr, sizeof(*addr))
#define SCB_InvalidateDCache_by_Addr_ReturnArrayThruPtr_addr(addr, cmock_len) SCB_InvalidateDCache_by_Addr_CMockReturnMemThruPtr_addr(__LINE__, addr, (cmock_len * sizeof(*addr)))
#define SCB_InvalidateDCache_by_Addr_ReturnMemThruPtr_addr(addr, cmock_size) SCB_InvalidateDCache_by_Addr_CMockReturnMemThruPtr_addr(__LINE__, addr, (cmock_size))
void SCB_InvalidateDCache_by_Addr_CMockReturnMemThruPtr_addr(UNITY_LINE_TYPE cmock_line, void const* addr, size_t cmock_size);
#define SCB_InvalidateDCache_by_Addr_IgnoreArg_addr() SCB_InvalidateDCache_by_Addr_CMockIgnoreArg_addr(__LINE__)
void SCB_InvalidateDCache_by_Addr_CMockIgnoreArg_addr(UNITY_LINE_TYPE cmock_line);
#define SCB_InvalidateDCache_by_Addr_IgnoreArg_len() SCB_InvalidateDCache_by_Addr_CMockIgnoreArg_len(__LINE__)
void SCB_InvalidateDCache_by_Addr_CMockIgnoreArg_len(UNITY_LINE_TYPE cmock_line);

#ifdef __cplusplus
}
#endif

#if defined(__GNUC__) && !defined(__ICC) && !defined(__TMS470__)
#if __GNUC__ > 4 || (__GNUC__ == 4 && (__GNUC_MINOR__ > 6 || (__GNUC_MINOR__ == 6 && __GNUC_PATCHLEVEL__ > 0)))
#pragma GCC diagnostic pop
#endif
#endif

#endif
